<abi-corpus version='2.3'>
  <elf-needed>
    <dependency name='build/cached/third_party/boost-1.60.0/libboost_system.so'/>
    <dependency name='libm.so.6'/>
    <dependency name='libssl.so.1.0.0'/>
    <dependency name='libcrypto.so.1.0.0'/>
    <dependency name='librt.so.1'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libatomic.so.1'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_ZN5boost10shared_ptrINS_9iostreams6detail16mapped_file_implEE5resetIS3_EEvPT_' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN5boost10shared_ptrINS_9iostreams6detail20file_descriptor_implEE5resetIS3_EEvPT_' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN5boost15throw_exceptionINSt8ios_base7failureB5cxx11EEEvRKT_' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN5boost16exception_detail20copy_boost_exceptionEPNS_9exceptionEPKS1_' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='_ZNK5boost9iostreams18mapped_file_source5flagsEv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZNK5boost9iostreams18mapped_file_source7is_openEv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZNK5boost9iostreams18mapped_file_sourcecvMNS1_16safe_bool_helperEiEv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZNK5boost9iostreams18mapped_file_sourcentEv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZNK5boost9iostreams6detail20file_descriptor_impl7is_openEv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='_ZTIN5boost16exception_detail10clone_baseE' size='16' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTIN5boost16exception_detail10clone_implINS0_19error_info_injectorINSt8ios_base7failureB5cxx11EEEEE' size='56' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTIN5boost16exception_detail19error_info_injectorINSt8ios_base7failureB5cxx11EEE' size='56' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTIN5boost6detail15sp_counted_baseE' size='16' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTIN5boost6detail17sp_counted_impl_pINS_9iostreams6detail16mapped_file_implEEE' size='24' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTIN5boost6detail17sp_counted_impl_pINS_9iostreams6detail20file_descriptor_implEEE' size='24' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTIN5boost9exceptionE' size='16' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTSN5boost16exception_detail10clone_baseE' size='39' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTSN5boost16exception_detail10clone_implINS0_19error_info_injectorINSt8ios_base7failureB5cxx11EEEEE' size='97' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTSN5boost16exception_detail19error_info_injectorINSt8ios_base7failureB5cxx11EEE' size='78' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTSN5boost6detail15sp_counted_baseE' size='33' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTSN5boost6detail17sp_counted_impl_pINS_9iostreams6detail16mapped_file_implEEE' size='76' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTSN5boost6detail17sp_counted_impl_pINS_9iostreams6detail20file_descriptor_implEEE' size='80' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTSN5boost9exceptionE' size='19' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' comp-dir-path='/home/andrew/Documents/10gen/dev/src/mongodb' language='LANG_C_plus_plus'>
    <type-decl name='bool' size-in-bits='8' id='type-id-1'/>
    <type-decl name='char' size-in-bits='8' id='type-id-2'/>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='32' id='type-id-3'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-4' id='type-id-5'/>
    </array-type-def>
    <type-decl name='double' size-in-bits='64' id='type-id-6'/>
    <type-decl name='float' size-in-bits='32' id='type-id-7'/>
    <type-decl name='int' size-in-bits='32' id='type-id-8'/>
    <pointer-to-member-type size-in-bits='64' member-type-id='type-id-8' containing-type-id='type-id-9' id ='type-id-10'/>
    <type-decl name='long double' size-in-bits='128' id='type-id-11'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-12'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-13'/>
    <type-decl name='sizetype' size-in-bits='64' id='type-id-4'/>
    <class-decl name='_G_fpos_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-14' visibility='default' id='type-id-15'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' id='type-id-16'/>
    <class-decl name='__mbstate_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-17' visibility='default' filepath='/usr/include/wchar.h' line='82' column='1' id='type-id-18'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='/usr/include/wchar.h' line='85' column='1' id='type-id-19'>
          <data-member access='public'>
            <var-decl name='__wch' type-id='type-id-20' visibility='default' filepath='/usr/include/wchar.h' line='88' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='__wchb' type-id='type-id-3' visibility='default' filepath='/usr/include/wchar.h' line='92' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__count' type-id='type-id-8' visibility='default' filepath='/usr/include/wchar.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__value' type-id='type-id-19' visibility='default' filepath='/usr/include/wchar.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-21'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-20' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-20' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-22' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='div_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-23' visibility='default' id='type-id-24'/>
    <class-decl name='lconv' size-in-bits='768' is-struct='yes' visibility='default' id='type-id-25'/>
    <class-decl name='ldiv_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-26' visibility='default' filepath='/usr/include/stdlib.h' line='105' column='1' id='type-id-27'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-12' visibility='default' filepath='/usr/include/stdlib.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='type-id-12' visibility='default' filepath='/usr/include/stdlib.h' line='108' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='lldiv_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-28' visibility='default' filepath='/usr/include/stdlib.h' line='117' column='1' id='type-id-29'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-13' visibility='default' filepath='/usr/include/stdlib.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='type-id-13' visibility='default' filepath='/usr/include/stdlib.h' line='120' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/time.h' line='133' column='1' id='type-id-30'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-12' visibility='default' filepath='/usr/include/time.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-31' visibility='default' filepath='/usr/include/time.h' line='147' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='type-id-16' filepath='/usr/include/stdio.h' line='48' column='1' id='type-id-32'/>
    <typedef-decl name='_G_fpos_t' type-id='type-id-15' filepath='/usr/include/_G_config.h' line='25' column='1' id='type-id-14'/>
    <typedef-decl name='__FILE' type-id='type-id-16' filepath='/usr/include/stdio.h' line='64' column='1' id='type-id-33'/>
    <typedef-decl name='__clock_t' type-id='type-id-12' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='135' column='1' id='type-id-34'/>
    <typedef-decl name='__compar_fn_t' type-id='type-id-35' filepath='/usr/include/stdlib.h' line='741' column='1' id='type-id-36'/>
    <typedef-decl name='__int32_t' type-id='type-id-8' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='40' column='1' id='type-id-37'/>
    <typedef-decl name='__mbstate_t' type-id='type-id-18' filepath='/usr/include/wchar.h' line='94' column='1' id='type-id-17'/>
    <typedef-decl name='__time_t' type-id='type-id-12' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='139' column='1' id='type-id-38'/>
    <typedef-decl name='clock_t' type-id='type-id-34' filepath='/usr/include/time.h' line='59' column='1' id='type-id-39'/>
    <typedef-decl name='div_t' type-id='type-id-24' filepath='/usr/include/stdlib.h' line='101' column='1' id='type-id-23'/>
    <typedef-decl name='fpos_t' type-id='type-id-14' filepath='/usr/include/stdio.h' line='110' column='1' id='type-id-40'/>
    <typedef-decl name='int_least32_t' type-id='type-id-8' filepath='/usr/include/stdint.h' line='67' column='1' id='type-id-41'/>
    <typedef-decl name='intmax_t' type-id='type-id-12' filepath='/usr/include/stdint.h' line='134' column='1' id='type-id-42'/>
    <typedef-decl name='ldiv_t' type-id='type-id-27' filepath='/usr/include/stdlib.h' line='109' column='1' id='type-id-26'/>
    <typedef-decl name='lldiv_t' type-id='type-id-29' filepath='/usr/include/stdlib.h' line='121' column='1' id='type-id-28'/>
    <typedef-decl name='mbstate_t' type-id='type-id-17' filepath='/usr/include/wchar.h' line='106' column='1' id='type-id-43'/>
    <typedef-decl name='time_t' type-id='type-id-38' filepath='/usr/include/time.h' line='75' column='1' id='type-id-44'/>
    <typedef-decl name='wctrans_t' type-id='type-id-45' filepath='/usr/include/wctype.h' line='186' column='1' id='type-id-46'/>
    <typedef-decl name='wctype_t' type-id='type-id-47' filepath='/usr/include/wctype.h' line='52' column='1' id='type-id-48'/>
    <typedef-decl name='wint_t' type-id='type-id-20' filepath='/usr/lib/llvm-3.9/bin/../lib/clang/3.9.1/include/stddef.h' line='132' column='1' id='type-id-49'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-50'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-20'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-47'/>
    <type-decl name='unsigned long long int' size-in-bits='64' id='type-id-51'/>
    <type-decl name='wchar_t' size-in-bits='32' id='type-id-52'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-53'/>
    <qualified-type-def type-id='type-id-53' restrict='yes' id='type-id-54'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-55'/>
    <qualified-type-def type-id='type-id-55' restrict='yes' id='type-id-56'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-57'/>
    <reference-type-def kind='lvalue' type-id='type-id-58' size-in-bits='64' id='type-id-59'/>
    <reference-type-def kind='rvalue' type-id='type-id-58' size-in-bits='64' id='type-id-60'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-61'/>
    <reference-type-def kind='lvalue' type-id='type-id-62' size-in-bits='64' id='type-id-63'/>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-64'/>
    <reference-type-def kind='lvalue' type-id='type-id-65' size-in-bits='64' id='type-id-66'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-67'/>
    <reference-type-def kind='lvalue' type-id='type-id-68' size-in-bits='64' id='type-id-69'/>
    <reference-type-def kind='rvalue' type-id='type-id-68' size-in-bits='64' id='type-id-70'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-71'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-73'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-75'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-77'/>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-79'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-81'/>
    <reference-type-def kind='lvalue' type-id='type-id-82' size-in-bits='64' id='type-id-83'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-84'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-86'/>
    <reference-type-def kind='lvalue' type-id='type-id-87' size-in-bits='64' id='type-id-88'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-89'/>
    <reference-type-def kind='lvalue' type-id='type-id-90' size-in-bits='64' id='type-id-91'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-92'/>
    <reference-type-def kind='lvalue' type-id='type-id-93' size-in-bits='64' id='type-id-94'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-96'/>
    <reference-type-def kind='lvalue' type-id='type-id-97' size-in-bits='64' id='type-id-98'/>
    <pointer-type-def type-id='type-id-97' size-in-bits='64' id='type-id-99'/>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-101'/>
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-103'/>
    <pointer-type-def type-id='type-id-104' size-in-bits='64' id='type-id-105'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-107'/>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-109'/>
    <reference-type-def kind='lvalue' type-id='type-id-110' size-in-bits='64' id='type-id-111'/>
    <reference-type-def kind='rvalue' type-id='type-id-110' size-in-bits='64' id='type-id-112'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-113'/>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-115'/>
    <reference-type-def kind='lvalue' type-id='type-id-116' size-in-bits='64' id='type-id-117'/>
    <reference-type-def kind='rvalue' type-id='type-id-116' size-in-bits='64' id='type-id-118'/>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-119'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-121'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-122'/>
    <qualified-type-def type-id='type-id-122' restrict='yes' id='type-id-123'/>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-124'/>
    <qualified-type-def type-id='type-id-124' restrict='yes' id='type-id-125'/>
    <qualified-type-def type-id='type-id-37' const='yes' id='type-id-126'/>
    <pointer-type-def type-id='type-id-126' size-in-bits='64' id='type-id-45'/>
    <qualified-type-def type-id='type-id-58' const='yes' id='type-id-127'/>
    <reference-type-def kind='lvalue' type-id='type-id-127' size-in-bits='64' id='type-id-128'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-129'/>
    <qualified-type-def type-id='type-id-62' const='yes' id='type-id-130'/>
    <reference-type-def kind='lvalue' type-id='type-id-130' size-in-bits='64' id='type-id-131'/>
    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-132'/>
    <qualified-type-def type-id='type-id-65' const='yes' id='type-id-133'/>
    <reference-type-def kind='lvalue' type-id='type-id-133' size-in-bits='64' id='type-id-134'/>
    <qualified-type-def type-id='type-id-68' const='yes' id='type-id-135'/>
    <reference-type-def kind='lvalue' type-id='type-id-135' size-in-bits='64' id='type-id-136'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-137'/>
    <qualified-type-def type-id='type-id-72' const='yes' id='type-id-138'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-139'/>
    <qualified-type-def type-id='type-id-74' const='yes' id='type-id-140'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-141'/>
    <qualified-type-def type-id='type-id-76' const='yes' id='type-id-142'/>
    <reference-type-def kind='lvalue' type-id='type-id-142' size-in-bits='64' id='type-id-143'/>
    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-144'/>
    <qualified-type-def type-id='type-id-80' const='yes' id='type-id-145'/>
    <reference-type-def kind='lvalue' type-id='type-id-145' size-in-bits='64' id='type-id-146'/>
    <qualified-type-def type-id='type-id-82' const='yes' id='type-id-147'/>
    <reference-type-def kind='lvalue' type-id='type-id-147' size-in-bits='64' id='type-id-148'/>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-149'/>
    <qualified-type-def type-id='type-id-85' const='yes' id='type-id-150'/>
    <reference-type-def kind='lvalue' type-id='type-id-150' size-in-bits='64' id='type-id-151'/>
    <qualified-type-def type-id='type-id-87' const='yes' id='type-id-152'/>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-153'/>
    <qualified-type-def type-id='type-id-90' const='yes' id='type-id-154'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-155'/>
    <qualified-type-def type-id='type-id-156' const='yes' id='type-id-157'/>
    <qualified-type-def type-id='type-id-97' const='yes' id='type-id-158'/>
    <reference-type-def kind='lvalue' type-id='type-id-158' size-in-bits='64' id='type-id-159'/>
    <pointer-type-def type-id='type-id-158' size-in-bits='64' id='type-id-160'/>
    <qualified-type-def type-id='type-id-100' const='yes' id='type-id-161'/>
    <reference-type-def kind='lvalue' type-id='type-id-161' size-in-bits='64' id='type-id-162'/>
    <pointer-type-def type-id='type-id-161' size-in-bits='64' id='type-id-163'/>
    <qualified-type-def type-id='type-id-102' const='yes' id='type-id-164'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-165'/>
    <qualified-type-def type-id='type-id-104' const='yes' id='type-id-166'/>
    <reference-type-def kind='lvalue' type-id='type-id-166' size-in-bits='64' id='type-id-167'/>
    <qualified-type-def type-id='type-id-106' const='yes' id='type-id-168'/>
    <reference-type-def kind='lvalue' type-id='type-id-168' size-in-bits='64' id='type-id-169'/>
    <qualified-type-def type-id='type-id-108' const='yes' id='type-id-170'/>
    <reference-type-def kind='lvalue' type-id='type-id-170' size-in-bits='64' id='type-id-171'/>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' id='type-id-172'/>
    <qualified-type-def type-id='type-id-173' const='yes' id='type-id-174'/>
    <reference-type-def kind='lvalue' type-id='type-id-174' size-in-bits='64' id='type-id-175'/>
    <qualified-type-def type-id='type-id-176' const='yes' id='type-id-177'/>
    <qualified-type-def type-id='type-id-110' const='yes' id='type-id-178'/>
    <reference-type-def kind='lvalue' type-id='type-id-178' size-in-bits='64' id='type-id-179'/>
    <pointer-type-def type-id='type-id-178' size-in-bits='64' id='type-id-180'/>
    <qualified-type-def type-id='type-id-116' const='yes' id='type-id-181'/>
    <reference-type-def kind='lvalue' type-id='type-id-181' size-in-bits='64' id='type-id-182'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' id='type-id-183'/>
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-184'/>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-31'/>
    <qualified-type-def type-id='type-id-31' restrict='yes' id='type-id-185'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-186'/>
    <qualified-type-def type-id='type-id-186' restrict='yes' id='type-id-187'/>
    <qualified-type-def type-id='type-id-40' const='yes' id='type-id-188'/>
    <pointer-type-def type-id='type-id-188' size-in-bits='64' id='type-id-189'/>
    <qualified-type-def type-id='type-id-43' const='yes' id='type-id-190'/>
    <pointer-type-def type-id='type-id-190' size-in-bits='64' id='type-id-191'/>
    <qualified-type-def type-id='type-id-192' const='yes' id='type-id-193'/>
    <reference-type-def kind='lvalue' type-id='type-id-193' size-in-bits='64' id='type-id-194'/>
    <pointer-type-def type-id='type-id-193' size-in-bits='64' id='type-id-195'/>
    <qualified-type-def type-id='type-id-196' const='yes' id='type-id-197'/>
    <reference-type-def kind='lvalue' type-id='type-id-197' size-in-bits='64' id='type-id-198'/>
    <qualified-type-def type-id='type-id-199' const='yes' id='type-id-200'/>
    <reference-type-def kind='lvalue' type-id='type-id-200' size-in-bits='64' id='type-id-201'/>
    <qualified-type-def type-id='type-id-202' const='yes' id='type-id-203'/>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' id='type-id-204'/>
    <qualified-type-def type-id='type-id-205' const='yes' id='type-id-206'/>
    <pointer-type-def type-id='type-id-206' size-in-bits='64' id='type-id-207'/>
    <qualified-type-def type-id='type-id-208' const='yes' id='type-id-209'/>
    <reference-type-def kind='lvalue' type-id='type-id-209' size-in-bits='64' id='type-id-210'/>
    <pointer-type-def type-id='type-id-209' size-in-bits='64' id='type-id-211'/>
    <qualified-type-def type-id='type-id-212' const='yes' id='type-id-213'/>
    <reference-type-def kind='lvalue' type-id='type-id-213' size-in-bits='64' id='type-id-214'/>
    <qualified-type-def type-id='type-id-44' const='yes' id='type-id-215'/>
    <pointer-type-def type-id='type-id-215' size-in-bits='64' id='type-id-216'/>
    <qualified-type-def type-id='type-id-30' const='yes' id='type-id-217'/>
    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-218'/>
    <qualified-type-def type-id='type-id-218' restrict='yes' id='type-id-219'/>
    <qualified-type-def type-id='type-id-52' const='yes' id='type-id-220'/>
    <pointer-type-def type-id='type-id-220' size-in-bits='64' id='type-id-221'/>
    <qualified-type-def type-id='type-id-221' restrict='yes' id='type-id-222'/>
    <pointer-type-def type-id='type-id-221' size-in-bits='64' id='type-id-223'/>
    <qualified-type-def type-id='type-id-223' restrict='yes' id='type-id-224'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-225'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-226'/>
    <qualified-type-def type-id='type-id-226' restrict='yes' id='type-id-227'/>
    <pointer-type-def type-id='type-id-228' size-in-bits='64' id='type-id-35'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-229'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-230'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-231'/>
    <qualified-type-def type-id='type-id-231' restrict='yes' id='type-id-232'/>
    <pointer-type-def type-id='type-id-202' size-in-bits='64' id='type-id-233'/>
    <pointer-type-def type-id='type-id-205' size-in-bits='64' id='type-id-234'/>
    <reference-type-def kind='lvalue' type-id='type-id-208' size-in-bits='64' id='type-id-235'/>
    <pointer-type-def type-id='type-id-208' size-in-bits='64' id='type-id-236'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-237'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-238'/>
    <pointer-type-def type-id='type-id-239' size-in-bits='64' id='type-id-240'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-241'/>
    <qualified-type-def type-id='type-id-241' restrict='yes' id='type-id-242'/>
    <pointer-type-def type-id='type-id-241' size-in-bits='64' id='type-id-243'/>
    <qualified-type-def type-id='type-id-243' restrict='yes' id='type-id-244'/>
    <qualified-type-def type-id='type-id-245' const='yes' id='type-id-246'/>
    <reference-type-def kind='lvalue' type-id='type-id-246' size-in-bits='64' id='type-id-247'/>
    <type-decl name='variadic parameter type' id='type-id-248'/>
    <qualified-type-def type-id='type-id-22' restrict='yes' id='type-id-249'/>
    <qualified-type-def type-id='type-id-22' restrict='yes' id='type-id-250'/>
    <namespace-decl name='std'>
      <class-decl name='fpos&lt;__mbstate_t&gt;' size-in-bits='128' visibility='default' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/bits/postypes.h' line='112' column='1' id='type-id-208'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_off' type-id='type-id-251' visibility='default' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/bits/postypes.h' line='115' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_state' type-id='type-id-18' visibility='default' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/bits/postypes.h' line='116' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='ios_base' size-in-bits='1728' visibility='default' id='type-id-252'>
        <member-type access='private'>
          <class-decl name='failure' size-in-bits='256' visibility='default' id='type-id-212'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='openmode' type-id='type-id-254' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/bits/ios_base.h' line='429' column='1' id='type-id-253'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='seekdir' type-id='type-id-256' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/bits/ios_base.h' line='461' column='1' id='type-id-255'/>
        </member-type>
      </class-decl>
      <class-decl name='system_error' size-in-bits='256' visibility='default' id='type-id-257'/>
      <enum-decl name='_Ios_Openmode' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/bits/ios_base.h' line='111' column='1' id='type-id-254'>
        <underlying-type type-id='type-id-50'/>
        <enumerator name='_S_app' value='1'/>
        <enumerator name='_S_ate' value='2'/>
        <enumerator name='_S_bin' value='4'/>
        <enumerator name='_S_in' value='8'/>
        <enumerator name='_S_out' value='16'/>
        <enumerator name='_S_trunc' value='32'/>
        <enumerator name='_S_ios_openmode_end' value='65536'/>
        <enumerator name='_S_ios_openmode_max' value='2147483647'/>
        <enumerator name='_S_ios_openmode_min' value='-2147483648'/>
      </enum-decl>
      <enum-decl name='_Ios_Seekdir' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/bits/ios_base.h' line='193' column='1' id='type-id-256'>
        <underlying-type type-id='type-id-50'/>
        <enumerator name='_S_beg' value='0'/>
        <enumerator name='_S_cur' value='1'/>
        <enumerator name='_S_end' value='2'/>
        <enumerator name='_S_ios_seekdir_end' value='65536'/>
      </enum-decl>
      <enum-decl name='io_errc' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/bits/ios_base.h' line='203' column='1' id='type-id-258'>
        <underlying-type type-id='type-id-50'/>
        <enumerator name='stream' value='1'/>
      </enum-decl>
      <class-decl name='error_code' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/system_error' line='138' column='1' id='type-id-202'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_value' type-id='type-id-8' visibility='default' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/system_error' line='190' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_cat' type-id='type-id-195' visibility='default' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/system_error' line='191' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='error_condition' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/system_error' line='216' column='1' id='type-id-205'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_value' type-id='type-id-8' visibility='default' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/system_error' line='264' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_cat' type-id='type-id-195' visibility='default' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/system_error' line='265' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='ptrdiff_t' type-id='type-id-12' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/x86_64-linux-gnu/c++/5.4.0/bits/c++config.h' line='197' column='1' id='type-id-259'/>
      <typedef-decl name='size_t' type-id='type-id-47' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/x86_64-linux-gnu/c++/5.4.0/bits/c++config.h' line='196' column='1' id='type-id-260'/>
      <typedef-decl name='streamoff' type-id='type-id-12' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/bits/postypes.h' line='88' column='1' id='type-id-251'/>
      <typedef-decl name='streampos' type-id='type-id-208' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/bits/postypes.h' line='228' column='1' id='type-id-261'/>
      <typedef-decl name='streamsize' type-id='type-id-259' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/bits/postypes.h' line='98' column='1' id='type-id-262'/>
      <class-decl name='type_info' visibility='default' is-declaration-only='yes' id='type-id-263'/>
      <namespace-decl name='_V2'>
        <class-decl name='error_category' size-in-bits='64' visibility='default' id='type-id-192'/>
      </namespace-decl>
      <namespace-decl name='__cxx11'>
        <class-decl name='basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;' size-in-bits='256' visibility='default' id='type-id-264'/>
        <class-decl name='basic_string&lt;wchar_t, std::char_traits&lt;wchar_t&gt;, std::allocator&lt;wchar_t&gt; &gt;' size-in-bits='256' visibility='default' id='type-id-265'/>
        <typedef-decl name='string' type-id='type-id-264' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/bits/stringfwd.h' line='74' column='1' id='type-id-196'/>
        <typedef-decl name='wstring' type-id='type-id-265' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/bits/stringfwd.h' line='78' column='1' id='type-id-199'/>
      </namespace-decl>
    </namespace-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='394' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-260'/>
    </function-decl>
    <function-decl name='strerror' filepath='/usr/include/string.h' line='408' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-122'/>
    </function-decl>
    <namespace-decl name='boost'>
      <class-decl name='exception' size-in-bits='320' visibility='default' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='208' column='1' id='type-id-72'>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='data_' type-id='type-id-82' visibility='default' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='269' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='throw_function_' type-id='type-id-31' visibility='default' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='270' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <var-decl name='throw_file_' type-id='type-id-31' visibility='default' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='271' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='256'>
          <var-decl name='throw_line_' type-id='type-id-8' visibility='default' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='272' column='1'/>
        </data-member>
        <member-function access='protected' destructor='yes' vtable-offset='0'>
          <function-decl name='~exception' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='237' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-73' is-artificial='yes'/>
            <return type-id='type-id-266'/>
          </function-decl>
        </member-function>
        <member-function access='protected' static='yes' destructor='yes' vtable-offset='0'>
          <function-decl name='~exception' mangled-name='_ZN5boost9exceptionD2Ev' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='282' column='1' visibility='default' binding='global' size-in-bits='64'>
            <return type-id='type-id-266'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='shared_ptr&lt;boost::iostreams::detail::file_descriptor_impl&gt;' size-in-bits='128' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='336' column='1' id='type-id-110'>
        <member-type access='private'>
          <typedef-decl name='element_type' type-id='type-id-267' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='345' column='1' id='type-id-114'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='px' type-id='type-id-115' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='768' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='pn' type-id='type-id-58' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='769' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='reset&lt;boost::iostreams::detail::file_descriptor_impl&gt;' mangled-name='_ZN5boost10shared_ptrINS_9iostreams6detail20file_descriptor_implEE5resetIS3_EEvPT_' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='662' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10shared_ptrINS_9iostreams6detail20file_descriptor_implEE5resetIS3_EEvPT_'>
            <parameter type-id='type-id-113' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-89' name='p' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='662' column='1'/>
            <return type-id='type-id-266'/>
          </function-decl>
        </member-function>
      </class-decl>
      <namespace-decl name='detail'>
        <class-decl name='sp_counted_impl_p&lt;boost::iostreams::detail::file_descriptor_impl&gt;' size-in-bits='192' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_impl.hpp' line='53' column='1' id='type-id-65'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-62'/>
          <data-member access='private' layout-offset-in-bits='128'>
            <var-decl name='px_' type-id='type-id-89' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_impl.hpp' line='57' column='1'/>
          </data-member>
          <member-function access='public' vtable-offset='2'>
            <function-decl name='dispose' mangled-name='_ZN5boost6detail17sp_counted_impl_pINS_9iostreams6detail20file_descriptor_implEE7disposeEv' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_impl.hpp' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-67' is-artificial='yes'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public' vtable-offset='4'>
            <function-decl name='get_deleter' mangled-name='_ZN5boost6detail17sp_counted_impl_pINS_9iostreams6detail20file_descriptor_implEE11get_deleterERKSt9type_info' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_impl.hpp' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-67' is-artificial='yes'/>
              <parameter type-id='type-id-247'/>
              <return type-id='type-id-22'/>
            </function-decl>
          </member-function>
          <member-function access='public' vtable-offset='5'>
            <function-decl name='get_untyped_deleter' mangled-name='_ZN5boost6detail17sp_counted_impl_pINS_9iostreams6detail20file_descriptor_implEE19get_untyped_deleterEv' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_impl.hpp' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-67' is-artificial='yes'/>
              <return type-id='type-id-22'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='sp_array_access&lt;boost::iostreams::detail::file_descriptor_impl&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='175' column='1' id='type-id-268'>
        </class-decl>
        <class-decl name='sp_dereference&lt;boost::iostreams::detail::file_descriptor_impl&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='101' column='1' id='type-id-269'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='type-id-88' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='103' column='1' id='type-id-270'/>
          </member-type>
        </class-decl>
        <class-decl name='sp_element&lt;boost::iostreams::detail::file_descriptor_impl&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='76' column='1' id='type-id-271'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='type-id-87' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='78' column='1' id='type-id-267'/>
          </member-type>
        </class-decl>
        <class-decl name='sp_member_access&lt;boost::iostreams::detail::file_descriptor_impl&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='150' column='1' id='type-id-272'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='type-id-89' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='152' column='1' id='type-id-273'/>
          </member-type>
        </class-decl>
        <function-decl name='sp_enable_shared_from_this' mangled-name='_ZN5boost6detail26sp_enable_shared_from_thisEz' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='241' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost6detail26sp_enable_shared_from_thisEz'>
          <parameter is-variadic='yes'/>
          <return type-id='type-id-266'/>
        </function-decl>
        <function-decl name='sp_pointer_construct&lt;boost::iostreams::detail::file_descriptor_impl, boost::iostreams::detail::file_descriptor_impl&gt;' mangled-name='_ZN5boost6detail20sp_pointer_constructINS_9iostreams6detail20file_descriptor_implES4_EEvPNS_10shared_ptrIT_EEPT0_RNS0_12shared_countE' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='282' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost6detail20sp_pointer_constructINS_9iostreams6detail20file_descriptor_implES4_EEvPNS_10shared_ptrIT_EEPT0_RNS0_12shared_countE'>
          <parameter type-id='type-id-113' name='ppx' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='282' column='1'/>
          <parameter type-id='type-id-89' name='p' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='282' column='1'/>
          <parameter type-id='type-id-59' name='pn' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='282' column='1'/>
          <return type-id='type-id-266'/>
        </function-decl>
      </namespace-decl>
      <namespace-decl name='exception_detail'>
        <class-decl name='clone_base' size-in-bits='64' visibility='default' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='398' column='1' id='type-id-74'>
          <member-function access='public' destructor='yes' vtable-offset='0'>
            <function-decl name='~clone_base' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='406' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-75' is-artificial='yes'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes' vtable-offset='0'>
            <function-decl name='~clone_base' mangled-name='_ZN5boost16exception_detail10clone_baseD0Ev' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='406' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-75' name='this' is-artificial='yes'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes' vtable-offset='0'>
            <function-decl name='~clone_base' mangled-name='_ZN5boost16exception_detail10clone_baseD2Ev' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='406' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-75' name='this' is-artificial='yes'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public' vtable-offset='0'>
            <function-decl name='clone' mangled-name='_ZNK5boost16exception_detail10clone_base5cloneEv' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='402' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-141' is-artificial='yes'/>
              <return type-id='type-id-141'/>
            </function-decl>
          </member-function>
          <member-function access='public' vtable-offset='1'>
            <function-decl name='rethrow' mangled-name='_ZNK5boost16exception_detail10clone_base7rethrowEv' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='403' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-141' is-artificial='yes'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='clone_impl&lt;boost::exception_detail::error_info_injector&lt;std::ios_base::failure&gt; &gt;' size-in-bits='640' visibility='default' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='442' column='1' id='type-id-76'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-80'/>
          <base-class access='public' layout-offset-in-bits='192' is-virtual='yes' type-id='type-id-74'/>
          <member-type access='private'>
            <class-decl name='clone_tag' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='446' column='1' id='type-id-274'/>
          </member-type>
          <member-function access='public' destructor='yes' vtable-offset='0'>
            <function-decl name='~clone_impl' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='462' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-77' is-artificial='yes'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes' vtable-offset='0'>
            <function-decl name='~clone_impl' mangled-name='_ZN5boost16exception_detail10clone_implINS0_19error_info_injectorINSt8ios_base7failureB5cxx11EEEED0Ev' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='462' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-77' name='this' is-artificial='yes'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes' vtable-offset='0'>
            <function-decl name='~clone_impl' mangled-name='_ZN5boost16exception_detail10clone_implINS0_19error_info_injectorINSt8ios_base7failureB5cxx11EEEED1Ev' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='462' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-77' name='this' is-artificial='yes'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes' destructor='yes' vtable-offset='0'>
            <function-decl name='~clone_impl' mangled-name='_ZN5boost16exception_detail10clone_implINS0_19error_info_injectorINSt8ios_base7failureB5cxx11EEEED2Ev' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='462' column='1' visibility='default' binding='global' size-in-bits='64'>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='private' vtable-offset='3'>
            <function-decl name='clone' mangled-name='_ZNK5boost16exception_detail10clone_implINS0_19error_info_injectorINSt8ios_base7failureB5cxx11EEEE5cloneEv' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='469' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-144' is-artificial='yes'/>
              <return type-id='type-id-141'/>
            </function-decl>
          </member-function>
          <member-function access='private' vtable-offset='4'>
            <function-decl name='rethrow' mangled-name='_ZNK5boost16exception_detail10clone_implINS0_19error_info_injectorINSt8ios_base7failureB5cxx11EEEE7rethrowEv' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='475' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-144' is-artificial='yes'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='refcount_ptr&lt;boost::exception_detail::error_info_container&gt;' size-in-bits='64' visibility='default' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='23' column='1' id='type-id-82'>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='px_' type-id='type-id-79' visibility='default' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='66' column='1'/>
          </data-member>
        </class-decl>
        <class-decl name='error_info_container' size-in-bits='64' is-struct='yes' visibility='default' id='type-id-78'/>
        <class-decl name='error_info_injector&lt;std::ios_base::failure&gt;' size-in-bits='576' is-struct='yes' visibility='default' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='326' column='1' id='type-id-80'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-212'/>
          <base-class access='public' layout-offset-in-bits='256' type-id='type-id-72'/>
          <member-function access='public' destructor='yes' vtable-offset='0'>
            <function-decl name='~error_info_injector' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='336' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-81' is-artificial='yes'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes' vtable-offset='0'>
            <function-decl name='~error_info_injector' mangled-name='_ZN5boost16exception_detail19error_info_injectorINSt8ios_base7failureB5cxx11EED0Ev' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='336' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-81' name='this' is-artificial='yes'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes' vtable-offset='0'>
            <function-decl name='~error_info_injector' mangled-name='_ZN5boost16exception_detail19error_info_injectorINSt8ios_base7failureB5cxx11EED2Ev' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='336' column='1' visibility='default' binding='global' size-in-bits='64'>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
        </class-decl>
        <function-decl name='copy_boost_exception' mangled-name='_ZN5boost16exception_detail20copy_boost_exceptionEPNS_9exceptionEPKS1_' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='418' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost16exception_detail20copy_boost_exceptionEPNS_9exceptionEPKS1_'>
          <parameter type-id='type-id-73' name='a' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='418' column='1'/>
          <parameter type-id='type-id-139' name='b' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='418' column='1'/>
          <return type-id='type-id-266'/>
        </function-decl>
      </namespace-decl>
      <function-decl name='enable_current_exception&lt;boost::exception_detail::error_info_injector&lt;std::ios_base::failure&gt; &gt;' mangled-name='_ZN5boost24enable_current_exceptionINS_16exception_detail19error_info_injectorINSt8ios_base7failureB5cxx11EEEEENS1_10clone_implIT_EERKS7_' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='490' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost24enable_current_exceptionINS_16exception_detail19error_info_injectorINSt8ios_base7failureB5cxx11EEEEENS1_10clone_implIT_EERKS7_'>
        <parameter type-id='type-id-146' name='x' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='490' column='1'/>
        <return type-id='type-id-76'/>
      </function-decl>
      <namespace-decl name='iostreams'>
        <class-decl name='file_descriptor' size-in-bits='128' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/file_descriptor.hpp' line='46' column='1' id='type-id-100'>
          <member-type access='private'>
            <typedef-decl name='char_type' type-id='type-id-2' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/file_descriptor.hpp' line='51' column='1' id='type-id-102'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='handle_type' type-id='type-id-276' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/file_descriptor.hpp' line='50' column='1' id='type-id-275'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='pimpl_' type-id='type-id-110' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/file_descriptor.hpp' line='143' column='1'/>
          </data-member>
          <member-function access='public' constructor='yes'>
            <function-decl name='file_descriptor' mangled-name='_ZN5boost9iostreams15file_descriptorC2Ev' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='360' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams15file_descriptorC2Ev'>
              <parameter type-id='type-id-101' name='this' is-artificial='yes'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='file_descriptor' mangled-name='_ZN5boost9iostreams15file_descriptorC2EiNS0_21file_descriptor_flagsE' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='362' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams15file_descriptorC2EiNS0_21file_descriptor_flagsE'>
              <parameter type-id='type-id-101' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-275' name='fd' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='362' column='1'/>
              <parameter type-id='type-id-277' name='f' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='362' column='1'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='open' mangled-name='_ZN5boost9iostreams15file_descriptor4openEiNS0_21file_descriptor_flagsE' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='400' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams15file_descriptor4openEiNS0_21file_descriptor_flagsE'>
              <parameter type-id='type-id-101' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-275' name='fd' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='400' column='1'/>
              <parameter type-id='type-id-277' name='f' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='400' column='1'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='file_descriptor' mangled-name='_ZN5boost9iostreams15file_descriptorC2ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESt13_Ios_Openmode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='386' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams15file_descriptorC2ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESt13_Ios_Openmode'>
              <parameter type-id='type-id-101' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-198' name='path' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='386' column='1'/>
              <parameter type-id='type-id-253' name='mode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='387' column='1'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='open' mangled-name='_ZN5boost9iostreams15file_descriptor4openERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESt13_Ios_Openmode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='424' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams15file_descriptor4openERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESt13_Ios_Openmode'>
              <parameter type-id='type-id-101' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-198' name='path' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='424' column='1'/>
              <parameter type-id='type-id-253' name='mode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='424' column='1'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='open' mangled-name='_ZN5boost9iostreams15file_descriptor4openERKNS0_6detail4pathESt13_Ios_OpenmodeS6_' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='447' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams15file_descriptor4openERKNS0_6detail4pathESt13_Ios_OpenmodeS6_'>
              <parameter type-id='type-id-101' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-159' name='path' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='448' column='1'/>
              <parameter type-id='type-id-253' name='mode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='449' column='1'/>
              <parameter type-id='type-id-253' name='base' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='450' column='1'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='file_descriptor' mangled-name='_ZN5boost9iostreams15file_descriptorC2EPKcSt13_Ios_Openmode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='391' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams15file_descriptorC2EPKcSt13_Ios_Openmode'>
              <parameter type-id='type-id-101' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-31' name='path' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='391' column='1'/>
              <parameter type-id='type-id-253' name='mode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='392' column='1'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='open' mangled-name='_ZN5boost9iostreams15file_descriptor4openEPKcSt13_Ios_Openmode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='427' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams15file_descriptor4openEPKcSt13_Ios_Openmode'>
              <parameter type-id='type-id-101' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-31' name='path' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='427' column='1'/>
              <parameter type-id='type-id-253' name='mode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='427' column='1'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='file_descriptor' mangled-name='_ZN5boost9iostreams15file_descriptorC2ERKS1_' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='396' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams15file_descriptorC2ERKS1_'>
              <parameter type-id='type-id-101' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-162' name='other' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='396' column='1'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='is_open' mangled-name='_ZNK5boost9iostreams15file_descriptor7is_openEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost9iostreams15file_descriptor7is_openEv'>
              <parameter type-id='type-id-163' name='this' is-artificial='yes'/>
              <return type-id='type-id-1'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='close' mangled-name='_ZN5boost9iostreams15file_descriptor5closeEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams15file_descriptor5closeEv'>
              <parameter type-id='type-id-101' name='this' is-artificial='yes'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='read' mangled-name='_ZN5boost9iostreams15file_descriptor4readEPcl' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='434' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams15file_descriptor4readEPcl'>
              <parameter type-id='type-id-101' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-103' name='s' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='434' column='1'/>
              <parameter type-id='type-id-262' name='n' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='434' column='1'/>
              <return type-id='type-id-262'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='write' mangled-name='_ZN5boost9iostreams15file_descriptor5writeEPKcl' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='437' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams15file_descriptor5writeEPKcl'>
              <parameter type-id='type-id-101' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-165' name='s' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='437' column='1'/>
              <parameter type-id='type-id-262' name='n' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='437' column='1'/>
              <return type-id='type-id-262'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='seek' mangled-name='_ZN5boost9iostreams15file_descriptor4seekElSt12_Ios_Seekdir' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='440' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams15file_descriptor4seekElSt12_Ios_Seekdir'>
              <parameter type-id='type-id-101' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-278' name='off' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='440' column='1'/>
              <parameter type-id='type-id-255' name='way' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='440' column='1'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='handle' mangled-name='_ZNK5boost9iostreams15file_descriptor6handleEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='443' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost9iostreams15file_descriptor6handleEv'>
              <parameter type-id='type-id-163' name='this' is-artificial='yes'/>
              <return type-id='type-id-275'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='init' mangled-name='_ZN5boost9iostreams15file_descriptor4initEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='445' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams15file_descriptor4initEv'>
              <parameter type-id='type-id-101' name='this' is-artificial='yes'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='file_descriptor_sink' size-in-bits='128' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/file_descriptor.hpp' line='228' column='1' id='type-id-104'>
          <base-class access='private' layout-offset-in-bits='0' type-id='type-id-100'/>
          <member-function access='public' constructor='yes'>
            <function-decl name='file_descriptor_sink' mangled-name='_ZN5boost9iostreams20file_descriptor_sinkC2EiNS0_21file_descriptor_flagsE' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='531' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams20file_descriptor_sinkC2EiNS0_21file_descriptor_flagsE'>
              <parameter type-id='type-id-105' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-279' name='fd' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='532' column='1'/>
              <parameter type-id='type-id-277' name='f' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='532' column='1'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='open' mangled-name='_ZN5boost9iostreams20file_descriptor_sink4openEiNS0_21file_descriptor_flagsE' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='565' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams20file_descriptor_sink4openEiNS0_21file_descriptor_flagsE'>
              <parameter type-id='type-id-105' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-279' name='fd' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='565' column='1'/>
              <parameter type-id='type-id-277' name='f' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='565' column='1'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='file_descriptor_sink' mangled-name='_ZN5boost9iostreams20file_descriptor_sinkC2ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESt13_Ios_Openmode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='553' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams20file_descriptor_sinkC2ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESt13_Ios_Openmode'>
              <parameter type-id='type-id-105' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-198' name='path' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='554' column='1'/>
              <parameter type-id='type-id-253' name='mode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='554' column='1'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='open' mangled-name='_ZN5boost9iostreams20file_descriptor_sink4openERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESt13_Ios_Openmode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='585' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams20file_descriptor_sink4openERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESt13_Ios_Openmode'>
              <parameter type-id='type-id-105' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-198' name='path' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='586' column='1'/>
              <parameter type-id='type-id-253' name='mode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='586' column='1'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='open' mangled-name='_ZN5boost9iostreams20file_descriptor_sink4openERKNS0_6detail4pathESt13_Ios_Openmode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='593' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams20file_descriptor_sink4openERKNS0_6detail4pathESt13_Ios_Openmode'>
              <parameter type-id='type-id-105' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-159' name='path' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='594' column='1'/>
              <parameter type-id='type-id-253' name='mode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='594' column='1'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='file_descriptor_sink' mangled-name='_ZN5boost9iostreams20file_descriptor_sinkC2EPKcSt13_Ios_Openmode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='557' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams20file_descriptor_sinkC2EPKcSt13_Ios_Openmode'>
              <parameter type-id='type-id-105' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-31' name='path' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='558' column='1'/>
              <parameter type-id='type-id-253' name='mode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='558' column='1'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='open' mangled-name='_ZN5boost9iostreams20file_descriptor_sink4openEPKcSt13_Ios_Openmode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='589' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams20file_descriptor_sink4openEPKcSt13_Ios_Openmode'>
              <parameter type-id='type-id-105' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-31' name='path' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='590' column='1'/>
              <parameter type-id='type-id-253' name='mode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='590' column='1'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='file_descriptor_sink' mangled-name='_ZN5boost9iostreams20file_descriptor_sinkC2ERKS1_' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='561' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams20file_descriptor_sinkC2ERKS1_'>
              <parameter type-id='type-id-105' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-167' name='other' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='561' column='1'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='file_descriptor_source' size-in-bits='128' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/file_descriptor.hpp' line='146' column='1' id='type-id-106'>
          <base-class access='private' layout-offset-in-bits='0' type-id='type-id-100'/>
          <member-type access='private'>
            <typedef-decl name='handle_type' type-id='type-id-8' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/file_descriptor.hpp' line='151' column='1' id='type-id-279'/>
          </member-type>
          <member-function access='public' constructor='yes'>
            <function-decl name='file_descriptor_source' mangled-name='_ZN5boost9iostreams22file_descriptor_sourceC2EiNS0_21file_descriptor_flagsE' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='458' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams22file_descriptor_sourceC2EiNS0_21file_descriptor_flagsE'>
              <parameter type-id='type-id-107' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-279' name='fd' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='459' column='1'/>
              <parameter type-id='type-id-277' name='f' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='459' column='1'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='open' mangled-name='_ZN5boost9iostreams22file_descriptor_source4openEiNS0_21file_descriptor_flagsE' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='493' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams22file_descriptor_source4openEiNS0_21file_descriptor_flagsE'>
              <parameter type-id='type-id-107' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-279' name='fd' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='493' column='1'/>
              <parameter type-id='type-id-277' name='f' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='493' column='1'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='file_descriptor_source' mangled-name='_ZN5boost9iostreams22file_descriptor_sourceC2ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESt13_Ios_Openmode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='480' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams22file_descriptor_sourceC2ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESt13_Ios_Openmode'>
              <parameter type-id='type-id-107' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-198' name='path' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='481' column='1'/>
              <parameter type-id='type-id-253' name='mode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='481' column='1'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='open' mangled-name='_ZN5boost9iostreams22file_descriptor_source4openERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESt13_Ios_Openmode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='513' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams22file_descriptor_source4openERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESt13_Ios_Openmode'>
              <parameter type-id='type-id-107' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-198' name='path' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='514' column='1'/>
              <parameter type-id='type-id-253' name='mode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='514' column='1'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='open' mangled-name='_ZN5boost9iostreams22file_descriptor_source4openERKNS0_6detail4pathESt13_Ios_Openmode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='521' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams22file_descriptor_source4openERKNS0_6detail4pathESt13_Ios_Openmode'>
              <parameter type-id='type-id-107' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-159' name='path' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='522' column='1'/>
              <parameter type-id='type-id-253' name='mode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='522' column='1'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='file_descriptor_source' mangled-name='_ZN5boost9iostreams22file_descriptor_sourceC2EPKcSt13_Ios_Openmode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='484' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams22file_descriptor_sourceC2EPKcSt13_Ios_Openmode'>
              <parameter type-id='type-id-107' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-31' name='path' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='485' column='1'/>
              <parameter type-id='type-id-253' name='mode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='485' column='1'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='open' mangled-name='_ZN5boost9iostreams22file_descriptor_source4openEPKcSt13_Ios_Openmode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='517' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams22file_descriptor_source4openEPKcSt13_Ios_Openmode'>
              <parameter type-id='type-id-107' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-31' name='path' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='518' column='1'/>
              <parameter type-id='type-id-253' name='mode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='518' column='1'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='file_descriptor_source' mangled-name='_ZN5boost9iostreams22file_descriptor_sourceC2ERKS1_' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='488' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams22file_descriptor_sourceC2ERKS1_'>
              <parameter type-id='type-id-107' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-169' name='other' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='489' column='1'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
        </class-decl>
        <enum-decl name='file_descriptor_flags' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/file_descriptor.hpp' line='40' column='1' id='type-id-277'>
          <underlying-type type-id='type-id-50'/>
          <enumerator name='never_close_handle' value='0'/>
          <enumerator name='close_handle' value='3'/>
        </enum-decl>
        <typedef-decl name='stream_offset' type-id='type-id-42' filepath='src/third_party/boost-1.60.0/boost/iostreams/positioning.hpp' line='36' column='1' id='type-id-278'/>
        <namespace-decl name='detail'>
          <class-decl name='path' size-in-bits='576' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/detail/path.hpp' line='37' column='1' id='type-id-97'>
            <data-member access='private' layout-offset-in-bits='0'>
              <var-decl name='narrow_' type-id='type-id-196' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/detail/path.hpp' line='155' column='1'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='256'>
              <var-decl name='wide_' type-id='type-id-199' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/detail/path.hpp' line='156' column='1'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='512'>
              <var-decl name='is_wide_' type-id='type-id-1' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/detail/path.hpp' line='157' column='1'/>
            </data-member>
          </class-decl>
          <class-decl name='file_descriptor_impl' size-in-bits='64' is-struct='yes' visibility='default' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='50' column='1' id='type-id-87'>
            <member-type access='public'>
              <enum-decl name='flags' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='52' column='1' id='type-id-280'>
                <underlying-type type-id='type-id-50'/>
                <enumerator name='never_close' value='0'/>
                <enumerator name='close_on_exit' value='1'/>
                <enumerator name='close_on_close' value='2'/>
                <enumerator name='close_always' value='3'/>
              </enum-decl>
            </member-type>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='handle_' type-id='type-id-276' visibility='default' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='73' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='32'>
              <var-decl name='flags_' type-id='type-id-8' visibility='default' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='74' column='1'/>
            </data-member>
            <member-function access='public' constructor='yes'>
              <function-decl name='file_descriptor_impl' mangled-name='_ZN5boost9iostreams6detail20file_descriptor_implC2Ev' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail20file_descriptor_implC2Ev'>
                <parameter type-id='type-id-89' name='this' is-artificial='yes'/>
                <return type-id='type-id-266'/>
              </function-decl>
            </member-function>
            <member-function access='public' static='yes'>
              <function-decl name='invalid_handle' mangled-name='_ZN5boost9iostreams6detail20file_descriptor_impl14invalid_handleEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='347' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail20file_descriptor_impl14invalid_handleEv'>
                <return type-id='type-id-276'/>
              </function-decl>
            </member-function>
            <member-function access='public' destructor='yes'>
              <function-decl name='~file_descriptor_impl' mangled-name='_ZN5boost9iostreams6detail20file_descriptor_implD2Ev' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail20file_descriptor_implD2Ev'>
                <parameter type-id='type-id-89' name='this' is-artificial='yes'/>
                <return type-id='type-id-266'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='close_impl' mangled-name='_ZN5boost9iostreams6detail20file_descriptor_impl10close_implEbb' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='244' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail20file_descriptor_impl10close_implEbb'>
                <parameter type-id='type-id-89' name='this' is-artificial='yes'/>
                <parameter type-id='type-id-1' name='close_flag' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='244' column='1'/>
                <parameter type-id='type-id-1' name='throw_' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='244' column='1'/>
                <return type-id='type-id-266'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='open' mangled-name='_ZN5boost9iostreams6detail20file_descriptor_impl4openEiNS2_5flagsE' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='88' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail20file_descriptor_impl4openEiNS2_5flagsE'>
                <parameter type-id='type-id-89' name='this' is-artificial='yes'/>
                <parameter type-id='type-id-276' name='fd' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='88' column='1'/>
                <parameter type-id='type-id-280' name='f' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='88' column='1'/>
                <return type-id='type-id-266'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='close' mangled-name='_ZN5boost9iostreams6detail20file_descriptor_impl5closeEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='239' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail20file_descriptor_impl5closeEv'>
                <parameter type-id='type-id-89' name='this' is-artificial='yes'/>
                <return type-id='type-id-266'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='open' mangled-name='_ZN5boost9iostreams6detail20file_descriptor_impl4openERKNS1_4pathESt13_Ios_Openmode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail20file_descriptor_impl4openERKNS1_4pathESt13_Ios_Openmode'>
                <parameter type-id='type-id-89' name='this' is-artificial='yes'/>
                <parameter type-id='type-id-159' name='p' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='113' column='1'/>
                <parameter type-id='type-id-253' name='mode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='113' column='1'/>
                <return type-id='type-id-266'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='is_open' mangled-name='_ZNK5boost9iostreams6detail20file_descriptor_impl7is_openEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost9iostreams6detail20file_descriptor_impl7is_openEv'>
                <parameter type-id='type-id-153' name='this' is-artificial='yes'/>
                <return type-id='type-id-1'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='read' mangled-name='_ZN5boost9iostreams6detail20file_descriptor_impl4readEPcl' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='261' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail20file_descriptor_impl4readEPcl'>
                <parameter type-id='type-id-89' name='this' is-artificial='yes'/>
                <parameter type-id='type-id-122' name='s' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='261' column='1'/>
                <parameter type-id='type-id-262' name='n' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='261' column='1'/>
                <return type-id='type-id-262'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='write' mangled-name='_ZN5boost9iostreams6detail20file_descriptor_impl5writeEPKcl' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='285' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail20file_descriptor_impl5writeEPKcl'>
                <parameter type-id='type-id-89' name='this' is-artificial='yes'/>
                <parameter type-id='type-id-31' name='s' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='285' column='1'/>
                <parameter type-id='type-id-262' name='n' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='285' column='1'/>
                <return type-id='type-id-262'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='seek' mangled-name='_ZN5boost9iostreams6detail20file_descriptor_impl4seekElSt12_Ios_Seekdir' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail20file_descriptor_impl4seekElSt12_Ios_Seekdir'>
                <parameter type-id='type-id-89' name='this' is-artificial='yes'/>
                <parameter type-id='type-id-278' name='off' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='301' column='1'/>
                <parameter type-id='type-id-255' name='way' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='301' column='1'/>
                <return type-id='type-id-261'/>
              </function-decl>
            </member-function>
          </class-decl>
          <typedef-decl name='file_handle' type-id='type-id-8' filepath='src/third_party/boost-1.60.0/boost/iostreams/detail/file_handle.hpp' line='27' column='1' id='type-id-276'/>
          <function-decl name='system_failure' mangled-name='_ZN5boost9iostreams6detail14system_failureB5cxx11EPKc' filepath='src/third_party/boost-1.60.0/boost/iostreams/detail/system_failure.hpp' line='39' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail14system_failureB5cxx11EPKc'>
            <parameter type-id='type-id-31' name='msg' filepath='src/third_party/boost-1.60.0/boost/iostreams/detail/system_failure.hpp' line='39' column='1'/>
            <return type-id='type-id-212'/>
          </function-decl>
        </namespace-decl>
      </namespace-decl>
      <function-decl name='throw_exception&lt;std::ios_base::failure&gt;' mangled-name='_ZN5boost15throw_exceptionINSt8ios_base7failureB5cxx11EEEvRKT_' filepath='src/third_party/boost-1.60.0/boost/throw_exception.hpp' line='62' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost15throw_exceptionINSt8ios_base7failureB5cxx11EEEvRKT_'>
        <parameter type-id='type-id-214' name='e' filepath='src/third_party/boost-1.60.0/boost/throw_exception.hpp' line='62' column='1'/>
        <return type-id='type-id-266'/>
      </function-decl>
    </namespace-decl>
    <namespace-decl name='boost'>
      <class-decl name='shared_ptr&lt;boost::iostreams::detail::mapped_file_impl&gt;' size-in-bits='128' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='336' column='1' id='type-id-116'>
        <member-type access='private'>
          <typedef-decl name='element_type' type-id='type-id-281' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='345' column='1' id='type-id-120'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='px' type-id='type-id-121' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='768' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='pn' type-id='type-id-58' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='769' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='reset&lt;boost::iostreams::detail::mapped_file_impl&gt;' mangled-name='_ZN5boost10shared_ptrINS_9iostreams6detail16mapped_file_implEE5resetIS3_EEvPT_' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='662' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10shared_ptrINS_9iostreams6detail16mapped_file_implEE5resetIS3_EEvPT_'>
            <parameter type-id='type-id-119' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-92' name='p' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='662' column='1'/>
            <return type-id='type-id-266'/>
          </function-decl>
        </member-function>
      </class-decl>
      <namespace-decl name='core'>
        <typedef-decl name='typeinfo' type-id='type-id-263' filepath='src/third_party/boost-1.60.0/boost/core/typeinfo.hpp' line='134' column='1' id='type-id-282'/>
      </namespace-decl>
      <namespace-decl name='detail'>
        <class-decl name='shared_count' size-in-bits='64' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/shared_count.hpp' line='107' column='1' id='type-id-58'>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='pi_' type-id='type-id-64' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/shared_count.hpp' line='111' column='1'/>
          </data-member>
        </class-decl>
        <class-decl name='sp_counted_base' size-in-bits='128' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_base_clang.hpp' line='61' column='1' id='type-id-62'>
          <data-member access='private' layout-offset-in-bits='64'>
            <var-decl name='use_count_' type-id='type-id-283' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_base_clang.hpp' line='68' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='96'>
            <var-decl name='weak_count_' type-id='type-id-283' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_base_clang.hpp' line='69' column='1'/>
          </data-member>
          <member-function access='public' destructor='yes' vtable-offset='0'>
            <function-decl name='~sp_counted_base' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_base_clang.hpp' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-64' is-artificial='yes'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public' vtable-offset='2'>
            <function-decl name='dispose' mangled-name='_ZN5boost6detail15sp_counted_base7disposeEv' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_base_clang.hpp' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-64' is-artificial='yes'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public' vtable-offset='3'>
            <function-decl name='destroy' mangled-name='_ZN5boost6detail15sp_counted_base7destroyEv' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_base_clang.hpp' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-64' is-artificial='yes'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public' vtable-offset='4'>
            <function-decl name='get_deleter' mangled-name='_ZN5boost6detail15sp_counted_base11get_deleterERKSt9type_info' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_base_clang.hpp' line='95' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-64' is-artificial='yes'/>
              <parameter type-id='type-id-247'/>
              <return type-id='type-id-22'/>
            </function-decl>
          </member-function>
          <member-function access='public' vtable-offset='5'>
            <function-decl name='get_untyped_deleter' mangled-name='_ZN5boost6detail15sp_counted_base19get_untyped_deleterEv' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_base_clang.hpp' line='96' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-64' is-artificial='yes'/>
              <return type-id='type-id-22'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='sp_counted_impl_p&lt;boost::iostreams::detail::mapped_file_impl&gt;' size-in-bits='192' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_impl.hpp' line='53' column='1' id='type-id-284'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-62'/>
          <data-member access='private' layout-offset-in-bits='128'>
            <var-decl name='px_' type-id='type-id-92' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_impl.hpp' line='57' column='1'/>
          </data-member>
          <member-function access='public' vtable-offset='2'>
            <function-decl name='dispose' mangled-name='_ZN5boost6detail17sp_counted_impl_pINS_9iostreams6detail16mapped_file_implEE7disposeEv' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_impl.hpp' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-285' is-artificial='yes'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public' vtable-offset='4'>
            <function-decl name='get_deleter' mangled-name='_ZN5boost6detail17sp_counted_impl_pINS_9iostreams6detail16mapped_file_implEE11get_deleterERKSt9type_info' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_impl.hpp' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-285' is-artificial='yes'/>
              <parameter type-id='type-id-247'/>
              <return type-id='type-id-22'/>
            </function-decl>
          </member-function>
          <member-function access='public' vtable-offset='5'>
            <function-decl name='get_untyped_deleter' mangled-name='_ZN5boost6detail17sp_counted_impl_pINS_9iostreams6detail16mapped_file_implEE19get_untyped_deleterEv' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_impl.hpp' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-285' is-artificial='yes'/>
              <return type-id='type-id-22'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='weak_count' size-in-bits='64' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/shared_count.hpp' line='560' column='1' id='type-id-68'>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='pi_' type-id='type-id-64' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/shared_count.hpp' line='564' column='1'/>
          </data-member>
        </class-decl>
        <class-decl name='sp_array_access&lt;boost::iostreams::detail::mapped_file_impl&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='175' column='1' id='type-id-286'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='type-id-266' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='177' column='1' id='type-id-287'/>
          </member-type>
        </class-decl>
        <class-decl name='sp_dereference&lt;boost::iostreams::detail::mapped_file_impl&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='101' column='1' id='type-id-288'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='type-id-91' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='103' column='1' id='type-id-289'/>
          </member-type>
        </class-decl>
        <class-decl name='sp_element&lt;boost::iostreams::detail::mapped_file_impl&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='76' column='1' id='type-id-290'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='type-id-90' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='78' column='1' id='type-id-281'/>
          </member-type>
        </class-decl>
        <class-decl name='sp_member_access&lt;boost::iostreams::detail::mapped_file_impl&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='150' column='1' id='type-id-291'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='type-id-92' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='152' column='1' id='type-id-292'/>
          </member-type>
        </class-decl>
        <class-decl name='sp_nothrow_tag' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/shared_count.hpp' line='71' column='1' id='type-id-293'/>
        <typedef-decl name='atomic_int_least32_t' type-id='type-id-41' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_base_clang.hpp' line='27' column='1' id='type-id-283'/>
        <typedef-decl name='sp_typeinfo' type-id='type-id-282' filepath='src/third_party/boost-1.60.0/boost/detail/sp_typeinfo.hpp' line='28' column='1' id='type-id-245'/>
        <function-decl name='sp_pointer_construct&lt;boost::iostreams::detail::mapped_file_impl, boost::iostreams::detail::mapped_file_impl&gt;' mangled-name='_ZN5boost6detail20sp_pointer_constructINS_9iostreams6detail16mapped_file_implES4_EEvPNS_10shared_ptrIT_EEPT0_RNS0_12shared_countE' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='282' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost6detail20sp_pointer_constructINS_9iostreams6detail16mapped_file_implES4_EEvPNS_10shared_ptrIT_EEPT0_RNS0_12shared_countE'>
          <parameter type-id='type-id-119' name='ppx' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='282' column='1'/>
          <parameter type-id='type-id-92' name='p' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='282' column='1'/>
          <parameter type-id='type-id-59' name='pn' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='282' column='1'/>
          <return type-id='type-id-266'/>
        </function-decl>
      </namespace-decl>
      <namespace-decl name='iostreams'>
        <class-decl name='mapped_file' size-in-bits='192' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='223' column='1' id='type-id-294'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-295'/>
          <member-type access='private'>
            <typedef-decl name='const_iterator' type-id='type-id-31' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='239' column='1' id='type-id-296'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='delegate_type' type-id='type-id-108' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='225' column='1' id='type-id-297'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='iterator' type-id='type-id-122' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='238' column='1' id='type-id-298'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='safe_bool' type-id='type-id-300' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='226' column='1' id='type-id-299'/>
          </member-type>
          <data-member access='public' static='yes'>
            <var-decl name='max_length' type-id='type-id-157' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='240' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='64'>
            <var-decl name='delegate_' type-id='type-id-297' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='321' column='1'/>
          </data-member>
          <member-function access='public' constructor='yes'>
            <function-decl name='mapped_file' mangled-name='_ZN5boost9iostreams11mapped_fileC2ERKS1_' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='481' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams11mapped_fileC2ERKS1_'>
              <parameter type-id='type-id-301' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-302' name='other' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='481' column='1'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='resize' mangled-name='_ZN5boost9iostreams11mapped_file6resizeEl' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='485' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams11mapped_file6resizeEl'>
              <parameter type-id='type-id-301' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-278' name='new_size' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='485' column='1'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='mapped_file_base' size-in-bits='8' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='47' column='1' id='type-id-295'>
          <member-type access='private'>
            <enum-decl name='mapmode' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='49' column='1' id='type-id-303'>
              <underlying-type type-id='type-id-50'/>
              <enumerator name='readonly' value='1'/>
              <enumerator name='readwrite' value='2'/>
              <enumerator name='priv' value='4'/>
            </enum-decl>
          </member-type>
        </class-decl>
        <class-decl name='mapped_file_sink' size-in-bits='192' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='326' column='1' id='type-id-304'>
          <base-class access='private' layout-offset-in-bits='0' type-id='type-id-294'/>
          <member-function access='public' constructor='yes'>
            <function-decl name='mapped_file_sink' mangled-name='_ZN5boost9iostreams16mapped_file_sinkC2ERKS1_' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='490' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams16mapped_file_sinkC2ERKS1_'>
              <parameter type-id='type-id-305' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-306' name='other' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='490' column='1'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='mapped_file_source' size-in-bits='128' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='149' column='1' id='type-id-108'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-295'/>
          <member-type access='private'>
            <class-decl name='safe_bool_helper' size-in-bits='32' is-struct='yes' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='151' column='1' id='type-id-9'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='x' type-id='type-id-8' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='151' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='iterator' type-id='type-id-31' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='166' column='1' id='type-id-307'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='param_type' type-id='type-id-85' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='154' column='1' id='type-id-173'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='safe_bool' type-id='type-id-10' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='152' column='1' id='type-id-300'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='size_type' type-id='type-id-260' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='165' column='1' id='type-id-176'/>
          </member-type>
          <data-member access='public' static='yes'>
            <var-decl name='max_length' type-id='type-id-177' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='167' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='pimpl_' type-id='type-id-116' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='218' column='1'/>
          </data-member>
          <member-function access='public' constructor='yes'>
            <function-decl name='mapped_file_source' mangled-name='_ZN5boost9iostreams18mapped_file_sourceC2Ev' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='440' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams18mapped_file_sourceC2Ev'>
              <parameter type-id='type-id-109' name='this' is-artificial='yes'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='mapped_file_source' mangled-name='_ZN5boost9iostreams18mapped_file_sourceC2ERKS1_' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='444' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams18mapped_file_sourceC2ERKS1_'>
              <parameter type-id='type-id-109' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-171' name='other' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='444' column='1'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='is_open' mangled-name='_ZNK5boost9iostreams18mapped_file_source7is_openEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='448' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost9iostreams18mapped_file_source7is_openEv'>
              <parameter type-id='type-id-172' name='this' is-artificial='yes'/>
              <return type-id='type-id-1'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='close' mangled-name='_ZN5boost9iostreams18mapped_file_source5closeEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='451' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams18mapped_file_source5closeEv'>
              <parameter type-id='type-id-109' name='this' is-artificial='yes'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='operator int boost::iostreams::mapped_file_source::safe_bool_helper::*' mangled-name='_ZNK5boost9iostreams18mapped_file_sourcecvMNS1_16safe_bool_helperEiEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='454' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost9iostreams18mapped_file_sourcecvMNS1_16safe_bool_helperEiEv'>
              <parameter type-id='type-id-172' name='this' is-artificial='yes'/>
              <return type-id='type-id-300'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='operator!' mangled-name='_ZNK5boost9iostreams18mapped_file_sourcentEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='457' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost9iostreams18mapped_file_sourcentEv'>
              <parameter type-id='type-id-172' name='this' is-artificial='yes'/>
              <return type-id='type-id-1'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='flags' mangled-name='_ZNK5boost9iostreams18mapped_file_source5flagsEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='460' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost9iostreams18mapped_file_source5flagsEv'>
              <parameter type-id='type-id-172' name='this' is-artificial='yes'/>
              <return type-id='type-id-303'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='size' mangled-name='_ZNK5boost9iostreams18mapped_file_source4sizeEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='463' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost9iostreams18mapped_file_source4sizeEv'>
              <parameter type-id='type-id-172' name='this' is-artificial='yes'/>
              <return type-id='type-id-176'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='data' mangled-name='_ZNK5boost9iostreams18mapped_file_source4dataEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='466' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost9iostreams18mapped_file_source4dataEv'>
              <parameter type-id='type-id-172' name='this' is-artificial='yes'/>
              <return type-id='type-id-31'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='begin' mangled-name='_ZNK5boost9iostreams18mapped_file_source5beginEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='468' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost9iostreams18mapped_file_source5beginEv'>
              <parameter type-id='type-id-172' name='this' is-artificial='yes'/>
              <return type-id='type-id-307'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='end' mangled-name='_ZNK5boost9iostreams18mapped_file_source3endEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='470' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost9iostreams18mapped_file_source3endEv'>
              <parameter type-id='type-id-172' name='this' is-artificial='yes'/>
              <return type-id='type-id-307'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='alignment' mangled-name='_ZN5boost9iostreams18mapped_file_source9alignmentEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='471' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams18mapped_file_source9alignmentEv'>
              <return type-id='type-id-8'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='init' mangled-name='_ZN5boost9iostreams18mapped_file_source4initEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='474' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams18mapped_file_source4initEv'>
              <parameter type-id='type-id-109' name='this' is-artificial='yes'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='open_impl' mangled-name='_ZN5boost9iostreams18mapped_file_source9open_implERKNS0_24basic_mapped_file_paramsINS0_6detail4pathEEE' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='476' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams18mapped_file_source9open_implERKNS0_24basic_mapped_file_paramsINS0_6detail4pathEEE'>
              <parameter type-id='type-id-109' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-175' name='p' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='476' column='1'/>
              <return type-id='type-id-266'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='basic_mapped_file_params&lt;boost::iostreams::detail::path&gt;' size-in-bits='896' is-struct='yes' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='109' column='1' id='type-id-85'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-95'/>
          <data-member access='public' layout-offset-in-bits='320'>
            <var-decl name='path' type-id='type-id-97' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='142' column='1'/>
          </data-member>
        </class-decl>
        <namespace-decl name='detail'>
          <class-decl name='mapped_file_impl' size-in-bits='1088' visibility='default' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='45' column='1' id='type-id-90'>
            <member-type access='private'>
              <typedef-decl name='mapmode' type-id='type-id-303' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='49' column='1' id='type-id-308'/>
            </member-type>
            <member-type access='private'>
              <typedef-decl name='param_type' type-id='type-id-173' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='48' column='1' id='type-id-93'/>
            </member-type>
            <member-type access='private'>
              <typedef-decl name='size_type' type-id='type-id-176' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='47' column='1' id='type-id-156'/>
            </member-type>
            <data-member access='public' static='yes'>
              <var-decl name='max_length' type-id='type-id-157' visibility='default' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='50' column='1'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='0'>
              <var-decl name='params_' type-id='type-id-93' visibility='default' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='70' column='1'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='896'>
              <var-decl name='data_' type-id='type-id-122' visibility='default' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='71' column='1'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='960'>
              <var-decl name='size_' type-id='type-id-278' visibility='default' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='72' column='1'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='1024'>
              <var-decl name='handle_' type-id='type-id-276' visibility='default' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='73' column='1'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='1056'>
              <var-decl name='error_' type-id='type-id-1' visibility='default' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='77' column='1'/>
            </data-member>
            <member-function access='public' constructor='yes'>
              <function-decl name='mapped_file_impl' mangled-name='_ZN5boost9iostreams6detail16mapped_file_implC2Ev' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail16mapped_file_implC2Ev'>
                <parameter type-id='type-id-92' name='this' is-artificial='yes'/>
                <return type-id='type-id-266'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='clear' mangled-name='_ZN5boost9iostreams6detail16mapped_file_impl5clearEb' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='370' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail16mapped_file_impl5clearEb'>
                <parameter type-id='type-id-92' name='this' is-artificial='yes'/>
                <parameter type-id='type-id-1' name='error' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='370' column='1'/>
                <return type-id='type-id-266'/>
              </function-decl>
            </member-function>
            <member-function access='public' destructor='yes'>
              <function-decl name='~mapped_file_impl' mangled-name='_ZN5boost9iostreams6detail16mapped_file_implD2Ev' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail16mapped_file_implD2Ev'>
                <parameter type-id='type-id-92' name='this' is-artificial='yes'/>
                <return type-id='type-id-266'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='close' mangled-name='_ZN5boost9iostreams6detail16mapped_file_impl5closeEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='95' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail16mapped_file_impl5closeEv'>
                <parameter type-id='type-id-92' name='this' is-artificial='yes'/>
                <return type-id='type-id-266'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='unmap_file' mangled-name='_ZN5boost9iostreams6detail16mapped_file_impl10unmap_fileEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='357' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail16mapped_file_impl10unmap_fileEv'>
                <parameter type-id='type-id-92' name='this' is-artificial='yes'/>
                <return type-id='type-id-1'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='open' mangled-name='_ZN5boost9iostreams6detail16mapped_file_impl4openENS0_24basic_mapped_file_paramsINS1_4pathEEE' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='85' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail16mapped_file_impl4openENS0_24basic_mapped_file_paramsINS1_4pathEEE'>
                <parameter type-id='type-id-92' name='this' is-artificial='yes'/>
                <parameter type-id='type-id-93' name='p' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='85' column='1'/>
                <return type-id='type-id-266'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='open_file' mangled-name='_ZN5boost9iostreams6detail16mapped_file_impl9open_fileENS0_24basic_mapped_file_paramsINS1_4pathEEE' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail16mapped_file_impl9open_fileENS0_24basic_mapped_file_paramsINS1_4pathEEE'>
                <parameter type-id='type-id-92' name='this' is-artificial='yes'/>
                <parameter type-id='type-id-93' name='p' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='165' column='1'/>
                <return type-id='type-id-266'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='map_file' mangled-name='_ZN5boost9iostreams6detail16mapped_file_impl8map_fileERNS0_24basic_mapped_file_paramsINS1_4pathEEE' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='343' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail16mapped_file_impl8map_fileERNS0_24basic_mapped_file_paramsINS1_4pathEEE'>
                <parameter type-id='type-id-92' name='this' is-artificial='yes'/>
                <parameter type-id='type-id-94' name='p' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='343' column='1'/>
                <return type-id='type-id-266'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='try_map_file' mangled-name='_ZN5boost9iostreams6detail16mapped_file_impl12try_map_fileENS0_24basic_mapped_file_paramsINS1_4pathEEE' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail16mapped_file_impl12try_map_fileENS0_24basic_mapped_file_paramsINS1_4pathEEE'>
                <parameter type-id='type-id-92' name='this' is-artificial='yes'/>
                <parameter type-id='type-id-93' name='p' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='289' column='1'/>
                <return type-id='type-id-266'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='cleanup_and_throw' mangled-name='_ZN5boost9iostreams6detail16mapped_file_impl17cleanup_and_throwEPKc' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='386' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail16mapped_file_impl17cleanup_and_throwEPKc'>
                <parameter type-id='type-id-92' name='this' is-artificial='yes'/>
                <parameter type-id='type-id-31' name='msg' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='386' column='1'/>
                <return type-id='type-id-266'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='resize' mangled-name='_ZN5boost9iostreams6detail16mapped_file_impl6resizeEl' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail16mapped_file_impl6resizeEl'>
                <parameter type-id='type-id-92' name='this' is-artificial='yes'/>
                <parameter type-id='type-id-278' name='new_size' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='113' column='1'/>
                <return type-id='type-id-266'/>
              </function-decl>
            </member-function>
            <member-function access='public' static='yes'>
              <function-decl name='alignment' mangled-name='_ZN5boost9iostreams6detail16mapped_file_impl9alignmentEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='154' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail16mapped_file_impl9alignmentEv'>
                <return type-id='type-id-8'/>
              </function-decl>
            </member-function>
          </class-decl>
          <class-decl name='mapped_file_params_base' size-in-bits='320' is-struct='yes' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='82' column='1' id='type-id-95'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='flags' type-id='type-id-303' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='92' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='32'>
              <var-decl name='mode' type-id='type-id-253' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='93' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='offset' type-id='type-id-278' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='94' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='length' type-id='type-id-260' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='95' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='192'>
              <var-decl name='new_file_size' type-id='type-id-278' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='96' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='256'>
              <var-decl name='hint' type-id='type-id-31' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='97' column='1'/>
            </data-member>
            <member-function access='private'>
              <function-decl name='normalize' mangled-name='_ZN5boost9iostreams6detail23mapped_file_params_base9normalizeEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='407' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail23mapped_file_params_base9normalizeEv'>
                <parameter type-id='type-id-96' name='this' is-artificial='yes'/>
                <return type-id='type-id-266'/>
              </function-decl>
            </member-function>
          </class-decl>
        </namespace-decl>
      </namespace-decl>
    </namespace-decl>
    <type-decl name='void' id='type-id-266'/>
    <pointer-type-def type-id='type-id-266' id='type-id-22'/>
    <function-type size-in-bits='64' id='type-id-228'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-239'>
      <return type-id='type-id-266'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' comp-dir-path='/home/andrew/Documents/10gen/dev/src/mongodb' language='LANG_C_plus_plus'>
    <reference-type-def kind='lvalue' type-id='type-id-284' size-in-bits='64' id='type-id-309'/>
    <pointer-type-def type-id='type-id-284' size-in-bits='64' id='type-id-285'/>
    <pointer-type-def type-id='type-id-294' size-in-bits='64' id='type-id-301'/>
    <pointer-type-def type-id='type-id-304' size-in-bits='64' id='type-id-305'/>
    <reference-type-def kind='lvalue' type-id='type-id-108' size-in-bits='64' id='type-id-310'/>
    <qualified-type-def type-id='type-id-284' const='yes' id='type-id-311'/>
    <reference-type-def kind='lvalue' type-id='type-id-311' size-in-bits='64' id='type-id-312'/>
    <qualified-type-def type-id='type-id-294' const='yes' id='type-id-313'/>
    <reference-type-def kind='lvalue' type-id='type-id-313' size-in-bits='64' id='type-id-302'/>
    <pointer-type-def type-id='type-id-313' size-in-bits='64' id='type-id-314'/>
    <qualified-type-def type-id='type-id-304' const='yes' id='type-id-315'/>
    <reference-type-def kind='lvalue' type-id='type-id-315' size-in-bits='64' id='type-id-306'/>
  </abi-instr>
</abi-corpus>
