<abi-corpus version='2.3' soname='libGLU.so.1'>
  <elf-needed>
    <dependency name='libGL.so.1'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libm.so.6'/>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='gluBeginCurve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluBeginPolygon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluBeginSurface' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluBeginTrim' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluBuild1DMipmapLevels' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluBuild1DMipmaps' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluBuild2DMipmapLevels' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluBuild2DMipmaps' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluBuild3DMipmapLevels' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='gluEndTrim' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluErrorString' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluGetNurbsProperty' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluGetString' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluGetTessProperty' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluLoadSamplingMatrices' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluLookAt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNewNurbsRenderer' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNewQuadric' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNewTess' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNextContour' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNurbsCallback' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNurbsCallbackData' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNurbsCallbackDataEXT' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNurbsCurve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNurbsProperty' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNurbsSurface' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluOrtho2D' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluPartialDisk' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluPerspective' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluPickMatrix' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluProject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluPwlCurve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluQuadricCallback' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluQuadricDrawStyle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluQuadricNormals' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluQuadricOrientation' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluQuadricTexture' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluScaleImage' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluSphere' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessBeginContour' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessBeginPolygon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessCallback' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessEndContour' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessEndPolygon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessNormal' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessProperty' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessVertex' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluUnProject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluUnProject4' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='libnurbs/interface/glcurveval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='5120' id='type-id-2'>
      <subrange length='160' lower-bound='0' upper-bound='159' type-id='type-id-3' id='type-id-4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='1280' id='type-id-5'>
      <subrange length='40' lower-bound='0' upper-bound='39' type-id='type-id-3' id='type-id-6'/>
    </array-type-def>
    <class-decl name='OpenGLCurveEvaluator' size-in-bits='27584' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='66' column='1' id='type-id-7'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-8'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='em_vertex' type-id='type-id-9' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='102' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='6656'>
        <var-decl name='em_normal' type-id='type-id-9' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='103' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='13248'>
        <var-decl name='em_color' type-id='type-id-9' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='104' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='19840'>
        <var-decl name='em_texcoord' type-id='type-id-9' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='105' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26432'>
        <var-decl name='vertex_flag' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='106' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26464'>
        <var-decl name='normal_flag' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='107' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26496'>
        <var-decl name='color_flag' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='108' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26528'>
        <var-decl name='texcoord_flag' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='109' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26560'>
        <var-decl name='global_grid_u0' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='111' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26592'>
        <var-decl name='global_grid_u1' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='112' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26624'>
        <var-decl name='global_grid_nu' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='113' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26688'>
        <var-decl name='beginCallBackN' type-id='type-id-11' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='128' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26752'>
        <var-decl name='endCallBackN' type-id='type-id-12' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='129' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26816'>
        <var-decl name='vertexCallBackN' type-id='type-id-13' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='130' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26880'>
        <var-decl name='normalCallBackN' type-id='type-id-13' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='131' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26944'>
        <var-decl name='colorCallBackN' type-id='type-id-13' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='132' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27008'>
        <var-decl name='texcoordCallBackN' type-id='type-id-13' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='133' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27072'>
        <var-decl name='beginCallBackData' type-id='type-id-14' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='135' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27136'>
        <var-decl name='endCallBackData' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='136' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27200'>
        <var-decl name='vertexCallBackData' type-id='type-id-16' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='137' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27264'>
        <var-decl name='normalCallBackData' type-id='type-id-16' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='138' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27328'>
        <var-decl name='colorCallBackData' type-id='type-id-16' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='139' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27392'>
        <var-decl name='texcoordCallBackData' type-id='type-id-16' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='140' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27456'>
        <var-decl name='userData' type-id='type-id-17' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='142' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27520'>
        <var-decl name='output_triangles' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='154' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='OpenGLCurveEvaluator' filepath='libnurbs/interface/glcurveval.cc' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-18' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='OpenGLCurveEvaluator' filepath='libnurbs/interface/glcurveval.cc' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-20' name='this' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='OpenGLCurveEvaluator' filepath='libnurbs/interface/glcurveval.cc' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-20' name='this' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <function-decl name='~OpenGLCurveEvaluator' filepath='libnurbs/interface/glcurveval.cc' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-18' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='9'>
        <function-decl name='domain1f' mangled-name='_ZN20OpenGLCurveEvaluator8domain1fEff' filepath='libnurbs/interface/glcurveval.cc' line='98' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-18' is-artificial='yes'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='10'>
        <function-decl name='range1f' mangled-name='_ZN20OpenGLCurveEvaluator7range1fElPfS0_' filepath='libnurbs/interface/glcurveval.cc' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-18' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-22'/>
          <parameter type-id='type-id-22'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='11'>
        <function-decl name='enable' mangled-name='_ZN20OpenGLCurveEvaluator6enableEl' filepath='libnurbs/interface/glcurveval.cc' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-18' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='12'>
        <function-decl name='disable' mangled-name='_ZN20OpenGLCurveEvaluator7disableEl' filepath='libnurbs/interface/glcurveval.cc' line='127' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-18' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='13'>
        <function-decl name='bgnmap1f' mangled-name='_ZN20OpenGLCurveEvaluator8bgnmap1fEl' filepath='libnurbs/interface/glcurveval.cc' line='164' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-18' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='14'>
        <function-decl name='map1f' mangled-name='_ZN20OpenGLCurveEvaluator5map1fElffllPf' filepath='libnurbs/interface/glcurveval.cc' line='199' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-18' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-22'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='15'>
        <function-decl name='mapgrid1f' mangled-name='_ZN20OpenGLCurveEvaluator9mapgrid1fElff' filepath='libnurbs/interface/glcurveval.cc' line='147' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-18' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='16'>
        <function-decl name='mapmesh1f' mangled-name='_ZN20OpenGLCurveEvaluator9mapmesh1fElll' filepath='libnurbs/interface/glcurveval.cc' line='262' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-18' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='17'>
        <function-decl name='evalcoord1f' mangled-name='_ZN20OpenGLCurveEvaluator11evalcoord1fElf' filepath='libnurbs/interface/glcurveval.cc' line='296' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-18' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='18'>
        <function-decl name='endmap1f' mangled-name='_ZN20OpenGLCurveEvaluator8endmap1fEv' filepath='libnurbs/interface/glcurveval.cc' line='184' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-18' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='19'>
        <function-decl name='bgnline' mangled-name='_ZN20OpenGLCurveEvaluator7bgnlineEv' filepath='libnurbs/interface/glcurveval.cc' line='105' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-18' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='20'>
        <function-decl name='endline' mangled-name='_ZN20OpenGLCurveEvaluator7endlineEv' filepath='libnurbs/interface/glcurveval.cc' line='114' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-18' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='curveEvalMachine' size-in-bits='6592' is-struct='yes' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='55' column='1' id='type-id-23'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uprime' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='k' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='u1' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='u2' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ustride' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='uorder' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ctlpoints' type-id='type-id-2' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='ucoeff' type-id='type-id-5' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='REAL' type-id='type-id-24' filepath='libnurbs/internals/types.h' line='41' column='1' id='type-id-1'/>
    <typedef-decl name='curveEvalMachine' type-id='type-id-23' filepath='libnurbs/interface/glcurveval.h' line='64' column='1' id='type-id-9'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-25'/>
    <qualified-type-def type-id='type-id-25' const='yes' id='type-id-26'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-28'/>
    <qualified-type-def type-id='type-id-28' const='yes' id='type-id-29'/>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-18'/>
    <qualified-type-def type-id='type-id-18' const='yes' id='type-id-20'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-22'/>
    <qualified-type-def type-id='type-id-30' const='yes' id='type-id-31'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-32'/>
    <qualified-type-def type-id='type-id-10' const='yes' id='type-id-33'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-34'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-13'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-16'/>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-38'/>
    <class-decl name='CachingEvaluator' size-in-bits='64' visibility='default' filepath='libnurbs/internals/cachingeval.h' line='39' column='1' id='type-id-27'>
      <member-type access='private'>
        <enum-decl name='ServiceMode' filepath='libnurbs/internals/cachingeval.h' line='42' column='1' id='type-id-39'>
          <underlying-type type-id='type-id-40'/>
          <enumerator name='play' value='0'/>
          <enumerator name='record' value='1'/>
          <enumerator name='playAndRecord' value='2'/>
        </enum-decl>
      </member-type>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <function-decl name='~CachingEvaluator' filepath='libnurbs/internals/cachingeval.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-28' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='2'>
        <function-decl name='canRecord' mangled-name='_ZN16CachingEvaluator9canRecordEv' filepath='libnurbs/internals/cachingeval.cc' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-28' is-artificial='yes'/>
          <return type-id='type-id-10'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='3'>
        <function-decl name='canPlayAndRecord' mangled-name='_ZN16CachingEvaluator16canPlayAndRecordEv' filepath='libnurbs/internals/cachingeval.cc' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-28' is-artificial='yes'/>
          <return type-id='type-id-10'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='4'>
        <function-decl name='createHandle' mangled-name='_ZN16CachingEvaluator12createHandleEi' filepath='libnurbs/internals/cachingeval.cc' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-28' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-10'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='5'>
        <function-decl name='beginOutput' mangled-name='_ZN16CachingEvaluator11beginOutputENS_11ServiceModeEi' filepath='libnurbs/internals/cachingeval.cc' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-28' is-artificial='yes'/>
          <parameter type-id='type-id-39'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='6'>
        <function-decl name='endOutput' mangled-name='_ZN16CachingEvaluator9endOutputEv' filepath='libnurbs/internals/cachingeval.cc' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-28' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='7'>
        <function-decl name='discardRecording' mangled-name='_ZN16CachingEvaluator16discardRecordingEi' filepath='libnurbs/internals/cachingeval.cc' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-28' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='8'>
        <function-decl name='playRecording' mangled-name='_ZN16CachingEvaluator13playRecordingEi' filepath='libnurbs/internals/cachingeval.cc' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-28' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='BasicCurveEvaluator' size-in-bits='64' visibility='default' filepath='libnurbs/internals/basiccrveval.h' line='43' column='1' id='type-id-8'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-27'/>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <function-decl name='~BasicCurveEvaluator' filepath='libnurbs/internals/basiccrveval.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-25' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='9'>
        <function-decl name='domain1f' mangled-name='_ZN19BasicCurveEvaluator8domain1fEff' filepath='libnurbs/internals/basiccrveval.cc' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-25' is-artificial='yes'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='10'>
        <function-decl name='range1f' mangled-name='_ZN19BasicCurveEvaluator7range1fElPfS0_' filepath='libnurbs/internals/basiccrveval.cc' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-25' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-22'/>
          <parameter type-id='type-id-22'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='11'>
        <function-decl name='enable' mangled-name='_ZN19BasicCurveEvaluator6enableEl' filepath='libnurbs/internals/basiccrveval.cc' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-25' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='12'>
        <function-decl name='disable' mangled-name='_ZN19BasicCurveEvaluator7disableEl' filepath='libnurbs/internals/basiccrveval.cc' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-25' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='13'>
        <function-decl name='bgnmap1f' mangled-name='_ZN19BasicCurveEvaluator8bgnmap1fEl' filepath='libnurbs/internals/basiccrveval.cc' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-25' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='14'>
        <function-decl name='map1f' mangled-name='_ZN19BasicCurveEvaluator5map1fElffllPf' filepath='libnurbs/internals/basiccrveval.cc' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-25' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-22'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='15'>
        <function-decl name='mapgrid1f' mangled-name='_ZN19BasicCurveEvaluator9mapgrid1fElff' filepath='libnurbs/internals/basiccrveval.cc' line='93' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-25' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='16'>
        <function-decl name='mapmesh1f' mangled-name='_ZN19BasicCurveEvaluator9mapmesh1fElll' filepath='libnurbs/internals/basiccrveval.cc' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-25' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='17'>
        <function-decl name='evalcoord1f' mangled-name='_ZN19BasicCurveEvaluator11evalcoord1fElf' filepath='libnurbs/internals/basiccrveval.cc' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-25' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='18'>
        <function-decl name='endmap1f' mangled-name='_ZN19BasicCurveEvaluator8endmap1fEv' filepath='libnurbs/internals/basiccrveval.cc' line='117' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-25' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='19'>
        <function-decl name='bgnline' mangled-name='_ZN19BasicCurveEvaluator7bgnlineEv' filepath='libnurbs/internals/basiccrveval.cc' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-25' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='20'>
        <function-decl name='endline' mangled-name='_ZN19BasicCurveEvaluator7endlineEv' filepath='libnurbs/internals/basiccrveval.cc' line='133' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-25' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='CurveMap' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-37'/>
    <function-type size-in-bits='64' id='type-id-35'>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-19'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-36'>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-19'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-41'>
      <parameter type-id='type-id-42'/>
      <return type-id='type-id-19'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-43'>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-19'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-44'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-19'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/glinterface.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-46'/>
    <qualified-type-def type-id='type-id-46' const='yes' id='type-id-47'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-49'/>
    <qualified-type-def type-id='type-id-49' const='yes' id='type-id-50'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-51'/>
    <class-decl name='GLUnurbs' size-in-bits='1149440' is-struct='yes' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='49' column='1' id='type-id-45'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-52'/>
      <data-member access='public' layout-offset-in-bits='47616'>
        <var-decl name='errorCallback' type-id='type-id-53' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='71' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47680'>
        <var-decl name='autoloadmode' type-id='type-id-54' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='130' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47744'>
        <var-decl name='surfaceEvaluator' type-id='type-id-48' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='131' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1121792'>
        <var-decl name='curveEvaluator' type-id='type-id-7' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='132' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1149376'>
        <var-decl name='callbackFlag' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='143' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='GLUnurbs' filepath='libnurbs/interface/glrenderer.cc' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-46' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='GLUnurbs' filepath='libnurbs/interface/glrenderer.cc' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-47' name='this' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='GLUnurbs' filepath='libnurbs/interface/glrenderer.cc' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-47' name='this' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='bgnrender' mangled-name='_ZN8GLUnurbs9bgnrenderEv' filepath='libnurbs/interface/glrenderer.cc' line='107' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-46' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='3'>
        <function-decl name='endrender' mangled-name='_ZN8GLUnurbs9endrenderEv' filepath='libnurbs/interface/glrenderer.cc' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-46' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='6'>
        <function-decl name='errorHandler' mangled-name='_ZN8GLUnurbs12errorHandlerEi' filepath='libnurbs/interface/glrenderer.cc' line='120' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-46' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='OpenGLSurfaceEvaluator' size-in-bits='1074048' is-struct='yes' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='100' column='1' id='type-id-48'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-55'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='vertexCache' type-id='type-id-56' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='180' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='tmeshing' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='181' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='288'>
        <var-decl name='which' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='182' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='vcount' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='183' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='352'>
        <var-decl name='gl_polygon_mode' type-id='type-id-57' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='185' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <var-decl name='global_bpm' type-id='type-id-58' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='188' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='512'>
        <var-decl name='output_triangles' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='189' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='beginCallBackN' type-id='type-id-11' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='193' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='640'>
        <var-decl name='endCallBackN' type-id='type-id-12' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='194' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='704'>
        <var-decl name='vertexCallBackN' type-id='type-id-13' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='195' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <var-decl name='normalCallBackN' type-id='type-id-13' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='196' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='832'>
        <var-decl name='colorCallBackN' type-id='type-id-13' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='197' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='896'>
        <var-decl name='texcoordCallBackN' type-id='type-id-13' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='198' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='960'>
        <var-decl name='beginCallBackData' type-id='type-id-14' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='200' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1024'>
        <var-decl name='endCallBackData' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='201' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1088'>
        <var-decl name='vertexCallBackData' type-id='type-id-16' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='202' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1152'>
        <var-decl name='normalCallBackData' type-id='type-id-16' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='203' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1216'>
        <var-decl name='colorCallBackData' type-id='type-id-16' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='204' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1280'>
        <var-decl name='texcoordCallBackData' type-id='type-id-16' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='205' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1344'>
        <var-decl name='userData' type-id='type-id-17' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='215' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1408'>
        <var-decl name='LOD_eval_level' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='222' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1440'>
        <var-decl name='global_uorder' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='231' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1472'>
        <var-decl name='global_vorder' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='232' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1504'>
        <var-decl name='global_uprime' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='233' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1536'>
        <var-decl name='global_vprime' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='234' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1568'>
        <var-decl name='global_vprime_BV' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='235' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1600'>
        <var-decl name='global_uprime_BU' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='236' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1632'>
        <var-decl name='global_uorder_BV' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='237' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1664'>
        <var-decl name='global_vorder_BV' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='238' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1696'>
        <var-decl name='global_uorder_BU' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='239' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1728'>
        <var-decl name='global_vorder_BU' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='240' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1760'>
        <var-decl name='global_ucoeff' type-id='type-id-5' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='242' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3040'>
        <var-decl name='global_vcoeff' type-id='type-id-5' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='243' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='4320'>
        <var-decl name='global_ucoeffDeriv' type-id='type-id-5' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='244' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5600'>
        <var-decl name='global_vcoeffDeriv' type-id='type-id-5' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='245' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='6880'>
        <var-decl name='global_BV' type-id='type-id-59' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='247' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='12000'>
        <var-decl name='global_PBV' type-id='type-id-59' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='248' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='17120'>
        <var-decl name='global_BU' type-id='type-id-59' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='249' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='22240'>
        <var-decl name='global_PBU' type-id='type-id-59' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='250' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27392'>
        <var-decl name='global_baseData' type-id='type-id-22' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='251' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27456'>
        <var-decl name='global_ev_k' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='253' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27488'>
        <var-decl name='global_ev_u1' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='254' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27520'>
        <var-decl name='global_ev_u2' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='255' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27552'>
        <var-decl name='global_ev_ustride' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='256' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27584'>
        <var-decl name='global_ev_uorder' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='257' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27616'>
        <var-decl name='global_ev_v1' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='258' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27648'>
        <var-decl name='global_ev_v2' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='259' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27680'>
        <var-decl name='global_ev_vstride' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='260' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27712'>
        <var-decl name='global_ev_vorder' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='261' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27744'>
        <var-decl name='global_ev_ctlPoints' type-id='type-id-60' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='262' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232544'>
        <var-decl name='global_grid_u0' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='264' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232576'>
        <var-decl name='global_grid_u1' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='265' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232608'>
        <var-decl name='global_grid_nu' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='266' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232640'>
        <var-decl name='global_grid_v0' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='267' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232672'>
        <var-decl name='global_grid_v1' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='268' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232704'>
        <var-decl name='global_grid_nv' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='269' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232736'>
        <var-decl name='em_vertex' type-id='type-id-61' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='349' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='443008'>
        <var-decl name='em_normal' type-id='type-id-61' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='350' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='653280'>
        <var-decl name='em_color' type-id='type-id-61' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='351' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='863552'>
        <var-decl name='em_texcoord' type-id='type-id-61' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='352' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073824'>
        <var-decl name='auto_normal_flag' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='354' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073856'>
        <var-decl name='callback_auto_normal' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='356' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073888'>
        <var-decl name='vertex_flag' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='357' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073920'>
        <var-decl name='normal_flag' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='358' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073952'>
        <var-decl name='color_flag' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='359' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073984'>
        <var-decl name='texcoord_flag' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='360' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='OpenGLSurfaceEvaluator' filepath='libnurbs/interface/glsurfeval.cc' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='OpenGLSurfaceEvaluator' filepath='libnurbs/interface/glsurfeval.cc' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-50' name='this' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='OpenGLSurfaceEvaluator' filepath='libnurbs/interface/glsurfeval.cc' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-50' name='this' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~OpenGLSurfaceEvaluator' filepath='libnurbs/interface/glsurfeval.cc' line='162' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='range2f' mangled-name='_ZN22OpenGLSurfaceEvaluator7range2fElPfS0_' filepath='libnurbs/interface/glsurfeval.cc' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-22'/>
          <parameter type-id='type-id-22'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <function-decl name='domain2f' mangled-name='_ZN22OpenGLSurfaceEvaluator8domain2fEffff' filepath='libnurbs/interface/glsurfeval.cc' line='263' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='11'>
        <function-decl name='enable' mangled-name='_ZN22OpenGLSurfaceEvaluator6enableEl' filepath='libnurbs/interface/glsurfeval.cc' line='185' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='12'>
        <function-decl name='disable' mangled-name='_ZN22OpenGLSurfaceEvaluator7disableEl' filepath='libnurbs/interface/glsurfeval.cc' line='175' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='13'>
        <function-decl name='bgnmap2f' mangled-name='_ZN22OpenGLSurfaceEvaluator8bgnmap2fEl' filepath='libnurbs/interface/glsurfeval.cc' line='739' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='14'>
        <function-decl name='map2f' mangled-name='_ZN22OpenGLSurfaceEvaluator5map2fElffllffllPf' filepath='libnurbs/interface/glsurfeval.cc' line='872' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-22'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='15'>
        <function-decl name='mapgrid2f' mangled-name='_ZN22OpenGLSurfaceEvaluator9mapgrid2fElfflff' filepath='libnurbs/interface/glsurfeval.cc' line='195' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='16'>
        <function-decl name='mapmesh2f' mangled-name='_ZN22OpenGLSurfaceEvaluator9mapmesh2fElllll' filepath='libnurbs/interface/glsurfeval.cc' line='946' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='17'>
        <function-decl name='evalcoord2f' mangled-name='_ZN22OpenGLSurfaceEvaluator11evalcoord2fElff' filepath='libnurbs/interface/glsurfeval.cc' line='1042' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='18'>
        <function-decl name='evalpoint2i' mangled-name='_ZN22OpenGLSurfaceEvaluator11evalpoint2iEll' filepath='libnurbs/interface/glsurfeval.cc' line='1059' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='19'>
        <function-decl name='endmap2f' mangled-name='_ZN22OpenGLSurfaceEvaluator8endmap2fEv' filepath='libnurbs/interface/glsurfeval.cc' line='801' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <function-decl name='polymode' mangled-name='_ZN22OpenGLSurfaceEvaluator8polymodeEl' filepath='libnurbs/interface/glsurfeval.cc' line='219' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='21'>
        <function-decl name='bgnline' mangled-name='_ZN22OpenGLSurfaceEvaluator7bgnlineEv' filepath='libnurbs/interface/glsurfeval.cc' line='240' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='22'>
        <function-decl name='endline' mangled-name='_ZN22OpenGLSurfaceEvaluator7endlineEv' filepath='libnurbs/interface/glsurfeval.cc' line='249' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='23'>
        <function-decl name='bgnclosedline' mangled-name='_ZN22OpenGLSurfaceEvaluator13bgnclosedlineEv' filepath='libnurbs/interface/glsurfeval.cc' line='268' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='24'>
        <function-decl name='endclosedline' mangled-name='_ZN22OpenGLSurfaceEvaluator13endclosedlineEv' filepath='libnurbs/interface/glsurfeval.cc' line='277' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='25'>
        <function-decl name='bgntmesh' mangled-name='_ZN22OpenGLSurfaceEvaluator8bgntmeshEv' filepath='libnurbs/interface/glsurfeval.cc' line='290' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='26'>
        <function-decl name='swaptmesh' mangled-name='_ZN22OpenGLSurfaceEvaluator9swaptmeshEv' filepath='libnurbs/interface/glsurfeval.cc' line='305' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='27'>
        <function-decl name='endtmesh' mangled-name='_ZN22OpenGLSurfaceEvaluator8endtmeshEv' filepath='libnurbs/interface/glsurfeval.cc' line='312' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='28'>
        <function-decl name='bgnqstrip' mangled-name='_ZN22OpenGLSurfaceEvaluator9bgnqstripEv' filepath='libnurbs/interface/glsurfeval.cc' line='712' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='29'>
        <function-decl name='endqstrip' mangled-name='_ZN22OpenGLSurfaceEvaluator9endqstripEv' filepath='libnurbs/interface/glsurfeval.cc' line='725' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='30'>
        <function-decl name='bgntfan' mangled-name='_ZN22OpenGLSurfaceEvaluator7bgntfanEv' filepath='libnurbs/interface/glsurfeval.cc' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='31'>
        <function-decl name='endtfan' mangled-name='_ZN22OpenGLSurfaceEvaluator7endtfanEv' filepath='libnurbs/interface/glsurfeval.cc' line='334' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='32'>
        <function-decl name='evalUStrip' mangled-name='_ZN22OpenGLSurfaceEvaluator10evalUStripEifPfifS0_' filepath='libnurbs/interface/glsurfeval.cc' line='343' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-22'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-22'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='33'>
        <function-decl name='evalVStrip' mangled-name='_ZN22OpenGLSurfaceEvaluator10evalVStripEifPfifS0_' filepath='libnurbs/interface/glsurfeval.cc' line='530' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-22'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-22'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='34'>
        <function-decl name='inDoEvalCoord2NOGE' mangled-name='_ZN22OpenGLSurfaceEvaluator18inDoEvalCoord2NOGEEffPfS0_' filepath='libnurbs/interface/glsurfeval.h' line='283' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-22'/>
          <parameter type-id='type-id-22'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='35'>
        <function-decl name='inDoEvalCoord2NOGE_BU' mangled-name='_ZN22OpenGLSurfaceEvaluator21inDoEvalCoord2NOGE_BUEffPfS0_' filepath='libnurbs/interface/glsurfeval.h' line='342' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-22'/>
          <parameter type-id='type-id-22'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='36'>
        <function-decl name='inDoEvalCoord2NOGE_BV' mangled-name='_ZN22OpenGLSurfaceEvaluator21inDoEvalCoord2NOGE_BVEffPfS0_' filepath='libnurbs/interface/glsurfeval.h' line='339' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-22'/>
          <parameter type-id='type-id-22'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='37'>
        <function-decl name='inPreEvaluateBV_intfac' mangled-name='_ZN22OpenGLSurfaceEvaluator22inPreEvaluateBV_intfacEf' filepath='libnurbs/interface/glsurfeval.h' line='316' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='38'>
        <function-decl name='inPreEvaluateBU_intfac' mangled-name='_ZN22OpenGLSurfaceEvaluator22inPreEvaluateBU_intfacEf' filepath='libnurbs/interface/glsurfeval.h' line='321' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
    </class-decl>
    <function-decl name='gluNewNurbsRenderer' mangled-name='gluNewNurbsRenderer' filepath='libnurbs/interface/glinterface.cc' line='66' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNewNurbsRenderer'>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='gluDeleteNurbsRenderer' mangled-name='gluDeleteNurbsRenderer' filepath='libnurbs/interface/glinterface.cc' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluDeleteNurbsRenderer'>
      <parameter type-id='type-id-46' name='r' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gluBeginSurface' mangled-name='gluBeginSurface' filepath='libnurbs/interface/glinterface.cc' line='89' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluBeginSurface'>
      <parameter type-id='type-id-46' name='r' filepath='libnurbs/interface/glinterface.cc' line='89' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gluBeginCurve' mangled-name='gluBeginCurve' filepath='libnurbs/interface/glinterface.cc' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluBeginCurve'>
      <parameter type-id='type-id-46' name='r' filepath='libnurbs/interface/glinterface.cc' line='99' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gluEndCurve' mangled-name='gluEndCurve' filepath='libnurbs/interface/glinterface.cc' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluEndCurve'>
      <parameter type-id='type-id-46' name='r' filepath='libnurbs/interface/glinterface.cc' line='105' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gluEndSurface' mangled-name='gluEndSurface' filepath='libnurbs/interface/glinterface.cc' line='111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluEndSurface'>
      <parameter type-id='type-id-46' name='r' filepath='libnurbs/interface/glinterface.cc' line='111' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gluBeginTrim' mangled-name='gluBeginTrim' filepath='libnurbs/interface/glinterface.cc' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluBeginTrim'>
      <parameter type-id='type-id-46' name='r' filepath='libnurbs/interface/glinterface.cc' line='131' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gluEndTrim' mangled-name='gluEndTrim' filepath='libnurbs/interface/glinterface.cc' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluEndTrim'>
      <parameter type-id='type-id-46' name='r' filepath='libnurbs/interface/glinterface.cc' line='141' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gluPwlCurve' mangled-name='gluPwlCurve' filepath='libnurbs/interface/glinterface.cc' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluPwlCurve'>
      <parameter type-id='type-id-46' name='r' filepath='libnurbs/interface/glinterface.cc' line='150' column='1'/>
      <parameter type-id='type-id-62' name='count' filepath='libnurbs/interface/glinterface.cc' line='150' column='1'/>
      <parameter type-id='type-id-51' name='array' filepath='libnurbs/interface/glinterface.cc' line='150' column='1'/>
      <parameter type-id='type-id-62' name='stride' filepath='libnurbs/interface/glinterface.cc' line='151' column='1'/>
      <parameter type-id='type-id-42' name='type' filepath='libnurbs/interface/glinterface.cc' line='151' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gluNurbsCurve' mangled-name='gluNurbsCurve' filepath='libnurbs/interface/glinterface.cc' line='173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsCurve'>
      <parameter type-id='type-id-46' name='r' filepath='libnurbs/interface/glinterface.cc' line='173' column='1'/>
      <parameter type-id='type-id-62' name='nknots' filepath='libnurbs/interface/glinterface.cc' line='173' column='1'/>
      <parameter type-id='type-id-51' name='knot' filepath='libnurbs/interface/glinterface.cc' line='173' column='1'/>
      <parameter type-id='type-id-62' name='stride' filepath='libnurbs/interface/glinterface.cc' line='173' column='1'/>
      <parameter type-id='type-id-51' name='ctlarray' filepath='libnurbs/interface/glinterface.cc' line='174' column='1'/>
      <parameter type-id='type-id-62' name='order' filepath='libnurbs/interface/glinterface.cc' line='174' column='1'/>
      <parameter type-id='type-id-42' name='type' filepath='libnurbs/interface/glinterface.cc' line='174' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gluNurbsSurface' mangled-name='gluNurbsSurface' filepath='libnurbs/interface/glinterface.cc' line='199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsSurface'>
      <parameter type-id='type-id-46' name='r' filepath='libnurbs/interface/glinterface.cc' line='199' column='1'/>
      <parameter type-id='type-id-62' name='sknot_count' filepath='libnurbs/interface/glinterface.cc' line='199' column='1'/>
      <parameter type-id='type-id-63' name='sknot' filepath='libnurbs/interface/glinterface.cc' line='199' column='1'/>
      <parameter type-id='type-id-62' name='tknot_count' filepath='libnurbs/interface/glinterface.cc' line='200' column='1'/>
      <parameter type-id='type-id-63' name='tknot' filepath='libnurbs/interface/glinterface.cc' line='200' column='1'/>
      <parameter type-id='type-id-62' name='s_stride' filepath='libnurbs/interface/glinterface.cc' line='201' column='1'/>
      <parameter type-id='type-id-62' name='t_stride' filepath='libnurbs/interface/glinterface.cc' line='201' column='1'/>
      <parameter type-id='type-id-63' name='ctlarray' filepath='libnurbs/interface/glinterface.cc' line='202' column='1'/>
      <parameter type-id='type-id-62' name='sorder' filepath='libnurbs/interface/glinterface.cc' line='202' column='1'/>
      <parameter type-id='type-id-62' name='torder' filepath='libnurbs/interface/glinterface.cc' line='202' column='1'/>
      <parameter type-id='type-id-42' name='type' filepath='libnurbs/interface/glinterface.cc' line='203' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gluLoadSamplingMatrices' mangled-name='gluLoadSamplingMatrices' filepath='libnurbs/interface/glinterface.cc' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluLoadSamplingMatrices'>
      <parameter type-id='type-id-46' name='r' filepath='libnurbs/interface/glinterface.cc' line='235' column='1'/>
      <parameter type-id='type-id-32' name='modelMatrix' filepath='libnurbs/interface/glinterface.cc' line='235' column='1'/>
      <parameter type-id='type-id-32' name='projMatrix' filepath='libnurbs/interface/glinterface.cc' line='236' column='1'/>
      <parameter type-id='type-id-64' name='viewport' filepath='libnurbs/interface/glinterface.cc' line='237' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gluNurbsProperty' mangled-name='gluNurbsProperty' filepath='libnurbs/interface/glinterface.cc' line='243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsProperty'>
      <parameter type-id='type-id-46' name='r' filepath='libnurbs/interface/glinterface.cc' line='243' column='1'/>
      <parameter type-id='type-id-42' name='property' filepath='libnurbs/interface/glinterface.cc' line='243' column='1'/>
      <parameter type-id='type-id-30' name='value' filepath='libnurbs/interface/glinterface.cc' line='243' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gluGetNurbsProperty' mangled-name='gluGetNurbsProperty' filepath='libnurbs/interface/glinterface.cc' line='359' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluGetNurbsProperty'>
      <parameter type-id='type-id-46' name='r' filepath='libnurbs/interface/glinterface.cc' line='359' column='1'/>
      <parameter type-id='type-id-42' name='property' filepath='libnurbs/interface/glinterface.cc' line='359' column='1'/>
      <parameter type-id='type-id-63' name='value' filepath='libnurbs/interface/glinterface.cc' line='359' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gluNurbsCallback' mangled-name='gluNurbsCallback' filepath='libnurbs/interface/glinterface.cc' line='430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsCallback'>
      <parameter type-id='type-id-46' name='r' filepath='libnurbs/interface/glinterface.cc' line='430' column='1'/>
      <parameter type-id='type-id-42' name='which' filepath='libnurbs/interface/glinterface.cc' line='430' column='1'/>
      <parameter type-id='type-id-65' name='fn' filepath='libnurbs/interface/glinterface.cc' line='430' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gluNurbsCallbackDataEXT' mangled-name='gluNurbsCallbackDataEXT' filepath='libnurbs/interface/glinterface.cc' line='459' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsCallbackDataEXT'>
      <parameter type-id='type-id-46' name='r' filepath='libnurbs/interface/glinterface.cc' line='459' column='1'/>
      <parameter type-id='type-id-17' name='userData' filepath='libnurbs/interface/glinterface.cc' line='459' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gluNurbsCallbackData' mangled-name='gluNurbsCallbackData' filepath='libnurbs/interface/glinterface.cc' line='466' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsCallbackData'>
      <parameter type-id='type-id-46' name='r' filepath='libnurbs/interface/glinterface.cc' line='466' column='1'/>
      <parameter type-id='type-id-17' name='userData' filepath='libnurbs/interface/glinterface.cc' line='466' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/glrenderer.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-30' size-in-bits='128' id='type-id-66'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-3' id='type-id-67'/>
    </array-type-def>
    <typedef-decl name='errorCallbackType' type-id='type-id-11' filepath='libnurbs/interface/glrenderer.h' line='46' column='1' id='type-id-53'/>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-68'/>
    <class-decl name='NurbsTessellator' size-in-bits='47616' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='53' column='1' id='type-id-52'>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='renderhints' type-id='type-id-69' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='104' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='320'>
        <var-decl name='maplist' type-id='type-id-70' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='105' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='3008'>
        <var-decl name='backend' type-id='type-id-71' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='106' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3648'>
        <var-decl name='subdivider' type-id='type-id-72' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='134' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='24064'>
        <var-decl name='jumpbuffer' type-id='type-id-73' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='135' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='24128'>
        <var-decl name='o_pwlcurvePool' type-id='type-id-74' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='136' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26624'>
        <var-decl name='o_nurbscurvePool' type-id='type-id-74' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='137' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='29120'>
        <var-decl name='o_curvePool' type-id='type-id-74' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='138' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='31616'>
        <var-decl name='o_trimPool' type-id='type-id-74' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='139' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='34112'>
        <var-decl name='o_surfacePool' type-id='type-id-74' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='140' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='36608'>
        <var-decl name='o_nurbssurfacePool' type-id='type-id-74' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='141' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='39104'>
        <var-decl name='propertyPool' type-id='type-id-74' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='142' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='41600'>
        <var-decl name='quiltPool' type-id='type-id-74' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='144' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='44096'>
        <var-decl name='extTrimVertexPool' type-id='type-id-75' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='146' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46720'>
        <var-decl name='inSurface' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='148' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46752'>
        <var-decl name='inCurve' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='149' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46784'>
        <var-decl name='inTrim' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='150' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46816'>
        <var-decl name='isCurveModified' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='151' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46848'>
        <var-decl name='isTrimModified' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='152' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46880'>
        <var-decl name='isSurfaceModified' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='153' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46912'>
        <var-decl name='isDataValid' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='154' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46944'>
        <var-decl name='numTrims' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='155' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46976'>
        <var-decl name='playBack' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='156' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47040'>
        <var-decl name='nextTrim' type-id='type-id-76' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='158' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47104'>
        <var-decl name='nextCurve' type-id='type-id-77' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='159' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47168'>
        <var-decl name='nextNurbscurve' type-id='type-id-78' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='160' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47232'>
        <var-decl name='nextPwlcurve' type-id='type-id-79' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='161' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47296'>
        <var-decl name='nextNurbssurface' type-id='type-id-80' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='162' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47360'>
        <var-decl name='currentSurface' type-id='type-id-81' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='164' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47424'>
        <var-decl name='currentTrim' type-id='type-id-82' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='165' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47488'>
        <var-decl name='currentCurve' type-id='type-id-83' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='166' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47552'>
        <var-decl name='dl' type-id='type-id-84' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='168' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='NurbsTessellator' filepath='libnurbs/internals/nurbsinterfac.cc' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-85' is-artificial='yes'/>
          <parameter type-id='type-id-86'/>
          <parameter type-id='type-id-87'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='NurbsTessellator' filepath='libnurbs/internals/nurbsinterfac.cc' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-88' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-86' name='c' filepath='libnurbs/internals/nurbsinterfac.cc' line='66' column='1'/>
          <parameter type-id='type-id-87' name='e' filepath='libnurbs/internals/nurbsinterfac.cc' line='66' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='NurbsTessellator' filepath='libnurbs/internals/nurbsinterfac.cc' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-88' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-86' name='c' filepath='libnurbs/internals/nurbsinterfac.cc' line='66' column='1'/>
          <parameter type-id='type-id-87' name='e' filepath='libnurbs/internals/nurbsinterfac.cc' line='66' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <function-decl name='~NurbsTessellator' filepath='libnurbs/internals/nurbsinterfac.cc' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-85' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='2'>
        <function-decl name='bgnrender' mangled-name='_ZN16NurbsTessellator9bgnrenderEv' filepath='libnurbs/internals/nurbstess.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-85' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='3'>
        <function-decl name='endrender' mangled-name='_ZN16NurbsTessellator9endrenderEv' filepath='libnurbs/internals/nurbstess.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-85' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='4'>
        <function-decl name='makeobj' mangled-name='_ZN16NurbsTessellator7makeobjEi' filepath='libnurbs/internals/nurbstess.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-85' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='5'>
        <function-decl name='closeobj' mangled-name='_ZN16NurbsTessellator8closeobjEv' filepath='libnurbs/internals/nurbstess.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-85' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='6'>
        <function-decl name='errorHandler' mangled-name='_ZN16NurbsTessellator12errorHandlerEi' filepath='libnurbs/internals/nurbstess.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-85' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/glsurfeval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-62' size-in-bits='64' id='type-id-57'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-3' id='type-id-89'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='64' id='type-id-90'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-3' id='type-id-89'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='96' id='type-id-91'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-3' id='type-id-92'/>
    </array-type-def>
    <array-type-def dimensions='2' type-id='type-id-1' size-in-bits='5120' id='type-id-59'>
      <subrange length='40' lower-bound='0' upper-bound='39' type-id='type-id-3' id='type-id-6'/>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-3' id='type-id-67'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='204800' id='type-id-60'>
      <subrange length='6400' lower-bound='0' upper-bound='6399' type-id='type-id-3' id='type-id-93'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-94' size-in-bits='192' id='type-id-56'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-3' id='type-id-92'/>
    </array-type-def>
    <class-decl name='StoredVertex' size-in-bits='256' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='84' column='1' id='type-id-95'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='95' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='32'>
        <var-decl name='coord' type-id='type-id-90' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='96' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='point' type-id='type-id-96' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='97' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='StoredVertex' filepath='libnurbs/interface/glsurfeval.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-94' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~StoredVertex' filepath='libnurbs/interface/glsurfeval.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-94' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~StoredVertex' filepath='libnurbs/interface/glsurfeval.h' line='87' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-97' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-33' name='__in_chrg' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='StoredVertex' filepath='libnurbs/interface/glsurfeval.h' line='86' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-97' name='this' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='128' id='type-id-96'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-3' id='type-id-89'/>
    </array-type-def>
    <class-decl name='bezierPatch' size-in-bits='384' is-struct='yes' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='36' column='1' id='type-id-98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='umin' type-id='type-id-24' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vmin' type-id='type-id-24' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='umax' type-id='type-id-24' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='vmax' type-id='type-id-24' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uorder' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vorder' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dimension' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ctlpoints' type-id='type-id-51' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='next' type-id='type-id-99' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bezierPatchMesh' size-in-bits='960' is-struct='yes' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='39' column='1' id='type-id-100'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bpatch' type-id='type-id-101' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bpatch_normal' type-id='type-id-101' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='bpatch_texcoord' type-id='type-id-101' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bpatch_color' type-id='type-id-101' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='UVarray' type-id='type-id-51' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='length_array' type-id='type-id-102' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='type_array' type-id='type-id-103' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='size_UVarray' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='index_UVarray' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='size_length_array' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='index_length_array' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='counter' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='type' type-id='type-id-42' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='vertex_array' type-id='type-id-51' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='normal_array' type-id='type-id-51' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='color_array' type-id='type-id-51' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='texcoord_array' type-id='type-id-51' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='next' type-id='type-id-104' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='surfEvalMachine' size-in-bits='210272' is-struct='yes' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='63' column='1' id='type-id-105'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uprime' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vprime' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='k' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='u1' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='u2' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='ustride' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='uorder' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='v1' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='v2' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='vstride' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='vorder' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='ctlPoints' type-id='type-id-60' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='205152'>
        <var-decl name='ucoeff' type-id='type-id-5' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='206432'>
        <var-decl name='vcoeff' type-id='type-id-5' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='207712'>
        <var-decl name='ucoeffDeriv' type-id='type-id-5' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208992'>
        <var-decl name='vcoeffDeriv' type-id='type-id-5' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='79' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='bezierPatch' type-id='type-id-98' filepath='libnurbs/interface/bezierPatch.h' line='65' column='1' id='type-id-106'/>
    <typedef-decl name='bezierPatchMesh' type-id='type-id-100' filepath='libnurbs/interface/bezierPatchMesh.h' line='66' column='1' id='type-id-107'/>
    <typedef-decl name='surfEvalMachine' type-id='type-id-105' filepath='libnurbs/interface/glsurfeval.h' line='80' column='1' id='type-id-61'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-108'/>
    <qualified-type-def type-id='type-id-108' const='yes' id='type-id-109'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-103'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-110'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-94'/>
    <qualified-type-def type-id='type-id-94' const='yes' id='type-id-97'/>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-99'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-101'/>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-104'/>
    <pointer-type-def type-id='type-id-107' size-in-bits='64' id='type-id-58'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-102'/>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' id='type-id-111'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-113'/>
    <class-decl name='BasicSurfaceEvaluator' size-in-bits='64' visibility='default' filepath='libnurbs/internals/basicsurfeval.h' line='43' column='1' id='type-id-55'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-27'/>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <function-decl name='~BasicSurfaceEvaluator' filepath='libnurbs/internals/basicsurfeval.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='9'>
        <function-decl name='range2f' mangled-name='_ZN21BasicSurfaceEvaluator7range2fElPfS0_' filepath='libnurbs/internals/basicsurfeval.cc' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-22'/>
          <parameter type-id='type-id-22'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='10'>
        <function-decl name='domain2f' mangled-name='_ZN21BasicSurfaceEvaluator8domain2fEffff' filepath='libnurbs/internals/basicsurfeval.cc' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='11'>
        <function-decl name='enable' mangled-name='_ZN21BasicSurfaceEvaluator6enableEl' filepath='libnurbs/internals/basicsurfeval.cc' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='12'>
        <function-decl name='disable' mangled-name='_ZN21BasicSurfaceEvaluator7disableEl' filepath='libnurbs/internals/basicsurfeval.cc' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='13'>
        <function-decl name='bgnmap2f' mangled-name='_ZN21BasicSurfaceEvaluator8bgnmap2fEl' filepath='libnurbs/internals/basicsurfeval.cc' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='14'>
        <function-decl name='map2f' mangled-name='_ZN21BasicSurfaceEvaluator5map2fElffllffllPf' filepath='libnurbs/internals/basicsurfeval.cc' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-22'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='15'>
        <function-decl name='mapgrid2f' mangled-name='_ZN21BasicSurfaceEvaluator9mapgrid2fElfflff' filepath='libnurbs/internals/basicsurfeval.cc' line='116' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='16'>
        <function-decl name='mapmesh2f' mangled-name='_ZN21BasicSurfaceEvaluator9mapmesh2fElllll' filepath='libnurbs/internals/basicsurfeval.cc' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='17'>
        <function-decl name='evalcoord2f' mangled-name='_ZN21BasicSurfaceEvaluator11evalcoord2fElff' filepath='libnurbs/internals/basicsurfeval.cc' line='132' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='18'>
        <function-decl name='evalpoint2i' mangled-name='_ZN21BasicSurfaceEvaluator11evalpoint2iEll' filepath='libnurbs/internals/basicsurfeval.cc' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='19'>
        <function-decl name='endmap2f' mangled-name='_ZN21BasicSurfaceEvaluator8endmap2fEv' filepath='libnurbs/internals/basicsurfeval.cc' line='98' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='20'>
        <function-decl name='polymode' mangled-name='_ZN21BasicSurfaceEvaluator8polymodeEl' filepath='libnurbs/internals/basicsurfeval.cc' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='21'>
        <function-decl name='bgnline' mangled-name='_ZN21BasicSurfaceEvaluator7bgnlineEv' filepath='libnurbs/internals/basicsurfeval.cc' line='148' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='22'>
        <function-decl name='endline' mangled-name='_ZN21BasicSurfaceEvaluator7endlineEv' filepath='libnurbs/internals/basicsurfeval.cc' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='23'>
        <function-decl name='bgnclosedline' mangled-name='_ZN21BasicSurfaceEvaluator13bgnclosedlineEv' filepath='libnurbs/internals/basicsurfeval.cc' line='164' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='24'>
        <function-decl name='endclosedline' mangled-name='_ZN21BasicSurfaceEvaluator13endclosedlineEv' filepath='libnurbs/internals/basicsurfeval.cc' line='172' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='25'>
        <function-decl name='bgntmesh' mangled-name='_ZN21BasicSurfaceEvaluator8bgntmeshEv' filepath='libnurbs/internals/basicsurfeval.cc' line='194' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='26'>
        <function-decl name='swaptmesh' mangled-name='_ZN21BasicSurfaceEvaluator9swaptmeshEv' filepath='libnurbs/internals/basicsurfeval.cc' line='202' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='27'>
        <function-decl name='endtmesh' mangled-name='_ZN21BasicSurfaceEvaluator8endtmeshEv' filepath='libnurbs/internals/basicsurfeval.cc' line='210' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='28'>
        <function-decl name='bgnqstrip' mangled-name='_ZN21BasicSurfaceEvaluator9bgnqstripEv' filepath='libnurbs/internals/basicsurfeval.cc' line='218' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='29'>
        <function-decl name='endqstrip' mangled-name='_ZN21BasicSurfaceEvaluator9endqstripEv' filepath='libnurbs/internals/basicsurfeval.cc' line='226' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='30'>
        <function-decl name='bgntfan' mangled-name='_ZN21BasicSurfaceEvaluator7bgntfanEv' filepath='libnurbs/internals/basicsurfeval.cc' line='180' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='31'>
        <function-decl name='endtfan' mangled-name='_ZN21BasicSurfaceEvaluator7endtfanEv' filepath='libnurbs/internals/basicsurfeval.cc' line='188' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='32'>
        <function-decl name='evalUStrip' mangled-name='_ZN21BasicSurfaceEvaluator10evalUStripEifPfifS0_' filepath='libnurbs/internals/basicsurfeval.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-22'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-22'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='33'>
        <function-decl name='evalVStrip' mangled-name='_ZN21BasicSurfaceEvaluator10evalVStripEifPfifS0_' filepath='libnurbs/internals/basicsurfeval.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-22'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-22'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='34'>
        <function-decl name='inDoEvalCoord2NOGE' mangled-name='_ZN21BasicSurfaceEvaluator18inDoEvalCoord2NOGEEffPfS0_' filepath='libnurbs/internals/basicsurfeval.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-22'/>
          <parameter type-id='type-id-22'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='35'>
        <function-decl name='inDoEvalCoord2NOGE_BU' mangled-name='_ZN21BasicSurfaceEvaluator21inDoEvalCoord2NOGE_BUEffPfS0_' filepath='libnurbs/internals/basicsurfeval.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-22'/>
          <parameter type-id='type-id-22'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='36'>
        <function-decl name='inDoEvalCoord2NOGE_BV' mangled-name='_ZN21BasicSurfaceEvaluator21inDoEvalCoord2NOGE_BVEffPfS0_' filepath='libnurbs/internals/basicsurfeval.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-22'/>
          <parameter type-id='type-id-22'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='37'>
        <function-decl name='inPreEvaluateBV_intfac' mangled-name='_ZN21BasicSurfaceEvaluator22inPreEvaluateBV_intfacEf' filepath='libnurbs/internals/basicsurfeval.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='38'>
        <function-decl name='inPreEvaluateBU_intfac' mangled-name='_ZN21BasicSurfaceEvaluator22inPreEvaluateBU_intfacEf' filepath='libnurbs/internals/basicsurfeval.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='SurfaceMap' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-112'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/incurveeval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/insurfeval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/arc.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <type-decl name='char' size-in-bits='8' id='type-id-114'/>
    <array-type-def dimensions='1' type-id='type-id-115' size-in-bits='2048' id='type-id-116'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='type-id-3' id='type-id-117'/>
    </array-type-def>
    <class-decl name='Buffer' size-in-bits='64' visibility='default' filepath='libnurbs/internals/bufpool.h' line='45' column='1' id='type-id-118'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-119' visibility='default' filepath='libnurbs/internals/bufpool.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Pool' size-in-bits='2496' visibility='default' filepath='libnurbs/internals/bufpool.h' line='50' column='1' id='type-id-74'>
      <member-type access='protected'>
        <enum-decl name='Magic' filepath='libnurbs/internals/bufpool.h' line='70' column='1' id='type-id-120'>
          <underlying-type type-id='type-id-40'/>
          <enumerator name='is_allocated' value='62369'/>
          <enumerator name='is_free' value='61858'/>
        </enum-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='freelist' type-id='type-id-119' visibility='default' filepath='libnurbs/internals/bufpool.h' line='62' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='blocklist' type-id='type-id-116' visibility='default' filepath='libnurbs/internals/bufpool.h' line='63' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2112'>
        <var-decl name='nextblock' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/bufpool.h' line='64' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2176'>
        <var-decl name='curblock' type-id='type-id-115' visibility='default' filepath='libnurbs/internals/bufpool.h' line='65' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2240'>
        <var-decl name='buffersize' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/bufpool.h' line='66' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2272'>
        <var-decl name='nextsize' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/bufpool.h' line='67' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2304'>
        <var-decl name='nextfree' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/bufpool.h' line='68' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2336'>
        <var-decl name='initsize' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/bufpool.h' line='69' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2368'>
        <var-decl name='name' type-id='type-id-121' visibility='default' filepath='libnurbs/internals/bufpool.h' line='71' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2432'>
        <var-decl name='magic' type-id='type-id-120' visibility='default' filepath='libnurbs/internals/bufpool.h' line='72' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='Pool' filepath='libnurbs/internals/bufpool.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Pool' filepath='libnurbs/internals/bufpool.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Pool' filepath='libnurbs/internals/bufpool.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Pool' filepath='libnurbs/internals/bufpool.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Pool' filepath='libnurbs/internals/bufpool.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Pool' filepath='libnurbs/internals/bufpool.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Pool' filepath='libnurbs/internals/bufpool.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Pool' filepath='libnurbs/internals/bufpool.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Pool' filepath='libnurbs/internals/bufpool.cc' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-123' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-10' name='_buffersize' filepath='libnurbs/internals/bufpool.cc' line='49' column='1'/>
          <parameter type-id='type-id-10' name='initpoolsize' filepath='libnurbs/internals/bufpool.cc' line='49' column='1'/>
          <parameter type-id='type-id-121' name='n' filepath='libnurbs/internals/bufpool.cc' line='49' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Pool' filepath='libnurbs/internals/bufpool.cc' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-123' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-10' name='_buffersize' filepath='libnurbs/internals/bufpool.cc' line='49' column='1'/>
          <parameter type-id='type-id-10' name='initpoolsize' filepath='libnurbs/internals/bufpool.cc' line='49' column='1'/>
          <parameter type-id='type-id-121' name='n' filepath='libnurbs/internals/bufpool.cc' line='49' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Pool' filepath='libnurbs/internals/bufpool.cc' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-123' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-33' name='__in_chrg' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Pool' filepath='libnurbs/internals/bufpool.cc' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-123' name='this' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Pool' filepath='libnurbs/internals/bufpool.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Pool' filepath='libnurbs/internals/bufpool.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Pool' filepath='libnurbs/internals/bufpool.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Pool' filepath='libnurbs/internals/bufpool.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Pool' filepath='libnurbs/internals/bufpool.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Pool' filepath='libnurbs/internals/bufpool.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Pool' filepath='libnurbs/internals/bufpool.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Pool' filepath='libnurbs/internals/bufpool.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Pool' filepath='libnurbs/internals/bufpool.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Pool' filepath='libnurbs/internals/bufpool.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Pool' filepath='libnurbs/internals/bufpool.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Pool' filepath='libnurbs/internals/bufpool.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Pool' filepath='libnurbs/internals/bufpool.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Pool' filepath='libnurbs/internals/bufpool.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Pool' filepath='libnurbs/internals/bufpool.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Pool' filepath='libnurbs/internals/bufpool.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Pool' filepath='libnurbs/internals/bufpool.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Pool' filepath='libnurbs/internals/bufpool.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Pool' filepath='libnurbs/internals/bufpool.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Pool' filepath='libnurbs/internals/bufpool.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Pool' filepath='libnurbs/internals/bufpool.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Pool' filepath='libnurbs/internals/bufpool.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Pool' filepath='libnurbs/internals/bufpool.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Pool' filepath='libnurbs/internals/bufpool.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Pool' filepath='libnurbs/internals/bufpool.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Pool' filepath='libnurbs/internals/bufpool.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Pool' filepath='libnurbs/internals/bufpool.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Pool' filepath='libnurbs/internals/bufpool.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Pool' filepath='libnurbs/internals/bufpool.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Pool' filepath='libnurbs/internals/bufpool.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Pool' filepath='libnurbs/internals/bufpool.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Pool' filepath='libnurbs/internals/bufpool.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Pool' filepath='libnurbs/internals/bufpool.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Pool' filepath='libnurbs/internals/bufpool.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Pool' filepath='libnurbs/internals/bufpool.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Pool' filepath='libnurbs/internals/bufpool.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Pool' filepath='libnurbs/internals/bufpool.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Pool' filepath='libnurbs/internals/bufpool.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Pool' filepath='libnurbs/internals/bufpool.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Pool' filepath='libnurbs/internals/bufpool.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Pool' filepath='libnurbs/internals/bufpool.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Pool' filepath='libnurbs/internals/bufpool.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='PooledObj' size-in-bits='8' visibility='default' filepath='libnurbs/internals/bufpool.h' line='118' column='1' id='type-id-124'/>
    <class-decl name='PwlArc' size-in-bits='192' visibility='default' filepath='libnurbs/internals/pwlarc.h' line='44' column='1' id='type-id-125'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-124'/>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='pts' type-id='type-id-126' visibility='default' filepath='libnurbs/internals/pwlarc.h' line='46' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='npts' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/pwlarc.h' line='47' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='type' type-id='type-id-21' visibility='default' filepath='libnurbs/internals/pwlarc.h' line='48' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-126'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-126'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-126'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-126'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-126'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-126'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='55' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-128' name='this' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='63' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-128' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-10' name='_npts' filepath='libnurbs/internals/pwlarc.h' line='63' column='1'/>
          <parameter type-id='type-id-126' name='_pts' filepath='libnurbs/internals/pwlarc.h' line='63' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-126'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-126'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-126'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-126'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-129'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-129'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-126'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-126'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-129'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-129'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-129'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-129'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-126'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-126'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='63' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-128' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-10' name='_npts' filepath='libnurbs/internals/pwlarc.h' line='63' column='1'/>
          <parameter type-id='type-id-126' name='_pts' filepath='libnurbs/internals/pwlarc.h' line='63' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-129'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-129'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-126'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-126'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-126'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-126'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='55' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-128' name='this' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-126'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-126'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-126'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-126'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-129'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-129'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-126'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-126'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-126'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-126'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='63' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-128' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-10' name='_npts' filepath='libnurbs/internals/pwlarc.h' line='63' column='1'/>
          <parameter type-id='type-id-126' name='_pts' filepath='libnurbs/internals/pwlarc.h' line='63' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-129'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-129'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-129'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-129'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-126'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-126'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-126'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <parameter type-id='type-id-126'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
    </class-decl>
    <enum-decl name='arc_side' filepath='libnurbs/internals/arc.h' line='52' column='1' id='type-id-130'>
      <underlying-type type-id='type-id-40'/>
      <enumerator name='arc_none' value='0'/>
      <enumerator name='arc_right' value='1'/>
      <enumerator name='arc_top' value='2'/>
      <enumerator name='arc_left' value='3'/>
      <enumerator name='arc_bottom' value='4'/>
    </enum-decl>
    <class-decl name='Arc' size-in-bits='448' is-struct='yes' visibility='default' filepath='libnurbs/internals/arc.h' line='55' column='1' id='type-id-131'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-124'/>
      <data-member access='public' static='yes'>
        <var-decl name='bezier_tag' type-id='type-id-33' mangled-name='_ZN3Arc10bezier_tagE' visibility='default' filepath='libnurbs/internals/arc.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='arc_tag' type-id='type-id-33' mangled-name='_ZN3Arc7arc_tagE' visibility='default' filepath='libnurbs/internals/arc.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='tail_tag' type-id='type-id-33' mangled-name='_ZN3Arc8tail_tagE' visibility='default' filepath='libnurbs/internals/arc.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prev' type-id='type-id-132' visibility='default' filepath='libnurbs/internals/arc.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-132' visibility='default' filepath='libnurbs/internals/arc.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='link' type-id='type-id-132' visibility='default' filepath='libnurbs/internals/arc.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bezierArc' type-id='type-id-133' visibility='default' filepath='libnurbs/internals/arc.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pwlArc' type-id='type-id-127' visibility='default' filepath='libnurbs/internals/arc.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='type' type-id='type-id-21' visibility='default' filepath='libnurbs/internals/arc.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nuid' type-id='type-id-21' visibility='default' filepath='libnurbs/internals/arc.h' line='67' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-134'/>
          <parameter type-id='type-id-127'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-130'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-134'/>
          <parameter type-id='type-id-127'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-130'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-134'/>
          <parameter type-id='type-id-127'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-130'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-134'/>
          <parameter type-id='type-id-127'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-130'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-134'/>
          <parameter type-id='type-id-127'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-130'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-134'/>
          <parameter type-id='type-id-127'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-130'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-134'/>
          <parameter type-id='type-id-127'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-130'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-134'/>
          <parameter type-id='type-id-127'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-130'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-134'/>
          <parameter type-id='type-id-127'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-130'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-134'/>
          <parameter type-id='type-id-127'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-130'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='109' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-135' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-134' name='j' filepath='libnurbs/internals/arc.h' line='109' column='1'/>
          <parameter type-id='type-id-127' name='p' filepath='libnurbs/internals/arc.h' line='109' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-134'/>
          <parameter type-id='type-id-127'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-130'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-134'/>
          <parameter type-id='type-id-127'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-130'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-134'/>
          <parameter type-id='type-id-127'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-130'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='127' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-135' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-130' name='side' filepath='libnurbs/internals/arc.h' line='127' column='1'/>
          <parameter type-id='type-id-21' name='_nuid' filepath='libnurbs/internals/arc.h' line='127' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-134'/>
          <parameter type-id='type-id-127'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-130'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-134'/>
          <parameter type-id='type-id-127'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-130'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-134'/>
          <parameter type-id='type-id-127'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-130'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-134'/>
          <parameter type-id='type-id-127'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-130'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='127' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-135' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-130' name='side' filepath='libnurbs/internals/arc.h' line='127' column='1'/>
          <parameter type-id='type-id-21' name='_nuid' filepath='libnurbs/internals/arc.h' line='127' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-134'/>
          <parameter type-id='type-id-127'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-130'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='127' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-135' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-130' name='side' filepath='libnurbs/internals/arc.h' line='127' column='1'/>
          <parameter type-id='type-id-21' name='_nuid' filepath='libnurbs/internals/arc.h' line='127' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-134'/>
          <parameter type-id='type-id-127'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-130'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-134'/>
          <parameter type-id='type-id-127'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-130'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-134'/>
          <parameter type-id='type-id-127'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-130'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-134'/>
          <parameter type-id='type-id-127'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-130'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='TrimVertex' size-in-bits='128' is-struct='yes' visibility='default' filepath='libnurbs/internals/trimvertex.h' line='43' column='1' id='type-id-136'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='param' type-id='type-id-90' visibility='default' filepath='libnurbs/internals/trimvertex.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nuid' type-id='type-id-21' visibility='default' filepath='libnurbs/internals/trimvertex.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='Arc_ptr' type-id='type-id-134' filepath='libnurbs/internals/arc.h' line='50' column='1' id='type-id-132'/>
    <typedef-decl name='size_t' type-id='type-id-3' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/include/stddef.h' line='211' column='1' id='type-id-137'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-134'/>
    <qualified-type-def type-id='type-id-134' const='yes' id='type-id-135'/>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-138'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-133'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-119'/>
    <reference-type-def kind='lvalue' type-id='type-id-74' size-in-bits='64' id='type-id-140'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-122'/>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' id='type-id-141'/>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-127'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-126'/>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-115'/>
    <qualified-type-def type-id='type-id-114' const='yes' id='type-id-142'/>
    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-121'/>
    <class-decl name='BezierArc' size-in-bits='256' is-struct='yes' visibility='default' filepath='libnurbs/internals/bezierarc.h' line='43' column='1' id='type-id-139'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-124'/>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cpts' type-id='type-id-22' visibility='default' filepath='libnurbs/internals/bezierarc.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='order' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/bezierarc.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='stride' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/bezierarc.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='type' type-id='type-id-21' visibility='default' filepath='libnurbs/internals/bezierarc.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mapdesc' type-id='type-id-143' visibility='default' filepath='libnurbs/internals/bezierarc.h' line='48' column='1'/>
      </data-member>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/arcsorter.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='128' id='type-id-144'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-3' id='type-id-67'/>
    </array-type-def>
    <array-type-def dimensions='3' type-id='type-id-1' size-in-bits='unknown' id='type-id-145'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' id='type-id-146'/>
      <subrange length='24' lower-bound='0' upper-bound='23' type-id='type-id-3' id='type-id-147'/>
      <subrange length='24' lower-bound='0' upper-bound='23' type-id='type-id-3' id='type-id-147'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-148' size-in-bits='1600' id='type-id-149'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-3' id='type-id-150'/>
    </array-type-def>
    <class-decl name='ArcSdirSorter' size-in-bits='192' visibility='default' filepath='libnurbs/internals/arcsorter.h' line='57' column='1' id='type-id-151'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-152'/>
      <member-function access='private' constructor='yes'>
        <function-decl name='ArcSdirSorter' filepath='libnurbs/internals/arcsorter.cc' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-153' is-artificial='yes'/>
          <parameter type-id='type-id-154'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='ArcSdirSorter' filepath='libnurbs/internals/arcsorter.cc' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-155' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-154' name='s' filepath='libnurbs/internals/arcsorter.cc' line='88' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='ArcSdirSorter' filepath='libnurbs/internals/arcsorter.cc' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-155' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-154' name='s' filepath='libnurbs/internals/arcsorter.cc' line='88' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='2'>
        <function-decl name='qscmp' mangled-name='_ZN13ArcSdirSorter5qscmpEPcS0_' filepath='libnurbs/internals/arcsorter.cc' line='93' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-153' is-artificial='yes'/>
          <parameter type-id='type-id-115'/>
          <parameter type-id='type-id-115'/>
          <return type-id='type-id-10'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='ArcSorter' size-in-bits='192' visibility='default' filepath='libnurbs/internals/arcsorter.h' line='44' column='1' id='type-id-152'>
      <base-class access='private' layout-offset-in-bits='0' type-id='type-id-156'/>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='subdivider' type-id='type-id-154' visibility='default' filepath='libnurbs/internals/arcsorter.h' line='50' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='ArcSorter' filepath='libnurbs/internals/arcsorter.cc' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-157' is-artificial='yes'/>
          <parameter type-id='type-id-154'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='ArcSorter' filepath='libnurbs/internals/arcsorter.cc' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-158' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-154' name='s' filepath='libnurbs/internals/arcsorter.cc' line='48' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='ArcSorter' filepath='libnurbs/internals/arcsorter.cc' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-158' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-154' name='s' filepath='libnurbs/internals/arcsorter.cc' line='48' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='2'>
        <function-decl name='qscmp' mangled-name='_ZN9ArcSorter5qscmpEPcS0_' filepath='libnurbs/internals/arcsorter.cc' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-157' is-artificial='yes'/>
          <parameter type-id='type-id-115'/>
          <parameter type-id='type-id-115'/>
          <return type-id='type-id-10'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='3'>
        <function-decl name='qsexc' mangled-name='_ZN9ArcSorter5qsexcEPcS0_' filepath='libnurbs/internals/arcsorter.cc' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-157' is-artificial='yes'/>
          <parameter type-id='type-id-115'/>
          <parameter type-id='type-id-115'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='4'>
        <function-decl name='qstexc' mangled-name='_ZN9ArcSorter6qstexcEPcS0_S0_' filepath='libnurbs/internals/arcsorter.cc' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-157' is-artificial='yes'/>
          <parameter type-id='type-id-115'/>
          <parameter type-id='type-id-115'/>
          <parameter type-id='type-id-115'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='ArcTdirSorter' size-in-bits='192' visibility='default' filepath='libnurbs/internals/arcsorter.h' line='65' column='1' id='type-id-159'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-152'/>
      <member-function access='private' constructor='yes'>
        <function-decl name='ArcTdirSorter' filepath='libnurbs/internals/arcsorter.cc' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-154'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='ArcTdirSorter' filepath='libnurbs/internals/arcsorter.cc' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-161' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-154' name='s' filepath='libnurbs/internals/arcsorter.cc' line='125' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='ArcTdirSorter' filepath='libnurbs/internals/arcsorter.cc' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-161' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-154' name='s' filepath='libnurbs/internals/arcsorter.cc' line='125' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='2'>
        <function-decl name='qscmp' mangled-name='_ZN13ArcTdirSorter5qscmpEPcS0_' filepath='libnurbs/internals/arcsorter.cc' line='138' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-115'/>
          <parameter type-id='type-id-115'/>
          <return type-id='type-id-10'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='ArcTessellator' size-in-bits='128' visibility='default' filepath='libnurbs/internals/arctess.h' line='47' column='1' id='type-id-162'>
      <data-member access='private' static='yes'>
        <var-decl name='gl_Bernstein' type-id='type-id-145' mangled-name='_ZN14ArcTessellator12gl_BernsteinE' visibility='default' filepath='libnurbs/internals/arctess.h' line='60' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='pwlarcpool' type-id='type-id-140' visibility='default' filepath='libnurbs/internals/arctess.h' line='61' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='trimvertexpool' type-id='type-id-163' visibility='default' filepath='libnurbs/internals/arctess.h' line='62' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='ArcTessellator' filepath='libnurbs/internals/arctess.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-164' is-artificial='yes'/>
          <parameter type-id='type-id-163'/>
          <parameter type-id='type-id-140'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~ArcTessellator' filepath='libnurbs/internals/arctess.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-164' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='ArcTessellator' filepath='libnurbs/internals/arctess.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-164' is-artificial='yes'/>
          <parameter type-id='type-id-163'/>
          <parameter type-id='type-id-140'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~ArcTessellator' filepath='libnurbs/internals/arctess.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-164' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='ArcTessellator' filepath='libnurbs/internals/arctess.cc' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-165' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-163' name='t' filepath='libnurbs/internals/arctess.cc' line='59' column='1'/>
          <parameter type-id='type-id-140' name='p' filepath='libnurbs/internals/arctess.cc' line='59' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='ArcTessellator' filepath='libnurbs/internals/arctess.cc' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-165' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-163' name='t' filepath='libnurbs/internals/arctess.cc' line='59' column='1'/>
          <parameter type-id='type-id-140' name='p' filepath='libnurbs/internals/arctess.cc' line='59' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~ArcTessellator' filepath='libnurbs/internals/arctess.cc' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-165' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-33' name='__in_chrg' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~ArcTessellator' filepath='libnurbs/internals/arctess.cc' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-165' name='this' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Bin' size-in-bits='128' visibility='default' filepath='libnurbs/internals/bin.h' line='44' column='1' id='type-id-166'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='head' type-id='type-id-132' visibility='default' filepath='libnurbs/internals/bin.h' line='46' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='current' type-id='type-id-132' visibility='default' filepath='libnurbs/internals/bin.h' line='47' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='Bin' filepath='libnurbs/internals/bin.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-167' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Bin' filepath='libnurbs/internals/bin.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-167' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Bin' filepath='libnurbs/internals/bin.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-167' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Bin' filepath='libnurbs/internals/bin.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-167' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Bin' filepath='libnurbs/internals/bin.cc' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-168' name='this' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Bin' filepath='libnurbs/internals/bin.cc' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-168' name='this' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Bin' filepath='libnurbs/internals/bin.cc' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-168' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-33' name='__in_chrg' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Bin' filepath='libnurbs/internals/bin.cc' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-168' name='this' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Bin' filepath='libnurbs/internals/bin.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-167' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Bin' filepath='libnurbs/internals/bin.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-167' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Bin' filepath='libnurbs/internals/bin.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-167' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Bin' filepath='libnurbs/internals/bin.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-167' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Bin' filepath='libnurbs/internals/bin.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-167' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Bin' filepath='libnurbs/internals/bin.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-167' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Bin' filepath='libnurbs/internals/bin.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-167' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Bin' filepath='libnurbs/internals/bin.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-167' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Bin' filepath='libnurbs/internals/bin.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-167' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Bin' filepath='libnurbs/internals/bin.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-167' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Bin' filepath='libnurbs/internals/bin.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-167' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Bin' filepath='libnurbs/internals/bin.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-167' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Bin' filepath='libnurbs/internals/bin.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-167' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Bin' filepath='libnurbs/internals/bin.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-167' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Bin' filepath='libnurbs/internals/bin.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-167' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Bin' filepath='libnurbs/internals/bin.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-167' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Bin' filepath='libnurbs/internals/bin.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-167' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Bin' filepath='libnurbs/internals/bin.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-167' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Flist' size-in-bits='320' visibility='default' filepath='libnurbs/internals/flist.h' line='42' column='1' id='type-id-169'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='pts' type-id='type-id-22' visibility='default' filepath='libnurbs/internals/flist.h' line='44' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='npts' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/flist.h' line='45' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <var-decl name='start' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/flist.h' line='46' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='end' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/flist.h' line='47' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='sorter' type-id='type-id-170' visibility='default' filepath='libnurbs/internals/flist.h' line='56' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='Flist' filepath='libnurbs/internals/flist.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-171' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Flist' filepath='libnurbs/internals/flist.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-171' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Flist' filepath='libnurbs/internals/flist.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-171' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Flist' filepath='libnurbs/internals/flist.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-171' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Flist' filepath='libnurbs/internals/flist.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-171' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Flist' filepath='libnurbs/internals/flist.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-171' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Flist' filepath='libnurbs/internals/flist.cc' line='60' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-172' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-33' name='__in_chrg' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Flist' filepath='libnurbs/internals/flist.cc' line='60' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-172' name='this' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Flist' filepath='libnurbs/internals/flist.cc' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-172' name='this' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Flist' filepath='libnurbs/internals/flist.cc' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-172' name='this' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Flist' filepath='libnurbs/internals/flist.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-171' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Flist' filepath='libnurbs/internals/flist.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-171' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Flist' filepath='libnurbs/internals/flist.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-171' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Flist' filepath='libnurbs/internals/flist.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-171' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Flist' filepath='libnurbs/internals/flist.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-171' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Flist' filepath='libnurbs/internals/flist.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-171' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Subdivider' size-in-bits='20416' visibility='default' filepath='libnurbs/internals/subdivider.h' line='55' column='1' id='type-id-72'>
      <member-type access='private'>
        <enum-decl name='dir' filepath='libnurbs/internals/subdivider.h' line='105' column='1' id='type-id-173'>
          <underlying-type type-id='type-id-40'/>
          <enumerator name='down' value='0'/>
          <enumerator name='same' value='1'/>
          <enumerator name='up' value='2'/>
          <enumerator name='none' value='3'/>
        </enum-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='slicer' type-id='type-id-174' visibility='default' filepath='libnurbs/internals/subdivider.h' line='112' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='8064'>
        <var-decl name='arctessellator' type-id='type-id-162' visibility='default' filepath='libnurbs/internals/subdivider.h' line='113' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='8192'>
        <var-decl name='arcpool' type-id='type-id-74' visibility='default' filepath='libnurbs/internals/subdivider.h' line='114' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='10688'>
        <var-decl name='bezierarcpool' type-id='type-id-74' visibility='default' filepath='libnurbs/internals/subdivider.h' line='115' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='13184'>
        <var-decl name='pwlarcpool' type-id='type-id-74' visibility='default' filepath='libnurbs/internals/subdivider.h' line='116' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='15680'>
        <var-decl name='trimvertexpool' type-id='type-id-75' visibility='default' filepath='libnurbs/internals/subdivider.h' line='117' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18304'>
        <var-decl name='jumpbuffer' type-id='type-id-73' visibility='default' filepath='libnurbs/internals/subdivider.h' line='119' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18368'>
        <var-decl name='renderhints' type-id='type-id-175' visibility='default' filepath='libnurbs/internals/subdivider.h' line='120' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18432'>
        <var-decl name='backend' type-id='type-id-176' visibility='default' filepath='libnurbs/internals/subdivider.h' line='121' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18496'>
        <var-decl name='initialbin' type-id='type-id-166' visibility='default' filepath='libnurbs/internals/subdivider.h' line='123' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18624'>
        <var-decl name='pjarc' type-id='type-id-132' visibility='default' filepath='libnurbs/internals/subdivider.h' line='124' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18688'>
        <var-decl name='s_index' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/subdivider.h' line='125' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18720'>
        <var-decl name='t_index' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/subdivider.h' line='126' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18752'>
        <var-decl name='qlist' type-id='type-id-177' visibility='default' filepath='libnurbs/internals/subdivider.h' line='127' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18816'>
        <var-decl name='spbrkpts' type-id='type-id-169' visibility='default' filepath='libnurbs/internals/subdivider.h' line='128' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='19136'>
        <var-decl name='tpbrkpts' type-id='type-id-169' visibility='default' filepath='libnurbs/internals/subdivider.h' line='129' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='19456'>
        <var-decl name='smbrkpts' type-id='type-id-169' visibility='default' filepath='libnurbs/internals/subdivider.h' line='130' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='19776'>
        <var-decl name='tmbrkpts' type-id='type-id-169' visibility='default' filepath='libnurbs/internals/subdivider.h' line='131' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20096'>
        <var-decl name='stepsizes' type-id='type-id-144' visibility='default' filepath='libnurbs/internals/subdivider.h' line='132' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20224'>
        <var-decl name='showDegenerate' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/subdivider.h' line='133' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20256'>
        <var-decl name='isArcTypeBezier' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/subdivider.h' line='134' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20288'>
        <var-decl name='domain_distance_u_rate' type-id='type-id-1' visibility='default' filepath='libnurbs/internals/subdivider.h' line='188' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20320'>
        <var-decl name='domain_distance_v_rate' type-id='type-id-1' visibility='default' filepath='libnurbs/internals/subdivider.h' line='189' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20352'>
        <var-decl name='is_domain_distance_sampling' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/subdivider.h' line='190' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='Subdivider' filepath='libnurbs/internals/subdivider.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-178' is-artificial='yes'/>
          <parameter type-id='type-id-175'/>
          <parameter type-id='type-id-176'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Subdivider' filepath='libnurbs/internals/subdivider.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-178' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Subdivider' filepath='libnurbs/internals/subdivider.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-178' is-artificial='yes'/>
          <parameter type-id='type-id-175'/>
          <parameter type-id='type-id-176'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Subdivider' filepath='libnurbs/internals/subdivider.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-178' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Subdivider' filepath='libnurbs/internals/subdivider.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-178' is-artificial='yes'/>
          <parameter type-id='type-id-175'/>
          <parameter type-id='type-id-176'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Subdivider' filepath='libnurbs/internals/subdivider.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-178' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Subdivider' filepath='libnurbs/internals/subdivider.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-178' is-artificial='yes'/>
          <parameter type-id='type-id-175'/>
          <parameter type-id='type-id-176'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Subdivider' filepath='libnurbs/internals/subdivider.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-178' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Subdivider' filepath='libnurbs/internals/subdivider.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-178' is-artificial='yes'/>
          <parameter type-id='type-id-175'/>
          <parameter type-id='type-id-176'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Subdivider' filepath='libnurbs/internals/subdivider.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-178' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Subdivider' filepath='libnurbs/internals/subdivider.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-178' is-artificial='yes'/>
          <parameter type-id='type-id-175'/>
          <parameter type-id='type-id-176'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Subdivider' filepath='libnurbs/internals/subdivider.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-178' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Subdivider' filepath='libnurbs/internals/subdivider.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-178' is-artificial='yes'/>
          <parameter type-id='type-id-175'/>
          <parameter type-id='type-id-176'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Subdivider' filepath='libnurbs/internals/subdivider.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-178' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Subdivider' filepath='libnurbs/internals/subdivider.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-178' is-artificial='yes'/>
          <parameter type-id='type-id-175'/>
          <parameter type-id='type-id-176'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Subdivider' filepath='libnurbs/internals/subdivider.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-178' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Subdivider' filepath='libnurbs/internals/subdivider.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-178' is-artificial='yes'/>
          <parameter type-id='type-id-175'/>
          <parameter type-id='type-id-176'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Subdivider' filepath='libnurbs/internals/subdivider.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-178' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Subdivider' filepath='libnurbs/internals/subdivider.cc' line='148' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-179' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-33' name='__in_chrg' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Subdivider' filepath='libnurbs/internals/subdivider.cc' line='148' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-179' name='this' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Subdivider' filepath='libnurbs/internals/subdivider.cc' line='112' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-179' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-175' name='r' filepath='libnurbs/internals/subdivider.cc' line='112' column='1'/>
          <parameter type-id='type-id-176' name='b' filepath='libnurbs/internals/subdivider.cc' line='112' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Subdivider' filepath='libnurbs/internals/subdivider.cc' line='112' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-179' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-175' name='r' filepath='libnurbs/internals/subdivider.cc' line='112' column='1'/>
          <parameter type-id='type-id-176' name='b' filepath='libnurbs/internals/subdivider.cc' line='112' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='JumpBuffer' size-in-bits='1600' is-struct='yes' visibility='default' filepath='libnurbs/internals/mysetjmp.h' line='56' column='1' id='type-id-180'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf' type-id='type-id-181' visibility='default' filepath='libnurbs/internals/mysetjmp.h' line='57' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='TrimVertexPool' size-in-bits='2624' is-struct='yes' visibility='default' filepath='libnurbs/internals/trimvertpool.h' line='45' column='1' id='type-id-75'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='pool' type-id='type-id-74' visibility='default' filepath='libnurbs/internals/trimvertpool.h' line='52' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2496'>
        <var-decl name='vlist' type-id='type-id-182' visibility='default' filepath='libnurbs/internals/trimvertpool.h' line='53' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2560'>
        <var-decl name='nextvlistslot' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/trimvertpool.h' line='54' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2592'>
        <var-decl name='vlistsize' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/trimvertpool.h' line='55' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='TrimVertexPool' filepath='libnurbs/internals/trimvertpool.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-183' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~TrimVertexPool' filepath='libnurbs/internals/trimvertpool.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-183' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='TrimVertexPool' filepath='libnurbs/internals/trimvertpool.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-183' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~TrimVertexPool' filepath='libnurbs/internals/trimvertpool.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-183' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='TrimVertexPool' filepath='libnurbs/internals/trimvertpool.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-183' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~TrimVertexPool' filepath='libnurbs/internals/trimvertpool.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-183' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='__jmp_buf_tag' size-in-bits='1600' is-struct='yes' visibility='default' filepath='/usr/include/setjmp.h' line='36' column='1' id='type-id-148'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__jmpbuf' type-id='type-id-184' visibility='default' filepath='/usr/include/setjmp.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='__mask_was_saved' type-id='type-id-10' visibility='default' filepath='/usr/include/setjmp.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='__saved_mask' type-id='type-id-185' visibility='default' filepath='/usr/include/setjmp.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='jmp_buf' type-id='type-id-149' filepath='/usr/include/setjmp.h' line='49' column='1' id='type-id-181'/>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-186'/>
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-153'/>
    <qualified-type-def type-id='type-id-153' const='yes' id='type-id-155'/>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-157'/>
    <qualified-type-def type-id='type-id-157' const='yes' id='type-id-158'/>
    <pointer-type-def type-id='type-id-159' size-in-bits='64' id='type-id-160'/>
    <qualified-type-def type-id='type-id-160' const='yes' id='type-id-161'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-164'/>
    <reference-type-def kind='lvalue' type-id='type-id-71' size-in-bits='64' id='type-id-176'/>
    <reference-type-def kind='lvalue' type-id='type-id-166' size-in-bits='64' id='type-id-187'/>
    <pointer-type-def type-id='type-id-166' size-in-bits='64' id='type-id-167'/>
    <reference-type-def kind='lvalue' type-id='type-id-188' size-in-bits='64' id='type-id-189'/>
    <pointer-type-def type-id='type-id-169' size-in-bits='64' id='type-id-171'/>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' id='type-id-73'/>
    <reference-type-def kind='lvalue' type-id='type-id-190' size-in-bits='64' id='type-id-191'/>
    <pointer-type-def type-id='type-id-156' size-in-bits='64' id='type-id-192'/>
    <qualified-type-def type-id='type-id-192' const='yes' id='type-id-193'/>
    <reference-type-def kind='lvalue' type-id='type-id-72' size-in-bits='64' id='type-id-154'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-178'/>
    <pointer-type-def type-id='type-id-126' size-in-bits='64' id='type-id-182'/>
    <reference-type-def kind='lvalue' type-id='type-id-75' size-in-bits='64' id='type-id-163'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-183'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-194'/>
    <pointer-type-def type-id='type-id-194' size-in-bits='64' id='type-id-195'/>
    <pointer-type-def type-id='type-id-196' size-in-bits='64' id='type-id-177'/>
    <reference-type-def kind='lvalue' type-id='type-id-197' size-in-bits='64' id='type-id-175'/>
    <class-decl name='FlistSorter' size-in-bits='128' visibility='default' filepath='libnurbs/internals/flistsorter.h' line='42' column='1' id='type-id-170'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-156'/>
      <member-function access='private' constructor='yes'>
        <function-decl name='FlistSorter' filepath='libnurbs/internals/flistsorter.cc' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-198' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='FlistSorter' filepath='libnurbs/internals/flistsorter.cc' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-199' name='this' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='FlistSorter' filepath='libnurbs/internals/flistsorter.cc' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-199' name='this' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <function-decl name='~FlistSorter' filepath='libnurbs/internals/flistsorter.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-198' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='2'>
        <function-decl name='qscmp' mangled-name='_ZN11FlistSorter5qscmpEPcS0_' filepath='libnurbs/internals/flistsorter.cc' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-198' is-artificial='yes'/>
          <parameter type-id='type-id-115'/>
          <parameter type-id='type-id-115'/>
          <return type-id='type-id-10'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='3'>
        <function-decl name='qsexc' mangled-name='_ZN11FlistSorter5qsexcEPcS0_' filepath='libnurbs/internals/flistsorter.cc' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-198' is-artificial='yes'/>
          <parameter type-id='type-id-115'/>
          <parameter type-id='type-id-115'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='4'>
        <function-decl name='qstexc' mangled-name='_ZN11FlistSorter6qstexcEPcS0_S0_' filepath='libnurbs/internals/flistsorter.cc' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-198' is-artificial='yes'/>
          <parameter type-id='type-id-115'/>
          <parameter type-id='type-id-115'/>
          <parameter type-id='type-id-115'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Slicer' size-in-bits='8064' visibility='default' filepath='libnurbs/internals/slicer.h' line='49' column='1' id='type-id-174'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-200'/>
      <base-class access='public' layout-offset-in-bits='128' type-id='type-id-201'/>
      <data-member access='private' layout-offset-in-bits='5248'>
        <var-decl name='backend' type-id='type-id-176' visibility='default' filepath='libnurbs/internals/slicer.h' line='72' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5312'>
        <var-decl name='oneOverDu' type-id='type-id-1' visibility='default' filepath='libnurbs/internals/slicer.h' line='73' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5344'>
        <var-decl name='du' type-id='type-id-1' visibility='default' filepath='libnurbs/internals/slicer.h' line='74' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5376'>
        <var-decl name='dv' type-id='type-id-1' visibility='default' filepath='libnurbs/internals/slicer.h' line='74' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5408'>
        <var-decl name='isolines' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/slicer.h' line='75' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5440'>
        <var-decl name='ulinear' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/slicer.h' line='81' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5472'>
        <var-decl name='vlinear' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/slicer.h' line='82' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='Slicer' filepath='libnurbs/internals/slicer.cc' line='1181' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-202' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <parameter type-id='type-id-203' is-artificial='yes'/>
          <parameter type-id='type-id-176'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Slicer' filepath='libnurbs/internals/slicer.cc' line='1192' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-202' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <parameter type-id='type-id-203' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Slicer' filepath='libnurbs/internals/slicer.cc' line='1192' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-204' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-33' name='__in_chrg' is-artificial='yes'/>
          <parameter type-id='type-id-205' name='__vtt_parm' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Slicer' filepath='libnurbs/internals/slicer.cc' line='1192' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-204' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-205' name='__vtt_parm' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Slicer' filepath='libnurbs/internals/slicer.cc' line='1181' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-204' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-33' name='__in_chrg' is-artificial='yes'/>
          <parameter type-id='type-id-205' name='__vtt_parm' is-artificial='yes'/>
          <parameter type-id='type-id-176' name='b' filepath='libnurbs/internals/slicer.cc' line='1181' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Slicer' filepath='libnurbs/internals/slicer.cc' line='1181' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-204' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-176' name='b' filepath='libnurbs/internals/slicer.cc' line='1181' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Slicer' filepath='libnurbs/internals/slicer.cc' line='1181' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-204' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-205' name='__vtt_parm' is-artificial='yes'/>
          <parameter type-id='type-id-176' name='b' filepath='libnurbs/internals/slicer.cc' line='1181' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Slicer' filepath='libnurbs/internals/slicer.cc' line='1192' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-204' name='this' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Sorter' size-in-bits='128' visibility='default' filepath='libnurbs/internals/sorter.h' line='36' column='1' id='type-id-156'>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='es' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/sorter.h' line='49' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='Sorter' filepath='libnurbs/internals/sorter.cc' line='44' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-192' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Sorter' filepath='libnurbs/internals/sorter.cc' line='44' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-193' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-10' name='_es' filepath='libnurbs/internals/sorter.cc' line='44' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Sorter' filepath='libnurbs/internals/sorter.cc' line='44' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-193' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-10' name='_es' filepath='libnurbs/internals/sorter.cc' line='44' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <function-decl name='~Sorter' filepath='libnurbs/internals/sorter.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-192' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='2'>
        <function-decl name='qscmp' mangled-name='_ZN6Sorter5qscmpEPcS0_' filepath='libnurbs/internals/sorter.cc' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-192' is-artificial='yes'/>
          <parameter type-id='type-id-115'/>
          <parameter type-id='type-id-115'/>
          <return type-id='type-id-10'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='3'>
        <function-decl name='qsexc' mangled-name='_ZN6Sorter5qsexcEPcS0_' filepath='libnurbs/internals/sorter.cc' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-192' is-artificial='yes'/>
          <parameter type-id='type-id-115'/>
          <parameter type-id='type-id-115'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='4'>
        <function-decl name='qstexc' mangled-name='_ZN6Sorter6qstexcEPcS0_S0_' filepath='libnurbs/internals/sorter.cc' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-192' is-artificial='yes'/>
          <parameter type-id='type-id-115'/>
          <parameter type-id='type-id-115'/>
          <parameter type-id='type-id-115'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Backend' size-in-bits='640' visibility='default' filepath='libnurbs/internals/backend.h' line='46' column='1' id='type-id-71'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='curveEvaluator' type-id='type-id-86' visibility='default' filepath='libnurbs/internals/backend.h' line='48' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='surfaceEvaluator' type-id='type-id-87' visibility='default' filepath='libnurbs/internals/backend.h' line='49' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='wireframetris' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/backend.h' line='105' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='160'>
        <var-decl name='wireframequads' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/backend.h' line='106' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='npts' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/backend.h' line='107' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='224'>
        <var-decl name='mesh' type-id='type-id-206' visibility='default' filepath='libnurbs/internals/backend.h' line='108' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='608'>
        <var-decl name='meshindex' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/backend.h' line='109' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='Backend' filepath='libnurbs/internals/backend.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-207' is-artificial='yes'/>
          <parameter type-id='type-id-86'/>
          <parameter type-id='type-id-87'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Backend' filepath='libnurbs/internals/backend.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-207' is-artificial='yes'/>
          <parameter type-id='type-id-86'/>
          <parameter type-id='type-id-87'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Curvelist' size-in-bits='256' visibility='default' filepath='libnurbs/internals/curvelist.h' line='47' column='1' id='type-id-188'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='curve' type-id='type-id-208' visibility='default' filepath='libnurbs/internals/curvelist.h' line='57' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='range' type-id='type-id-209' visibility='default' filepath='libnurbs/internals/curvelist.h' line='58' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='160'>
        <var-decl name='needsSubdivision' type-id='type-id-10' visibility='default' filepath='libnurbs/internals/curvelist.h' line='59' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='stepsize' type-id='type-id-24' visibility='default' filepath='libnurbs/internals/curvelist.h' line='60' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='Curvelist' filepath='libnurbs/internals/curvelist.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-210' is-artificial='yes'/>
          <parameter type-id='type-id-211'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Curvelist' filepath='libnurbs/internals/curvelist.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-210' is-artificial='yes'/>
          <parameter type-id='type-id-189'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Curvelist' filepath='libnurbs/internals/curvelist.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-210' is-artificial='yes'/>
          <parameter type-id='type-id-10' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Curvelist' filepath='libnurbs/internals/curvelist.cc' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-212' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-33' name='__in_chrg' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Curvelist' filepath='libnurbs/internals/curvelist.cc' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-212' name='this' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Curvelist' filepath='libnurbs/internals/curvelist.cc' line='60' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-212' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-189' name='upper' filepath='libnurbs/internals/curvelist.cc' line='60' column='1'/>
          <parameter type-id='type-id-1' name='value' filepath='libnurbs/internals/curvelist.cc' line='60' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Curvelist' filepath='libnurbs/internals/curvelist.cc' line='60' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-212' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-189' name='upper' filepath='libnurbs/internals/curvelist.cc' line='60' column='1'/>
          <parameter type-id='type-id-1' name='value' filepath='libnurbs/internals/curvelist.cc' line='60' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Curvelist' filepath='libnurbs/internals/curvelist.cc' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-212' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-211' name='quilts' filepath='libnurbs/internals/curvelist.cc' line='48' column='1'/>
          <parameter type-id='type-id-1' name='pta' filepath='libnurbs/internals/curvelist.cc' line='48' column='1'/>
          <parameter type-id='type-id-1' name='ptb' filepath='libnurbs/internals/curvelist.cc' line='48' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Curvelist' filepath='libnurbs/internals/curvelist.cc' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
