<abi-corpus version='2.3' soname='libaaudio.so'>
  <elf-needed>
    <dependency name='libaaudio_internal.so'/>
    <dependency name='libaudioclient.so'/>
    <dependency name='libaudioutils.so'/>
    <dependency name='libmedia_helper.so'/>
    <dependency name='libmediametrics.so'/>
    <dependency name='libmediautils.so'/>
    <dependency name='liblog.so'/>
    <dependency name='libcutils.so'/>
    <dependency name='libutils.so'/>
    <dependency name='libbinder.so'/>
    <dependency name='libc++.so'/>
    <dependency name='libc.so'/>
    <dependency name='libm.so'/>
    <dependency name='libdl.so'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='AAudioStreamBuilder_delete' version='LIBAAUDIO' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AAudioStreamBuilder_openStream' version='LIBAAUDIO' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AAudioStreamBuilder_setAllowedCapturePolicy' version='LIBAAUDIO' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AAudioStreamBuilder_setBufferCapacityInFrames' version='LIBAAUDIO' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='AAudioStream_isMMapUsed' version='LIBAAUDIO' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AAudioStream_isPrivacySensitive' version='LIBAAUDIO' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AAudioStream_read' version='LIBAAUDIO' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AAudioStream_release' version='LIBAAUDIO' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AAudioStream_requestFlush' version='LIBAAUDIO' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AAudioStream_requestPause' version='LIBAAUDIO' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AAudioStream_requestStart' version='LIBAAUDIO' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AAudioStream_requestStop' version='LIBAAUDIO' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AAudioStream_setBufferSizeInFrames' version='LIBAAUDIO' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AAudioStream_waitForStateChange' version='LIBAAUDIO' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AAudioStream_write' version='LIBAAUDIO' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AAudio_convertResultToText' version='LIBAAUDIO' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AAudio_convertStreamStateToText' version='LIBAAUDIO' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AAudio_createStreamBuilder' version='LIBAAUDIO' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AAudio_getMMapPolicy' version='LIBAAUDIO' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AAudio_setMMapPolicy' version='LIBAAUDIO' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__cfi_check' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='frameworks/av/media/libaaudio/src/core/AAudioAudio.cpp' language='LANG_C_plus_plus_14'>
    <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' id='7ff19f0f'/>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <type-decl name='double' size-in-bits='64' id='a0eb0f08'/>
    <enum-decl name='audio_format_t' naming-typedef-id='aff86d3f' filepath='system/media/audio/include/system/audio-hal-enums.h' line='610' column='1' id='ff439793'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='AUDIO_FORMAT_DEFAULT' value='0'/>
      <enumerator name='AUDIO_FORMAT_PCM_16_BIT' value='1'/>
      <enumerator name='AUDIO_FORMAT_PCM_8_BIT' value='2'/>
      <enumerator name='AUDIO_FORMAT_PCM_32_BIT' value='3'/>
      <enumerator name='AUDIO_FORMAT_PCM_8_24_BIT' value='4'/>
      <enumerator name='AUDIO_FORMAT_PCM_FLOAT' value='5'/>
      <enumerator name='AUDIO_FORMAT_PCM_24_BIT_PACKED' value='6'/>
      <enumerator name='AUDIO_FORMAT_MP3' value='16777216'/>
      <enumerator name='AUDIO_FORMAT_AMR_NB' value='33554432'/>
      <enumerator name='AUDIO_FORMAT_AMR_WB' value='50331648'/>
      <enumerator name='AUDIO_FORMAT_AAC' value='67108864'/>
      <enumerator name='AUDIO_FORMAT_AAC_MAIN' value='67108865'/>
      <enumerator name='AUDIO_FORMAT_AAC_LC' value='67108866'/>
      <enumerator name='AUDIO_FORMAT_AAC_SSR' value='67108868'/>
      <enumerator name='AUDIO_FORMAT_AAC_LTP' value='67108872'/>
      <enumerator name='AUDIO_FORMAT_AAC_HE_V1' value='67108880'/>
      <enumerator name='AUDIO_FORMAT_AAC_SCALABLE' value='67108896'/>
      <enumerator name='AUDIO_FORMAT_AAC_ERLC' value='67108928'/>
      <enumerator name='AUDIO_FORMAT_AAC_LD' value='67108992'/>
      <enumerator name='AUDIO_FORMAT_AAC_HE_V2' value='67109120'/>
      <enumerator name='AUDIO_FORMAT_AAC_ELD' value='67109376'/>
      <enumerator name='AUDIO_FORMAT_AAC_XHE' value='67109632'/>
      <enumerator name='AUDIO_FORMAT_HE_AAC_V1' value='83886080'/>
      <enumerator name='AUDIO_FORMAT_HE_AAC_V2' value='100663296'/>
      <enumerator name='AUDIO_FORMAT_VORBIS' value='117440512'/>
      <enumerator name='AUDIO_FORMAT_OPUS' value='134217728'/>
      <enumerator name='AUDIO_FORMAT_AC3' value='150994944'/>
      <enumerator name='AUDIO_FORMAT_E_AC3' value='167772160'/>
      <enumerator name='AUDIO_FORMAT_E_AC3_JOC' value='167772161'/>
      <enumerator name='AUDIO_FORMAT_DTS' value='184549376'/>
      <enumerator name='AUDIO_FORMAT_DTS_HD' value='201326592'/>
      <enumerator name='AUDIO_FORMAT_IEC61937' value='218103808'/>
      <enumerator name='AUDIO_FORMAT_DOLBY_TRUEHD' value='234881024'/>
      <enumerator name='AUDIO_FORMAT_EVRC' value='268435456'/>
      <enumerator name='AUDIO_FORMAT_EVRCB' value='285212672'/>
      <enumerator name='AUDIO_FORMAT_EVRCWB' value='301989888'/>
      <enumerator name='AUDIO_FORMAT_EVRCNW' value='318767104'/>
      <enumerator name='AUDIO_FORMAT_AAC_ADIF' value='335544320'/>
      <enumerator name='AUDIO_FORMAT_WMA' value='352321536'/>
      <enumerator name='AUDIO_FORMAT_WMA_PRO' value='369098752'/>
      <enumerator name='AUDIO_FORMAT_AMR_WB_PLUS' value='385875968'/>
      <enumerator name='AUDIO_FORMAT_MP2' value='402653184'/>
      <enumerator name='AUDIO_FORMAT_QCELP' value='419430400'/>
      <enumerator name='AUDIO_FORMAT_DSD' value='436207616'/>
      <enumerator name='AUDIO_FORMAT_FLAC' value='452984832'/>
      <enumerator name='AUDIO_FORMAT_ALAC' value='469762048'/>
      <enumerator name='AUDIO_FORMAT_APE' value='486539264'/>
      <enumerator name='AUDIO_FORMAT_AAC_ADTS' value='503316480'/>
      <enumerator name='AUDIO_FORMAT_AAC_ADTS_MAIN' value='503316481'/>
      <enumerator name='AUDIO_FORMAT_AAC_ADTS_LC' value='503316482'/>
      <enumerator name='AUDIO_FORMAT_AAC_ADTS_SSR' value='503316484'/>
      <enumerator name='AUDIO_FORMAT_AAC_ADTS_LTP' value='503316488'/>
      <enumerator name='AUDIO_FORMAT_AAC_ADTS_HE_V1' value='503316496'/>
      <enumerator name='AUDIO_FORMAT_AAC_ADTS_SCALABLE' value='503316512'/>
      <enumerator name='AUDIO_FORMAT_AAC_ADTS_ERLC' value='503316544'/>
      <enumerator name='AUDIO_FORMAT_AAC_ADTS_LD' value='503316608'/>
      <enumerator name='AUDIO_FORMAT_AAC_ADTS_HE_V2' value='503316736'/>
      <enumerator name='AUDIO_FORMAT_AAC_ADTS_ELD' value='503316992'/>
      <enumerator name='AUDIO_FORMAT_AAC_ADTS_XHE' value='503317248'/>
      <enumerator name='AUDIO_FORMAT_SBC' value='520093696'/>
      <enumerator name='AUDIO_FORMAT_APTX' value='536870912'/>
      <enumerator name='AUDIO_FORMAT_APTX_HD' value='553648128'/>
      <enumerator name='AUDIO_FORMAT_AC4' value='570425344'/>
      <enumerator name='AUDIO_FORMAT_LDAC' value='587202560'/>
      <enumerator name='AUDIO_FORMAT_MAT' value='603979776'/>
      <enumerator name='AUDIO_FORMAT_MAT_1_0' value='603979777'/>
      <enumerator name='AUDIO_FORMAT_MAT_2_0' value='603979778'/>
      <enumerator name='AUDIO_FORMAT_MAT_2_1' value='603979779'/>
      <enumerator name='AUDIO_FORMAT_AAC_LATM' value='620756992'/>
      <enumerator name='AUDIO_FORMAT_AAC_LATM_LC' value='620756994'/>
      <enumerator name='AUDIO_FORMAT_AAC_LATM_HE_V1' value='620757008'/>
      <enumerator name='AUDIO_FORMAT_AAC_LATM_HE_V2' value='620757248'/>
      <enumerator name='AUDIO_FORMAT_CELT' value='637534208'/>
      <enumerator name='AUDIO_FORMAT_APTX_ADAPTIVE' value='654311424'/>
      <enumerator name='AUDIO_FORMAT_LHDC' value='671088640'/>
      <enumerator name='AUDIO_FORMAT_LHDC_LL' value='687865856'/>
      <enumerator name='AUDIO_FORMAT_APTX_TWSP' value='704643072'/>
      <enumerator name='AUDIO_FORMAT_LC3' value='721420288'/>
      <enumerator name='AUDIO_FORMAT_MPEGH' value='738197504'/>
      <enumerator name='AUDIO_FORMAT_MPEGH_BL_L3' value='738197523'/>
      <enumerator name='AUDIO_FORMAT_MPEGH_BL_L4' value='738197524'/>
      <enumerator name='AUDIO_FORMAT_MPEGH_LC_L3' value='738197539'/>
      <enumerator name='AUDIO_FORMAT_MPEGH_LC_L4' value='738197540'/>
      <enumerator name='AUDIO_FORMAT_IEC60958' value='754974720'/>
      <enumerator name='AUDIO_FORMAT_DTS_UHD' value='771751936'/>
      <enumerator name='AUDIO_FORMAT_DRA' value='788529152'/>
      <enumerator name='AUDIO_FORMAT_INVALID' value='4294967295'/>
      <enumerator name='AUDIO_FORMAT_PCM' value='0'/>
    </enum-decl>
    <type-decl name='float' size-in-bits='32' id='a6c45d85'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='long double' size-in-bits='128' id='a0eb0f09'/>
    <type-decl name='long int' size-in-bits='64' id='95e97e5f'/>
    <type-decl name='long long int' size-in-bits='64' id='95e97e60'/>
    <class-decl name='ldiv_t' size-in-bits='128' is-struct='yes' naming-typedef-id='30397bf8' visibility='default' filepath='bionic/libc/include/stdlib.h' line='136' column='1' id='9b5926fd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='95e97e5f' visibility='default' filepath='bionic/libc/include/stdlib.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='95e97e5f' visibility='default' filepath='bionic/libc/include/stdlib.h' line='138' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='lldiv_t' size-in-bits='128' is-struct='yes' naming-typedef-id='f5fa3b34' visibility='default' filepath='bionic/libc/include/stdlib.h' line='143' column='1' id='649cba4b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='95e97e60' visibility='default' filepath='bionic/libc/include/stdlib.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='95e97e60' visibility='default' filepath='bionic/libc/include/stdlib.h' line='145' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='mbstate_t' size-in-bits='64' is-struct='yes' naming-typedef-id='3d7d8cbf' visibility='default' filepath='bionic/libc/include/bits/mbstate_t.h' line='42' column='1' id='a76d8e48'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__seq' type-id='09001d3c' visibility='default' filepath='bionic/libc/include/bits/mbstate_t.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__reserved' type-id='09001d3c' visibility='default' filepath='bionic/libc/include/bits/mbstate_t.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' filepath='bionic/libc/include/time.h' line='46' column='1' id='dddf6ca2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='95e97e5f' visibility='default' filepath='bionic/libc/include/time.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='80f4b756' visibility='default' filepath='bionic/libc/include/time.h' line='57' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='AAudioStream_dataCallback' type-id='824043e8' filepath='frameworks/av/media/libaaudio/include/aaudio/AAudio.h' line='880' column='1' id='edb6186f'/>
    <typedef-decl name='AAudioStream_errorCallback' type-id='00238b2f' filepath='frameworks/av/media/libaaudio/include/aaudio/AAudio.h' line='966' column='1' id='2e91990d'/>
    <typedef-decl name='__builtin_va_list' type-id='30357e0a' id='7f896fb4'/>
    <typedef-decl name='__clockid_t' type-id='7eb128d4' filepath='bionic/libc/include/sys/types.h' line='56' column='1' id='08f9a87a'/>
    <typedef-decl name='__int32_t' type-id='95e97e5e' filepath='bionic/libc/include/stdint.h' line='40' column='1' id='33f57a65'/>
    <typedef-decl name='__int64_t' type-id='95e97e5f' filepath='bionic/libc/include/stdint.h' line='43' column='1' id='0c9942d2'/>
    <typedef-decl name='__kernel_clock_t' type-id='6a11bd61' filepath='bionic/libc/kernel/uapi/asm-generic/posix_types.h' line='80' column='1' id='880ebc01'/>
    <typedef-decl name='__kernel_clockid_t' type-id='95e97e5e' filepath='bionic/libc/kernel/uapi/asm-generic/posix_types.h' line='82' column='1' id='7eb128d4'/>
    <typedef-decl name='__kernel_long_t' type-id='95e97e5f' filepath='bionic/libc/kernel/uapi/asm-generic/posix_types.h' line='23' column='1' id='6a11bd61'/>
    <typedef-decl name='__kernel_time_t' type-id='6a11bd61' filepath='bionic/libc/kernel/uapi/asm-generic/posix_types.h' line='78' column='1' id='f7d92306'/>
    <typedef-decl name='__time_t' type-id='f7d92306' filepath='bionic/libc/include/sys/types.h' line='95' column='1' id='65eda9c0'/>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' filepath='bionic/libc/include/stdint.h' line='41' column='1' id='62f1140c'/>
    <typedef-decl name='aaudio_allowed_capture_policy_t' type-id='3ff5601b' filepath='frameworks/av/media/libaaudio/include/aaudio/AAudio.h' line='457' column='1' id='abe3e34b'/>
    <typedef-decl name='aaudio_content_type_t' type-id='3ff5601b' filepath='frameworks/av/media/libaaudio/include/aaudio/AAudio.h' line='368' column='1' id='2df7abd1'/>
    <typedef-decl name='aaudio_data_callback_result_t' type-id='3ff5601b' filepath='frameworks/av/media/libaaudio/include/aaudio/AAudio.h' line='832' column='1' id='ae10ac8d'/>
    <typedef-decl name='aaudio_direction_t' type-id='3ff5601b' filepath='frameworks/av/media/libaaudio/include/aaudio/AAudio.h' line='60' column='1' id='a5156fbe'/>
    <typedef-decl name='aaudio_format_t' type-id='3ff5601b' filepath='frameworks/av/media/libaaudio/include/aaudio/AAudio.h' line='82' column='1' id='f21c6374'/>
    <typedef-decl name='aaudio_input_preset_t' type-id='3ff5601b' filepath='frameworks/av/media/libaaudio/include/aaudio/AAudio.h' line='415' column='1' id='a4168325'/>
    <typedef-decl name='aaudio_performance_mode_t' type-id='3ff5601b' filepath='frameworks/av/media/libaaudio/include/aaudio/AAudio.h' line='230' column='1' id='6757629b'/>
    <typedef-decl name='aaudio_policy_t' type-id='3ff5601b' filepath='frameworks/av/media/libaaudio/include/aaudio/AAudioTesting.h' line='50' column='1' id='d062bfb5'/>
    <typedef-decl name='aaudio_result_t' type-id='3ff5601b' filepath='frameworks/av/media/libaaudio/include/aaudio/AAudio.h' line='173' column='1' id='da775bc6'/>
    <typedef-decl name='aaudio_session_id_t' type-id='3ff5601b' filepath='frameworks/av/media/libaaudio/include/aaudio/AAudio.h' line='485' column='1' id='4d6761d3'/>
    <typedef-decl name='aaudio_sharing_mode_t' type-id='3ff5601b' filepath='frameworks/av/media/libaaudio/include/aaudio/AAudio.h' line='208' column='1' id='da67c8b9'/>
    <typedef-decl name='aaudio_stream_state_t' type-id='3ff5601b' filepath='frameworks/av/media/libaaudio/include/aaudio/AAudio.h' line='192' column='1' id='2e552d01'/>
    <typedef-decl name='aaudio_usage_t' type-id='3ff5601b' filepath='frameworks/av/media/libaaudio/include/aaudio/AAudio.h' line='330' column='1' id='8ee4dca8'/>
    <typedef-decl name='audio_format_t' type-id='ff439793' filepath='system/media/audio/include/system/audio-hal-enums.h' line='616' column='1' id='aff86d3f'/>
    <typedef-decl name='clock_t' type-id='880ebc01' filepath='bionic/libc/include/sys/types.h' line='54' column='1' id='4c3a2c61'/>
    <typedef-decl name='clockid_t' type-id='08f9a87a' filepath='bionic/libc/include/sys/types.h' line='57' column='1' id='a1c3b834'/>
    <typedef-decl name='fpos_t' type-id='ad707ada' filepath='bionic/libc/include/stdio.h' line='55' column='1' id='e322b6ef'/>
    <typedef-decl name='int32_t' type-id='33f57a65' filepath='bionic/libc/include/stdint.h' line='64' column='1' id='3ff5601b'/>
    <typedef-decl name='int64_t' type-id='0c9942d2' filepath='bionic/libc/include/stdint.h' line='67' column='1' id='9da381c4'/>
    <typedef-decl name='ldiv_t' type-id='9b5926fd' filepath='bionic/libc/include/stdlib.h' line='139' column='1' id='30397bf8'/>
    <typedef-decl name='lldiv_t' type-id='649cba4b' filepath='bionic/libc/include/stdlib.h' line='146' column='1' id='f5fa3b34'/>
    <typedef-decl name='mbstate_t' type-id='a76d8e48' filepath='bionic/libc/include/bits/mbstate_t.h' line='47' column='1' id='3d7d8cbf'/>
    <typedef-decl name='off_t' type-id='9da381c4' filepath='bionic/libc/include/sys/types.h' line='101' column='1' id='ad707ada'/>
    <typedef-decl name='size_t' type-id='f0981eec' filepath='prebuilts/clang/host/linux-x86/clang-r416183b/lib64/clang/12.0.5/include/stddef.h' line='46' column='1' id='b59d7dce'/>
    <typedef-decl name='time_t' type-id='65eda9c0' filepath='bionic/libc/include/sys/types.h' line='96' column='1' id='c9d12d66'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' filepath='bionic/libc/include/stdint.h' line='65' column='1' id='8f92235e'/>
    <typedef-decl name='va_list' type-id='7f896fb4' filepath='prebuilts/clang/host/linux-x86/clang-r416183b/lib64/clang/12.0.5/include/stdarg.h' line='14' column='1' id='2aee9912'/>
    <typedef-decl name='wctype_t' type-id='95e97e5f' filepath='bionic/libc/include/bits/wctype.h' line='56' column='1' id='ba50424d'/>
    <typedef-decl name='wint_t' type-id='f0981eeb' filepath='bionic/libc/include/bits/wctype.h' line='36' column='1' id='6dd37369'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <array-type-def dimensions='1' type-id='002ac4a6' size-in-bits='32' id='09001d3c'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='f0981eec'/>
    <type-decl name='unsigned long long int' size-in-bits='64' id='f0981eed'/>
    <type-decl name='wchar_t' size-in-bits='32' id='c523b9f1'/>
    <pointer-type-def type-id='4ea6ed15' size-in-bits='64' id='824043e8'/>
    <pointer-type-def type-id='2e552d01' size-in-bits='64' id='6de3cf18'/>
    <reference-type-def kind='lvalue' type-id='f74dc428' size-in-bits='64' id='bb997e32'/>
    <reference-type-def kind='rvalue' type-id='f74dc428' size-in-bits='64' id='66a1797c'/>
    <pointer-type-def type-id='f74dc428' size-in-bits='64' id='bf99847e'/>
    <reference-type-def kind='lvalue' type-id='862099c6' size-in-bits='64' id='fe3112c8'/>
    <reference-type-def kind='rvalue' type-id='862099c6' size-in-bits='64' id='1540ccaa'/>
    <pointer-type-def type-id='862099c6' size-in-bits='64' id='fa310c7c'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <pointer-type-def type-id='26a90f95' size-in-bits='64' id='9b23c9ad'/>
    <qualified-type-def type-id='f74dc428' const='yes' id='fd5524d9'/>
    <reference-type-def kind='lvalue' type-id='fd5524d9' size-in-bits='64' id='cc093d6d'/>
    <pointer-type-def type-id='fd5524d9' size-in-bits='64' id='c0092a89'/>
    <qualified-type-def type-id='862099c6' const='yes' id='3d881ff3'/>
    <reference-type-def kind='lvalue' type-id='3d881ff3' size-in-bits='64' id='b24a1c4f'/>
    <pointer-type-def type-id='3d881ff3' size-in-bits='64' id='b64a229b'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <pointer-type-def type-id='80f4b756' size-in-bits='64' id='7d3cd834'/>
    <qualified-type-def type-id='e322b6ef' const='yes' id='59d28eff'/>
    <pointer-type-def type-id='59d28eff' size-in-bits='64' id='3b76d94f'/>
    <qualified-type-def type-id='3d7d8cbf' const='yes' id='7411c98f'/>
    <pointer-type-def type-id='7411c98f' size-in-bits='64' id='5d006ebf'/>
    <qualified-type-def type-id='c9d12d66' const='yes' id='588b3216'/>
    <pointer-type-def type-id='588b3216' size-in-bits='64' id='9f201474'/>
    <qualified-type-def type-id='dddf6ca2' const='yes' id='e824a34f'/>
    <pointer-type-def type-id='e824a34f' size-in-bits='64' id='d6ad37ff'/>
    <qualified-type-def type-id='c523b9f1' const='yes' id='effb3702'/>
    <pointer-type-def type-id='effb3702' size-in-bits='64' id='f077d3f8'/>
    <pointer-type-def type-id='f077d3f8' size-in-bits='64' id='5ea27396'/>
    <pointer-type-def type-id='a6c45d85' size-in-bits='64' id='361f7a7d'/>
    <pointer-type-def type-id='e322b6ef' size-in-bits='64' id='c5f12884'/>
    <pointer-type-def type-id='96ee24a5' size-in-bits='64' id='67230494'/>
    <pointer-type-def type-id='95e97e5e' size-in-bits='64' id='7292109c'/>
    <pointer-type-def type-id='9da381c4' size-in-bits='64' id='cb785ebf'/>
    <pointer-type-def type-id='a0eb0f09' size-in-bits='64' id='7408d286'/>
    <pointer-type-def type-id='3d7d8cbf' size-in-bits='64' id='a68021ce'/>
    <pointer-type-def type-id='c9d12d66' size-in-bits='64' id='b2eb2c3f'/>
    <pointer-type-def type-id='dddf6ca2' size-in-bits='64' id='d915a820'/>
    <pointer-type-def type-id='513cf94a' size-in-bits='64' id='00238b2f'/>
    <pointer-type-def type-id='30a82da4' size-in-bits='64' id='c640490b'/>
    <pointer-type-def type-id='c523b9f1' size-in-bits='64' id='323d93c1'/>
    <pointer-type-def type-id='323d93c1' size-in-bits='64' id='01efdaf1'/>
    <pointer-type-def type-id='f41d1deb' size-in-bits='64' id='b2a1b704'/>
    <pointer-type-def type-id='b2a1b704' size-in-bits='64' id='62935d6a'/>
    <pointer-type-def type-id='122f757a' size-in-bits='64' id='c56f4379'/>
    <pointer-type-def type-id='c56f4379' size-in-bits='64' id='2126fba9'/>
    <pointer-type-def type-id='aa12d1ba' size-in-bits='64' id='822cd80b'/>
    <pointer-type-def type-id='84aa4341' size-in-bits='64' id='3e1b4f89'/>
    <reference-type-def kind='lvalue' type-id='e5af4ed4' size-in-bits='64' id='b8bea77e'/>
    <pointer-type-def type-id='e5af4ed4' size-in-bits='64' id='b4bea132'/>
    <reference-type-def kind='lvalue' type-id='5f3aabfe' size-in-bits='64' id='7f0043f0'/>
    <pointer-type-def type-id='5f3aabfe' size-in-bits='64' id='8b0056d4'/>
    <pointer-type-def type-id='c1fdb0b3' size-in-bits='64' id='b01a1663'/>
    <qualified-type-def type-id='e5af4ed4' const='yes' id='a56b5b8f'/>
    <pointer-type-def type-id='a56b5b8f' size-in-bits='64' id='0d0144bf'/>
    <namespace-decl name='aaudio'>
      <typedef-decl name='aaudio_stream_id_t' type-id='8f92235e' filepath='frameworks/av/media/libaaudio/src/core/AudioStream.h' line='41' column='1' id='68aa1c07'/>
      <class-decl name='AAudioStreamParameters' visibility='default' is-declaration-only='yes' id='84aa4341'/>
      <class-decl name='AudioStream' visibility='default' is-declaration-only='yes' id='e5af4ed4'>
        <member-type access='private'>
          <class-decl name='MyPlayerBase' visibility='default' is-declaration-only='yes' id='5f3aabfe'/>
        </member-type>
      </class-decl>
      <class-decl name='AudioStreamBuilder' visibility='default' is-declaration-only='yes' id='c1fdb0b3'/>
      <function-decl name='AudioGlobal_getMMapPolicy' mangled-name='_ZN6aaudio25AudioGlobal_getMMapPolicyEv' filepath='frameworks/av/media/libaaudio/src/core/AudioGlobal.h' line='25' column='1' visibility='default' binding='global' size-in-bits='64'>
        <return type-id='95e97e5e'/>
      </function-decl>
      <function-decl name='AudioGlobal_setMMapPolicy' mangled-name='_ZN6aaudio25AudioGlobal_setMMapPolicyEi' filepath='frameworks/av/media/libaaudio/src/core/AudioGlobal.h' line='26' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='95e97e5e'/>
        <return type-id='95e97e5e'/>
      </function-decl>
      <function-decl name='AudioGlobal_convertResultToText' mangled-name='_ZN6aaudio31AudioGlobal_convertResultToTextEi' filepath='frameworks/av/media/libaaudio/src/core/AudioGlobal.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='95e97e5e'/>
        <return type-id='80f4b756'/>
      </function-decl>
      <function-decl name='AudioGlobal_convertStreamStateToText' mangled-name='_ZN6aaudio36AudioGlobal_convertStreamStateToTextEi' filepath='frameworks/av/media/libaaudio/src/core/AudioGlobal.h' line='33' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='95e97e5e'/>
        <return type-id='80f4b756'/>
      </function-decl>
    </namespace-decl>
    <namespace-decl name='android'>
      <class-decl name='sp&lt;aaudio::AudioStream::MyPlayerBase&gt;' size-in-bits='64' visibility='default' filepath='system/core/libutils/include/utils/StrongPointer.h' line='31' column='1' id='f74dc428'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='8b0056d4' visibility='default' filepath='system/core/libutils/include/utils/StrongPointer.h' line='124' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='sp&lt;aaudio::AudioStream&gt;' size-in-bits='64' visibility='default' filepath='system/core/libutils/include/utils/StrongPointer.h' line='31' column='1' id='862099c6'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='b4bea132' visibility='default' filepath='system/core/libutils/include/utils/StrongPointer.h' line='124' column='1'/>
        </data-member>
      </class-decl>
      <function-decl name='sp_report_stack_pointer' mangled-name='_ZN7android23sp_report_stack_pointerEv' filepath='system/core/libutils/include/utils/StrongPointer.h' line='188' column='1' visibility='default' binding='global' size-in-bits='64'>
        <return type-id='48b5725f'/>
      </function-decl>
    </namespace-decl>
    <namespace-decl name='std'>
      <class-decl name='__va_list' size-in-bits='256' is-struct='yes' visibility='default' id='30357e0a'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='__stack' type-id='eaa32e2f' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='__gr_top' type-id='eaa32e2f' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='__vr_top' type-id='eaa32e2f' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='__gr_offs' type-id='95e97e5e' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='224'>
          <var-decl name='__vr_offs' type-id='95e97e5e' visibility='default'/>
        </data-member>
      </class-decl>
    </namespace-decl>
    <class-decl name='AAudioStreamBuilderStruct' is-struct='yes' visibility='default' is-declaration-only='yes' id='813682d4'/>
    <class-decl name='AAudioStreamStruct' is-struct='yes' visibility='default' is-declaration-only='yes' id='119dbfcb'/>
    <class-decl name='__sFILE' is-struct='yes' visibility='default' is-declaration-only='yes' id='8d7b2c1e'/>
    <typedef-decl name='wctrans_t' type-id='eaa32e2f' filepath='bionic/libc/include/bits/wctype.h' line='60' column='1' id='183c72c3'/>
    <typedef-decl name='FILE' type-id='8d7b2c1e' filepath='bionic/libc/include/stdio.h' line='59' column='1' id='aa12d1ba'/>
    <function-decl name='abort' filepath='bionic/libc/include/stdlib.h' line='44' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='48b5725f'/>
    </function-decl>
    <typedef-decl name='AAudioStream' type-id='119dbfcb' filepath='frameworks/av/media/libaaudio/include/aaudio/AAudio.h' line='487' column='1' id='f41d1deb'/>
    <typedef-decl name='AAudioStreamBuilder' type-id='813682d4' filepath='frameworks/av/media/libaaudio/include/aaudio/AAudio.h' line='488' column='1' id='122f757a'/>
    <function-decl name='AAudio_convertResultToText' mangled-name='AAudio_convertResultToText' filepath='frameworks/av/media/libaaudio/src/core/AAudioAudio.cpp' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='AAudio_convertResultToText@@LIBAAUDIO'>
      <parameter type-id='da775bc6' name='returnCode' filepath='frameworks/av/media/libaaudio/src/core/AAudioAudio.cpp' line='48' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='AAudio_convertStreamStateToText' mangled-name='AAudio_convertStreamStateToText' filepath='frameworks/av/media/libaaudio/src/core/AAudioAudio.cpp' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='AAudio_convertStreamStateToText@@LIBAAUDIO'>
      <parameter type-id='2e552d01' name='state' filepath='frameworks/av/media/libaaudio/src/core/AAudioAudio.cpp' line='52' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='AAudio_createStreamBuilder' mangled-name='AAudio_createStreamBuilder' filepath='frameworks/av/media/libaaudio/src/core/AAudioAudio.cpp' line='66' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='AAudio_createStreamBuilder@@LIBAAUDIO'>
      <parameter type-id='2126fba9' name='builder' filepath='frameworks/av/media/libaaudio/src/core/AAudioAudio.cpp' line='66' column='1'/>
      <return type-id='da775bc6'/>
    </function-decl>
    <function-decl name='AAudioStreamBuilder_setPerformanceMode' mangled-name='AAudioStreamBuilder_setPerformanceMode' filepath='frameworks/av/media/libaaudio/src/core/AAudioAudio.cpp' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='AAudioStreamBuilder_setPerformanceMode@@LIBAAUDIO'>
      <parameter type-id='c56f4379' name='builder' filepath='frameworks/av/media/libaaudio/src/core/AAudioAudio.cpp' line='76' column='1'/>
      <parameter type-id='6757629b' name='mode' filepath='frameworks/av/media/libaaudio/src/core/AAudioAudio.cpp' line='77' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AAudioStreamBuilder_setDeviceId' mangled-name='AAudioStreamBuilder_setDeviceId' filepath='frameworks/av/media/libaaudio/src/core/AAudioAudio.cpp' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='AAudioStreamBuilder_setDeviceId@@LIBAAUDIO'>
      <parameter type-id='c56f4379' name='builder' filepath='frameworks/av/media/libaaudio/src/core/AAudioAudio.cpp' line='83' column='1'/>
