<abi-corpus version='2.3' soname='libharfbuzz.so.0'>
  <elf-needed>
    <dependency name='libglib-2.0.so.0'/>
    <dependency name='libfreetype.so.6'/>
    <dependency name='libpng16.so.16'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='librt.so.1'/>
    <dependency name='libbz2.so.1'/>
    <dependency name='libz.so.1'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_blob_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_blob_create_sub_blob' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_blob_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_blob_get_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_blob_get_data_writable' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='hb_tag_from_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_tag_to_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_combining_class' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_compose' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_decompose' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_decompose_compatibility' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_eastasian_width' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_get_default' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_get_empty' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_get_parent' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_get_user_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_is_immutable' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_make_immutable' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_reference' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_combining_class_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_compose_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_decompose_compatibility_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_decompose_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_eastasian_width_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_general_category_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_mirroring_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_script_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_user_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_general_category' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_mirroring' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_script' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_version' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_version_atleast' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_version_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='hb-blob.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <type-decl name='bool' size-in-bits='8' id='type-id-1'/>
    <type-decl name='char' size-in-bits='8' id='type-id-2'/>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='320' id='type-id-3'>
      <subrange length='40' lower-bound='0' upper-bound='39' type-id='type-id-4' id='type-id-5'/>
    </array-type-def>
    <enum-decl name='hb_memory_mode_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.h' line='58' column='1' id='type-id-6'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='HB_MEMORY_MODE_DUPLICATE' value='0'/>
      <enumerator name='HB_MEMORY_MODE_READONLY' value='1'/>
      <enumerator name='HB_MEMORY_MODE_WRITABLE' value='2'/>
      <enumerator name='HB_MEMORY_MODE_READONLY_MAY_MAKE_WRITABLE' value='3'/>
    </enum-decl>
    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='384' id='type-id-9'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-4' id='type-id-10'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' id='type-id-11'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-12'/>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='62' column='1' id='type-id-13'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-14' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-14' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='64' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hb_blob_t' size-in-bits='1216' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='53' column='1' id='type-id-15'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-16' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='immutable' type-id='type-id-1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='data' type-id='type-id-17' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='length' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='mode' type-id='type-id-6' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='user_data' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='destroy' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='64' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hb_lockable_set_t&lt;hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t&gt;' size-in-bits='512' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='449' column='1' id='type-id-21'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='items' type-id='type-id-22' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='450' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hb_mutex_t' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='117' column='1' id='type-id-23'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m' type-id='type-id-24' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='120' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hb_object_header_t' size-in-bits='896' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='101' column='1' id='type-id-16'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ref_count' type-id='type-id-25' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='user_data' type-id='type-id-26' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='103' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hb_prealloced_array_t&lt;hb_user_data_array_t::hb_user_data_item_t, 2u&gt;' size-in-bits='512' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='329' column='1' id='type-id-22'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='len' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='allocated' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='array' type-id='type-id-27' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='static_array' type-id='type-id-9' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='333' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hb_reference_count_t' size-in-bits='32' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='53' column='1' id='type-id-25'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ref_count' type-id='type-id-28' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='54' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hb_user_data_array_t' size-in-bits='832' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='70' column='1' id='type-id-26'>
      <member-type access='public'>
        <class-decl name='hb_user_data_item_t' size-in-bits='192' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='71' column='1' id='type-id-8'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='key' type-id='type-id-29' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='72' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='data' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='73' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='destroy' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='74' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lock' type-id='type-id-23' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='items' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='83' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hb_user_data_key_t' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='334' column='1' id='type-id-30'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='unused' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='336' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pthread_list_t' type-id='type-id-13' filepath='/usr/include/bits/pthreadtypes.h' line='65' column='1' id='type-id-31'/>
    <typedef-decl name='hb_atomic_int_t' type-id='type-id-11' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-atomic-private.hh' line='94' column='1' id='type-id-28'/>
    <typedef-decl name='hb_blob_t' type-id='type-id-15' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.h' line='65' column='1' id='type-id-32'/>
    <typedef-decl name='hb_bool_t' type-id='type-id-11' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='73' column='1' id='type-id-33'/>
    <typedef-decl name='hb_destroy_func_t' type-id='type-id-34' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='339' column='1' id='type-id-20'/>
    <typedef-decl name='hb_mutex_impl_t' type-id='type-id-35' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='59' column='1' id='type-id-24'/>
    <typedef-decl name='hb_user_data_key_t' type-id='type-id-30' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='337' column='1' id='type-id-36'/>
    <union-decl name='pthread_mutex_t' size-in-bits='320' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='77' column='1' id='type-id-35'>
      <member-type access='public'>
        <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='79' column='1' id='type-id-37'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='__lock' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='32'>
            <var-decl name='__count' type-id='type-id-18' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='81' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='__owner' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='82' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='96'>
            <var-decl name='__nusers' type-id='type-id-18' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='84' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='__kind' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='88' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='160'>
            <var-decl name='__spins' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='90' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='__list' type-id='type-id-31' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='91' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public'>
        <var-decl name='__data' type-id='type-id-37' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='101' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-3' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='102' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-12' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='103' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-7'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-18'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-4'/>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-14'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-38'/>
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-39'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-17'/>
    <qualified-type-def type-id='type-id-15' const='yes' id='type-id-40'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-41'/>
    <qualified-type-def type-id='type-id-16' const='yes' id='type-id-42'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-43'/>
    <qualified-type-def type-id='type-id-22' const='yes' id='type-id-44'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-45'/>
    <qualified-type-def type-id='type-id-25' const='yes' id='type-id-46'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-47'/>
    <qualified-type-def type-id='type-id-47' const='yes' id='type-id-48'/>
    <qualified-type-def type-id='type-id-8' const='yes' id='type-id-49'/>
    <reference-type-def kind='lvalue' type-id='type-id-49' size-in-bits='64' id='type-id-50'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-51'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-52'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-53'/>
    <qualified-type-def type-id='type-id-53' const='yes' id='type-id-54'/>
    <reference-type-def kind='lvalue' type-id='type-id-23' size-in-bits='64' id='type-id-55'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-56'/>
    <qualified-type-def type-id='type-id-56' const='yes' id='type-id-57'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-58'/>
    <qualified-type-def type-id='type-id-58' const='yes' id='type-id-59'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-60'/>
    <qualified-type-def type-id='type-id-60' const='yes' id='type-id-61'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-62'/>
    <qualified-type-def type-id='type-id-62' const='yes' id='type-id-63'/>
    <reference-type-def kind='lvalue' type-id='type-id-8' size-in-bits='64' id='type-id-64'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-27'/>
    <qualified-type-def type-id='type-id-27' const='yes' id='type-id-65'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-29'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-66'/>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-34'/>
    <function-decl name='hb_blob_create' mangled-name='hb_blob_create' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_create'>
      <parameter type-id='type-id-17' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='97' column='1'/>
      <parameter type-id='type-id-18' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='98' column='1'/>
      <parameter type-id='type-id-6' name='mode' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='99' column='1'/>
      <parameter type-id='type-id-19' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='100' column='1'/>
      <parameter type-id='type-id-20' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='101' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='hb_blob_create_sub_blob' mangled-name='hb_blob_create_sub_blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_create_sub_blob'>
      <parameter type-id='type-id-52' name='parent' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='150' column='1'/>
      <parameter type-id='type-id-18' name='offset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='151' column='1'/>
      <parameter type-id='type-id-18' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='152' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='hb_blob_get_empty' mangled-name='hb_blob_get_empty' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='182' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_empty'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='hb_blob_reference' mangled-name='hb_blob_reference' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='213' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_reference'>
      <parameter type-id='type-id-52' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='213' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='hb_blob_destroy' mangled-name='hb_blob_destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_destroy'>
      <parameter type-id='type-id-52' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='231' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_blob_set_user_data' mangled-name='hb_blob_set_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_set_user_data'>
      <parameter type-id='type-id-52' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='253' column='1'/>
      <parameter type-id='type-id-29' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='254' column='1'/>
      <parameter type-id='type-id-19' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='255' column='1'/>
      <parameter type-id='type-id-20' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='256' column='1'/>
      <parameter type-id='type-id-33' name='replace' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='257' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='hb_blob_get_user_data' mangled-name='hb_blob_get_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_user_data'>
      <parameter type-id='type-id-52' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='274' column='1'/>
      <parameter type-id='type-id-29' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='275' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='hb_blob_make_immutable' mangled-name='hb_blob_make_immutable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='290' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_make_immutable'>
      <parameter type-id='type-id-52' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='290' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_blob_is_immutable' mangled-name='hb_blob_is_immutable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_is_immutable'>
      <parameter type-id='type-id-52' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='309' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='hb_blob_get_length' mangled-name='hb_blob_get_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_length'>
      <parameter type-id='type-id-52' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='326' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='hb_blob_get_data' mangled-name='hb_blob_get_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='343' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_data'>
      <parameter type-id='type-id-52' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='343' column='1'/>
      <parameter type-id='type-id-66' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='343' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='hb_blob_get_data_writable' mangled-name='hb_blob_get_data_writable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='368' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_data_writable'>
      <parameter type-id='type-id-52' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='368' column='1'/>
      <parameter type-id='type-id-66' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='368' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <type-decl name='void' id='type-id-68'/>
    <pointer-type-def type-id='type-id-68' id='type-id-19'/>
    <function-type size-in-bits='64' id='type-id-67'>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-68'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='hb-buffer-serialize.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-17' size-in-bits='512' id='type-id-69'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-4' id='type-id-70'/>
    </array-type-def>
    <enum-decl name='hb_buffer_content_type_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='119' column='1' id='type-id-71'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='HB_BUFFER_CONTENT_TYPE_INVALID' value='0'/>
      <enumerator name='HB_BUFFER_CONTENT_TYPE_UNICODE' value='1'/>
      <enumerator name='HB_BUFFER_CONTENT_TYPE_GLYPHS' value='2'/>
    </enum-decl>
    <enum-decl name='hb_buffer_flags_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='174' column='1' id='type-id-72'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='HB_BUFFER_FLAG_DEFAULT' value='0'/>
      <enumerator name='HB_BUFFER_FLAG_BOT' value='1'/>
      <enumerator name='HB_BUFFER_FLAG_EOT' value='2'/>
      <enumerator name='HB_BUFFER_FLAG_PRESERVE_DEFAULT_IGNORABLES' value='4'/>
    </enum-decl>
    <enum-decl name='hb_buffer_serialize_flags_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='298' column='1' id='type-id-73'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FLAG_DEFAULT' value='0'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FLAG_NO_CLUSTERS' value='1'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FLAG_NO_POSITIONS' value='2'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FLAG_NO_GLYPH_NAMES' value='4'/>
    </enum-decl>
    <enum-decl name='hb_buffer_serialize_format_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='305' column='1' id='type-id-74'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FORMAT_TEXT' value='1413830740'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FORMAT_JSON' value='1246973774'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FORMAT_INVALID' value='0'/>
    </enum-decl>
    <enum-decl name='hb_direction_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='111' column='1' id='type-id-75'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='HB_DIRECTION_INVALID' value='0'/>
      <enumerator name='HB_DIRECTION_LTR' value='4'/>
      <enumerator name='HB_DIRECTION_RTL' value='5'/>
      <enumerator name='HB_DIRECTION_TTB' value='6'/>
      <enumerator name='HB_DIRECTION_BTT' value='7'/>
    </enum-decl>
    <enum-decl name='hb_script_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='157' column='1' id='type-id-76'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='HB_SCRIPT_COMMON' value='1517910393'/>
      <enumerator name='HB_SCRIPT_INHERITED' value='1516858984'/>
      <enumerator name='HB_SCRIPT_UNKNOWN' value='1517976186'/>
      <enumerator name='HB_SCRIPT_ARABIC' value='1098015074'/>
      <enumerator name='HB_SCRIPT_ARMENIAN' value='1098018158'/>
      <enumerator name='HB_SCRIPT_BENGALI' value='1113943655'/>
      <enumerator name='HB_SCRIPT_CYRILLIC' value='1132032620'/>
      <enumerator name='HB_SCRIPT_DEVANAGARI' value='1147500129'/>
      <enumerator name='HB_SCRIPT_GEORGIAN' value='1197830002'/>
      <enumerator name='HB_SCRIPT_GREEK' value='1198679403'/>
      <enumerator name='HB_SCRIPT_GUJARATI' value='1198877298'/>
      <enumerator name='HB_SCRIPT_GURMUKHI' value='1198879349'/>
      <enumerator name='HB_SCRIPT_HANGUL' value='1214344807'/>
      <enumerator name='HB_SCRIPT_HAN' value='1214344809'/>
      <enumerator name='HB_SCRIPT_HEBREW' value='1214603890'/>
      <enumerator name='HB_SCRIPT_HIRAGANA' value='1214870113'/>
      <enumerator name='HB_SCRIPT_KANNADA' value='1265525857'/>
      <enumerator name='HB_SCRIPT_KATAKANA' value='1264676449'/>
      <enumerator name='HB_SCRIPT_LAO' value='1281453935'/>
      <enumerator name='HB_SCRIPT_LATIN' value='1281455214'/>
      <enumerator name='HB_SCRIPT_MALAYALAM' value='1298954605'/>
      <enumerator name='HB_SCRIPT_ORIYA' value='1332902241'/>
      <enumerator name='HB_SCRIPT_TAMIL' value='1415671148'/>
      <enumerator name='HB_SCRIPT_TELUGU' value='1415933045'/>
      <enumerator name='HB_SCRIPT_THAI' value='1416126825'/>
      <enumerator name='HB_SCRIPT_TIBETAN' value='1416192628'/>
      <enumerator name='HB_SCRIPT_BOPOMOFO' value='1114599535'/>
      <enumerator name='HB_SCRIPT_BRAILLE' value='1114792297'/>
      <enumerator name='HB_SCRIPT_CANADIAN_SYLLABICS' value='1130458739'/>
      <enumerator name='HB_SCRIPT_CHEROKEE' value='1130915186'/>
      <enumerator name='HB_SCRIPT_ETHIOPIC' value='1165256809'/>
      <enumerator name='HB_SCRIPT_KHMER' value='1265134962'/>
      <enumerator name='HB_SCRIPT_MONGOLIAN' value='1299148391'/>
      <enumerator name='HB_SCRIPT_MYANMAR' value='1299803506'/>
      <enumerator name='HB_SCRIPT_OGHAM' value='1332175213'/>
      <enumerator name='HB_SCRIPT_RUNIC' value='1383427698'/>
      <enumerator name='HB_SCRIPT_SINHALA' value='1399418472'/>
      <enumerator name='HB_SCRIPT_SYRIAC' value='1400468067'/>
      <enumerator name='HB_SCRIPT_THAANA' value='1416126817'/>
      <enumerator name='HB_SCRIPT_YI' value='1500080489'/>
      <enumerator name='HB_SCRIPT_DESERET' value='1148416628'/>
      <enumerator name='HB_SCRIPT_GOTHIC' value='1198486632'/>
      <enumerator name='HB_SCRIPT_OLD_ITALIC' value='1232363884'/>
      <enumerator name='HB_SCRIPT_BUHID' value='1114990692'/>
      <enumerator name='HB_SCRIPT_HANUNOO' value='1214344815'/>
      <enumerator name='HB_SCRIPT_TAGALOG' value='1416064103'/>
      <enumerator name='HB_SCRIPT_TAGBANWA' value='1415669602'/>
      <enumerator name='HB_SCRIPT_CYPRIOT' value='1131442804'/>
      <enumerator name='HB_SCRIPT_LIMBU' value='1281977698'/>
      <enumerator name='HB_SCRIPT_LINEAR_B' value='1281977954'/>
      <enumerator name='HB_SCRIPT_OSMANYA' value='1332964705'/>
      <enumerator name='HB_SCRIPT_SHAVIAN' value='1399349623'/>
      <enumerator name='HB_SCRIPT_TAI_LE' value='1415670885'/>
      <enumerator name='HB_SCRIPT_UGARITIC' value='1432838514'/>
      <enumerator name='HB_SCRIPT_BUGINESE' value='1114990441'/>
      <enumerator name='HB_SCRIPT_COPTIC' value='1131376756'/>
      <enumerator name='HB_SCRIPT_GLAGOLITIC' value='1198285159'/>
      <enumerator name='HB_SCRIPT_KHAROSHTHI' value='1265131890'/>
      <enumerator name='HB_SCRIPT_NEW_TAI_LUE' value='1415670901'/>
      <enumerator name='HB_SCRIPT_OLD_PERSIAN' value='1483761007'/>
      <enumerator name='HB_SCRIPT_SYLOTI_NAGRI' value='1400466543'/>
      <enumerator name='HB_SCRIPT_TIFINAGH' value='1415999079'/>
      <enumerator name='HB_SCRIPT_BALINESE' value='1113681001'/>
      <enumerator name='HB_SCRIPT_CUNEIFORM' value='1483961720'/>
      <enumerator name='HB_SCRIPT_NKO' value='1315663727'/>
      <enumerator name='HB_SCRIPT_PHAGS_PA' value='1349017959'/>
      <enumerator name='HB_SCRIPT_PHOENICIAN' value='1349021304'/>
      <enumerator name='HB_SCRIPT_CARIAN' value='1130459753'/>
      <enumerator name='HB_SCRIPT_CHAM' value='1130914157'/>
      <enumerator name='HB_SCRIPT_KAYAH_LI' value='1264675945'/>
      <enumerator name='HB_SCRIPT_LEPCHA' value='1281716323'/>
      <enumerator name='HB_SCRIPT_LYCIAN' value='1283023721'/>
      <enumerator name='HB_SCRIPT_LYDIAN' value='1283023977'/>
      <enumerator name='HB_SCRIPT_OL_CHIKI' value='1332503403'/>
      <enumerator name='HB_SCRIPT_REJANG' value='1382706791'/>
      <enumerator name='HB_SCRIPT_SAURASHTRA' value='1398895986'/>
      <enumerator name='HB_SCRIPT_SUNDANESE' value='1400204900'/>
      <enumerator name='HB_SCRIPT_VAI' value='1449224553'/>
      <enumerator name='HB_SCRIPT_AVESTAN' value='1098281844'/>
      <enumerator name='HB_SCRIPT_BAMUM' value='1113681269'/>
      <enumerator name='HB_SCRIPT_EGYPTIAN_HIEROGLYPHS' value='1164409200'/>
      <enumerator name='HB_SCRIPT_IMPERIAL_ARAMAIC' value='1098018153'/>
      <enumerator name='HB_SCRIPT_INSCRIPTIONAL_PAHLAVI' value='1349020777'/>
      <enumerator name='HB_SCRIPT_INSCRIPTIONAL_PARTHIAN' value='1349678185'/>
      <enumerator name='HB_SCRIPT_JAVANESE' value='1247901281'/>
      <enumerator name='HB_SCRIPT_KAITHI' value='1265920105'/>
      <enumerator name='HB_SCRIPT_LISU' value='1281979253'/>
      <enumerator name='HB_SCRIPT_MEETEI_MAYEK' value='1299473769'/>
      <enumerator name='HB_SCRIPT_OLD_SOUTH_ARABIAN' value='1398895202'/>
      <enumerator name='HB_SCRIPT_OLD_TURKIC' value='1332898664'/>
      <enumerator name='HB_SCRIPT_SAMARITAN' value='1398893938'/>
      <enumerator name='HB_SCRIPT_TAI_THAM' value='1281453665'/>
      <enumerator name='HB_SCRIPT_TAI_VIET' value='1415673460'/>
      <enumerator name='HB_SCRIPT_BATAK' value='1113683051'/>
      <enumerator name='HB_SCRIPT_BRAHMI' value='1114792296'/>
      <enumerator name='HB_SCRIPT_MANDAIC' value='1298230884'/>
      <enumerator name='HB_SCRIPT_CHAKMA' value='1130457965'/>
      <enumerator name='HB_SCRIPT_MEROITIC_CURSIVE' value='1298494051'/>
      <enumerator name='HB_SCRIPT_MEROITIC_HIEROGLYPHS' value='1298494063'/>
      <enumerator name='HB_SCRIPT_MIAO' value='1349284452'/>
      <enumerator name='HB_SCRIPT_SHARADA' value='1399353956'/>
      <enumerator name='HB_SCRIPT_SORA_SOMPENG' value='1399812705'/>
      <enumerator name='HB_SCRIPT_TAKRI' value='1415670642'/>
      <enumerator name='HB_SCRIPT_BASSA_VAH' value='1113682803'/>
      <enumerator name='HB_SCRIPT_CAUCASIAN_ALBANIAN' value='1097295970'/>
      <enumerator name='HB_SCRIPT_DUPLOYAN' value='1148547180'/>
      <enumerator name='HB_SCRIPT_ELBASAN' value='1164730977'/>
      <enumerator name='HB_SCRIPT_GRANTHA' value='1198678382'/>
      <enumerator name='HB_SCRIPT_KHOJKI' value='1265135466'/>
      <enumerator name='HB_SCRIPT_KHUDAWADI' value='1399418468'/>
      <enumerator name='HB_SCRIPT_LINEAR_A' value='1281977953'/>
      <enumerator name='HB_SCRIPT_MAHAJANI' value='1298229354'/>
      <enumerator name='HB_SCRIPT_MANICHAEAN' value='1298230889'/>
      <enumerator name='HB_SCRIPT_MENDE_KIKAKUI' value='1298493028'/>
      <enumerator name='HB_SCRIPT_MODI' value='1299145833'/>
      <enumerator name='HB_SCRIPT_MRO' value='1299345263'/>
      <enumerator name='HB_SCRIPT_NABATAEAN' value='1315070324'/>
      <enumerator name='HB_SCRIPT_OLD_NORTH_ARABIAN' value='1315009122'/>
      <enumerator name='HB_SCRIPT_OLD_PERMIC' value='1348825709'/>
      <enumerator name='HB_SCRIPT_PAHAWH_HMONG' value='1215131239'/>
      <enumerator name='HB_SCRIPT_PALMYRENE' value='1348562029'/>
      <enumerator name='HB_SCRIPT_PAU_CIN_HAU' value='1348564323'/>
      <enumerator name='HB_SCRIPT_PSALTER_PAHLAVI' value='1349020784'/>
      <enumerator name='HB_SCRIPT_SIDDHAM' value='1399415908'/>
      <enumerator name='HB_SCRIPT_TIRHUTA' value='1416196712'/>
      <enumerator name='HB_SCRIPT_WARANG_CITI' value='1466004065'/>
      <enumerator name='HB_SCRIPT_INVALID' value='0'/>
      <enumerator name='_HB_SCRIPT_MAX_VALUE' value='4294967295'/>
      <enumerator name='_HB_SCRIPT_MAX_VALUE_SIGNED' value='2147483647'/>
    </enum-decl>
    <enum-decl name='hb_unicode_combining_class_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='87' column='1' id='type-id-77'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_NOT_REORDERED' value='0'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_OVERLAY' value='1'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_NUKTA' value='7'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_KANA_VOICING' value='8'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_VIRAMA' value='9'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC10' value='10'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC11' value='11'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC12' value='12'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC13' value='13'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC14' value='14'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC15' value='15'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC16' value='16'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC17' value='17'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC18' value='18'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC19' value='19'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC20' value='20'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC21' value='21'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC22' value='22'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC23' value='23'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC24' value='24'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC25' value='25'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC26' value='26'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC27' value='27'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC28' value='28'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC29' value='29'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC30' value='30'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC31' value='31'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC32' value='32'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC33' value='33'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC34' value='34'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC35' value='35'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC36' value='36'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC84' value='84'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC91' value='91'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC103' value='103'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC107' value='107'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC118' value='118'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC122' value='122'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC129' value='129'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC130' value='130'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC133' value='132'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ATTACHED_BELOW_LEFT' value='200'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ATTACHED_BELOW' value='202'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ATTACHED_ABOVE' value='214'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ATTACHED_ABOVE_RIGHT' value='216'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_BELOW_LEFT' value='218'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_BELOW' value='220'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_BELOW_RIGHT' value='222'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_LEFT' value='224'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_RIGHT' value='226'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ABOVE_LEFT' value='228'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ABOVE' value='230'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ABOVE_RIGHT' value='232'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_DOUBLE_BELOW' value='233'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_DOUBLE_ABOVE' value='234'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_IOTA_SUBSCRIPT' value='240'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_INVALID' value='255'/>
    </enum-decl>
    <enum-decl name='hb_unicode_general_category_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='46' column='1' id='type-id-78'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_CONTROL' value='0'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_FORMAT' value='1'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_UNASSIGNED' value='2'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_PRIVATE_USE' value='3'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_SURROGATE' value='4'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_LOWERCASE_LETTER' value='5'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_MODIFIER_LETTER' value='6'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OTHER_LETTER' value='7'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_TITLECASE_LETTER' value='8'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_UPPERCASE_LETTER' value='9'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_SPACING_MARK' value='10'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_ENCLOSING_MARK' value='11'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_NON_SPACING_MARK' value='12'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_DECIMAL_NUMBER' value='13'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_LETTER_NUMBER' value='14'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OTHER_NUMBER' value='15'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_CONNECT_PUNCTUATION' value='16'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_DASH_PUNCTUATION' value='17'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_CLOSE_PUNCTUATION' value='18'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_FINAL_PUNCTUATION' value='19'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_INITIAL_PUNCTUATION' value='20'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OTHER_PUNCTUATION' value='21'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OPEN_PUNCTUATION' value='22'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_CURRENCY_SYMBOL' value='23'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_MODIFIER_SYMBOL' value='24'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_MATH_SYMBOL' value='25'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OTHER_SYMBOL' value='26'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_LINE_SEPARATOR' value='27'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_PARAGRAPH_SEPARATOR' value='28'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_SPACE_SEPARATOR' value='29'/>
    </enum-decl>
    <array-type-def dimensions='2' type-id='type-id-79' size-in-bits='320' id='type-id-80'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-4' id='type-id-10'/>
      <subrange length='5' lower-bound='0' upper-bound='4' type-id='type-id-4' id='type-id-81'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-82' size-in-bits='32' id='type-id-83'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-4' id='type-id-10'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-84' size-in-bits='32' id='type-id-85'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-4' id='type-id-86'/>
    </array-type-def>
    <type-decl name='short int' size-in-bits='16' id='type-id-87'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-88'/>
    <class-decl name='hb_buffer_t' size-in-bits='2752' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='46' column='1' id='type-id-89'>
      <member-type access='public'>
        <typedef-decl name='scratch_buffer_t' type-id='type-id-12' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='190' column='1' id='type-id-90'/>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-16' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='unicode' type-id='type-id-91' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='flags' type-id='type-id-72' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='replacement' type-id='type-id-79' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='content_type' type-id='type-id-71' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='props' type-id='type-id-92' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='in_error' type-id='type-id-1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1352'>
        <var-decl name='have_output' type-id='type-id-1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1360'>
        <var-decl name='have_positions' type-id='type-id-1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='idx' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='len' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1440'>
        <var-decl name='out_len' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='allocated' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='info' type-id='type-id-93' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='out_info' type-id='type-id-93' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='pos' type-id='type-id-94' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='serial' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1760'>
        <var-decl name='allocated_var_bytes' type-id='type-id-95' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='allocated_var_owner' type-id='type-id-69' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='87' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='CONTEXT_LENGTH' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='context' type-id='type-id-80' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='context_len' type-id='type-id-97' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='94' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hb_glyph_info_t' size-in-bits='160' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='44' column='1' id='type-id-98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='codepoint' type-id='type-id-79' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mask' type-id='type-id-99' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cluster' type-id='type-id-100' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='var1' type-id='type-id-101' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='var2' type-id='type-id-101' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='51' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hb_glyph_position_t' size-in-bits='160' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='54' column='1' id='type-id-102'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x_advance' type-id='type-id-103' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y_advance' type-id='type-id-103' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='x_offset' type-id='type-id-103' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='y_offset' type-id='type-id-103' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='var' type-id='type-id-101' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hb_segment_properties_t' size-in-bits='256' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='65' column='1' id='type-id-104'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='direction' type-id='type-id-75' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='script' type-id='type-id-76' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='language' type-id='type-id-105' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reserved1' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='reserved2' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='71' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hb_unicode_funcs_t' size-in-bits='2560' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='64' column='1' id='type-id-106'>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__2' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='215' column='1' id='type-id-107'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='combining_class' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='eastasian_width' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='general_category' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='mirroring' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='script' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <var-decl name='compose' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <var-decl name='decompose' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <var-decl name='decompose_compatibility' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='203' column='1' id='type-id-108'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='combining_class' type-id='type-id-109' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='eastasian_width' type-id='type-id-110' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='general_category' type-id='type-id-111' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='mirroring' type-id='type-id-112' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='script' type-id='type-id-113' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <var-decl name='compose' type-id='type-id-114' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <var-decl name='decompose' type-id='type-id-115' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <var-decl name='decompose_compatibility' type-id='type-id-116' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__1' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='209' column='1' id='type-id-117'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='combining_class' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='eastasian_width' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='general_category' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='mirroring' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='script' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <var-decl name='compose' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <var-decl name='decompose' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <var-decl name='decompose_compatibility' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-16' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='parent' type-id='type-id-118' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='immutable' type-id='type-id-1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='func' type-id='type-id-108' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='user_data' type-id='type-id-117' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='destroy' type-id='type-id-107' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='219' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='hb_buffer_t' type-id='type-id-89' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='93' column='1' id='type-id-119'/>
    <typedef-decl name='hb_codepoint_t' type-id='type-id-100' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='75' column='1' id='type-id-79'/>
    <typedef-decl name='hb_font_t' type-id='type-id-120' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='40' column='1' id='type-id-121'/>
    <typedef-decl name='hb_glyph_info_t' type-id='type-id-98' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='52' column='1' id='type-id-122'/>
    <typedef-decl name='hb_glyph_position_t' type-id='type-id-102' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='62' column='1' id='type-id-123'/>
    <typedef-decl name='hb_language_t' type-id='type-id-124' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='137' column='1' id='type-id-105'/>
    <typedef-decl name='hb_mask_t' type-id='type-id-100' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='77' column='1' id='type-id-99'/>
    <typedef-decl name='hb_position_t' type-id='type-id-125' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='76' column='1' id='type-id-103'/>
    <typedef-decl name='hb_segment_properties_t' type-id='type-id-104' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='72' column='1' id='type-id-92'/>
    <typedef-decl name='hb_unicode_combining_class_func_t' type-id='type-id-126' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='224' column='1' id='type-id-109'/>
    <typedef-decl name='hb_unicode_compose_func_t' type-id='type-id-127' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='242' column='1' id='type-id-114'/>
    <typedef-decl name='hb_unicode_decompose_compatibility_func_t' type-id='type-id-128' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='270' column='1' id='type-id-116'/>
    <typedef-decl name='hb_unicode_decompose_func_t' type-id='type-id-129' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='247' column='1' id='type-id-115'/>
    <typedef-decl name='hb_unicode_eastasian_width_func_t' type-id='type-id-130' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='227' column='1' id='type-id-110'/>
    <typedef-decl name='hb_unicode_funcs_t' type-id='type-id-106' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='171' column='1' id='type-id-131'/>
    <typedef-decl name='hb_unicode_general_category_func_t' type-id='type-id-132' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='230' column='1' id='type-id-111'/>
    <typedef-decl name='hb_unicode_mirroring_func_t' type-id='type-id-130' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='233' column='1' id='type-id-112'/>
    <typedef-decl name='hb_unicode_script_func_t' type-id='type-id-133' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='236' column='1' id='type-id-113'/>
    <typedef-decl name='hb_var_int_t' type-id='type-id-134' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='86' column='1' id='type-id-101'/>
    <typedef-decl name='int16_t' type-id='type-id-87' filepath='/usr/include/stdint.h' line='38' column='1' id='type-id-82'/>
    <typedef-decl name='int32_t' type-id='type-id-11' filepath='/usr/include/stdint.h' line='39' column='1' id='type-id-125'/>
    <typedef-decl name='int8_t' type-id='type-id-88' filepath='/usr/include/stdint.h' line='37' column='1' id='type-id-84'/>
    <typedef-decl name='uint16_t' type-id='type-id-135' filepath='/usr/include/stdint.h' line='50' column='1' id='type-id-136'/>
    <typedef-decl name='uint32_t' type-id='type-id-18' filepath='/usr/include/stdint.h' line='52' column='1' id='type-id-100'/>
    <typedef-decl name='uint8_t' type-id='type-id-137' filepath='/usr/include/stdint.h' line='49' column='1' id='type-id-138'/>
    <array-type-def dimensions='1' type-id='type-id-136' size-in-bits='32' id='type-id-139'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-4' id='type-id-10'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-138' size-in-bits='32' id='type-id-140'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-4' id='type-id-86'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-138' size-in-bits='64' id='type-id-95'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-4' id='type-id-70'/>
    </array-type-def>
    <union-decl name='_hb_var_int_t' size-in-bits='32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='79' column='1' id='type-id-134'>
      <data-member access='public'>
        <var-decl name='u32' type-id='type-id-100' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='80' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='i32' type-id='type-id-125' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='81' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='u16' type-id='type-id-139' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='82' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='i16' type-id='type-id-83' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='83' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='u8' type-id='type-id-140' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='84' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='i8' type-id='type-id-85' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='85' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-137'/>
    <array-type-def dimensions='1' type-id='type-id-18' size-in-bits='64' id='type-id-97'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-4' id='type-id-10'/>
    </array-type-def>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-135'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-141'/>
    <qualified-type-def type-id='type-id-89' const='yes' id='type-id-142'/>
    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-143'/>
    <qualified-type-def type-id='type-id-79' const='yes' id='type-id-144'/>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' id='type-id-145'/>
    <qualified-type-def type-id='type-id-122' const='yes' id='type-id-146'/>
    <reference-type-def kind='lvalue' type-id='type-id-146' size-in-bits='64' id='type-id-147'/>
    <qualified-type-def type-id='type-id-148' const='yes' id='type-id-149'/>
    <pointer-type-def type-id='type-id-149' size-in-bits='64' id='type-id-124'/>
    <qualified-type-def type-id='type-id-106' const='yes' id='type-id-150'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-151'/>
    <qualified-type-def type-id='type-id-18' const='yes' id='type-id-96'/>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-129'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-127'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-154'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-155'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-156'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-157'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-158'/>
    <reference-type-def kind='lvalue' type-id='type-id-122' size-in-bits='64' id='type-id-159'/>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-93'/>
    <reference-type-def kind='lvalue' type-id='type-id-123' size-in-bits='64' id='type-id-160'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-94'/>
    <pointer-type-def type-id='type-id-161' size-in-bits='64' id='type-id-133'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-126'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-118'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-91'/>
    <pointer-type-def type-id='type-id-163' size-in-bits='64' id='type-id-132'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-128'/>
    <pointer-type-def type-id='type-id-165' size-in-bits='64' id='type-id-130'/>
    <class-decl name='hb_font_t' size-in-bits='1536' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='91' column='1' id='type-id-120'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-16' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='immutable' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='parent' type-id='type-id-166' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='face' type-id='type-id-167' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='x_scale' type-id='type-id-11' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='y_scale' type-id='type-id-11' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='x_ppem' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='y_ppem' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='klass' type-id='type-id-168' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='user_data' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='destroy' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='shaper_data' type-id='type-id-169' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='110' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hb_language_impl_t' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='167' column='1' id='type-id-148'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s' type-id='type-id-170' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='168' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='hb_buffer_serialize_list_formats' mangled-name='hb_buffer_serialize_list_formats' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_serialize_list_formats'>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='hb_buffer_serialize_format_from_string' mangled-name='hb_buffer_serialize_format_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='63' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_serialize_format_from_string'>
      <parameter type-id='type-id-17' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='63' column='1'/>
      <parameter type-id='type-id-11' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='63' column='1'/>
      <return type-id='type-id-74'/>
    </function-decl>
    <function-decl name='hb_buffer_serialize_format_to_string' mangled-name='hb_buffer_serialize_format_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_serialize_format_to_string'>
      <parameter type-id='type-id-74' name='format' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='80' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='hb_buffer_serialize_glyphs' mangled-name='hb_buffer_serialize_glyphs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_serialize_glyphs'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='246' column='1'/>
      <parameter type-id='type-id-18' name='start' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='247' column='1'/>
      <parameter type-id='type-id-18' name='end' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='248' column='1'/>
      <parameter type-id='type-id-38' name='buf' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='249' column='1'/>
      <parameter type-id='type-id-18' name='buf_size' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='250' column='1'/>
      <parameter type-id='type-id-66' name='buf_consumed' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='251' column='1'/>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='252' column='1'/>
      <parameter type-id='type-id-74' name='format' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='253' column='1'/>
      <parameter type-id='type-id-73' name='flags' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='254' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='hb_buffer_deserialize_glyphs' mangled-name='hb_buffer_deserialize_glyphs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='353' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_deserialize_glyphs'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='353' column='1'/>
      <parameter type-id='type-id-17' name='buf' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='354' column='1'/>
      <parameter type-id='type-id-11' name='buf_len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='355' column='1'/>
      <parameter type-id='type-id-141' name='end_ptr' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='356' column='1'/>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='357' column='1'/>
      <parameter type-id='type-id-74' name='format' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='358' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-161'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-76'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-162'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-77'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-163'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-78'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-152'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-33'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-153'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-33'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-164'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-18'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-165'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-18'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='hb-buffer.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <class-decl name='hb_utf_t&lt;short unsigned int, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='138' column='1' id='type-id-171'/>
    <class-decl name='hb_utf_t&lt;unsigned char, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='39' column='1' id='type-id-172'/>
    <class-decl name='hb_utf_t&lt;unsigned int, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='32' column='1' id='type-id-173'/>
    <qualified-type-def type-id='type-id-92' const='yes' id='type-id-174'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-175'/>
    <qualified-type-def type-id='type-id-136' const='yes' id='type-id-176'/>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-177'/>
    <qualified-type-def type-id='type-id-100' const='yes' id='type-id-178'/>
    <pointer-type-def type-id='type-id-178' size-in-bits='64' id='type-id-179'/>
    <qualified-type-def type-id='type-id-138' const='yes' id='type-id-180'/>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' id='type-id-181'/>
    <qualified-type-def type-id='type-id-154' const='yes' id='type-id-182'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-183'/>
    <qualified-type-def type-id='type-id-118' const='yes' id='type-id-184'/>
    <function-decl name='hb_segment_properties_equal' mangled-name='hb_segment_properties_equal' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_segment_properties_equal'>
      <parameter type-id='type-id-175' name='a' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='40' column='1'/>
      <parameter type-id='type-id-175' name='b' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='41' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='hb_segment_properties_hash' mangled-name='hb_segment_properties_hash' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_segment_properties_hash'>
      <parameter type-id='type-id-175' name='p' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='52' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='hb_buffer_create' mangled-name='hb_buffer_create' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='677' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_create'>
      <return type-id='type-id-155'/>
    </function-decl>
    <function-decl name='hb_buffer_get_empty' mangled-name='hb_buffer_get_empty' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='699' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_empty'>
      <return type-id='type-id-155'/>
    </function-decl>
    <function-decl name='hb_buffer_reference' mangled-name='hb_buffer_reference' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='731' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_reference'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='731' column='1'/>
      <return type-id='type-id-155'/>
    </function-decl>
    <function-decl name='hb_buffer_destroy' mangled-name='hb_buffer_destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='745' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_destroy'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='745' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_buffer_set_user_data' mangled-name='hb_buffer_set_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='772' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_user_data'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='772' column='1'/>
      <parameter type-id='type-id-29' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='773' column='1'/>
      <parameter type-id='type-id-19' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='774' column='1'/>
      <parameter type-id='type-id-20' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='775' column='1'/>
      <parameter type-id='type-id-33' name='replace' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='776' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='hb_buffer_get_user_data' mangled-name='hb_buffer_get_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='793' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_user_data'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='793' column='1'/>
      <parameter type-id='type-id-29' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='794' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='hb_buffer_set_content_type' mangled-name='hb_buffer_set_content_type' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='810' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_content_type'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='810' column='1'/>
      <parameter type-id='type-id-71' name='content_type' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='811' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_buffer_get_content_type' mangled-name='hb_buffer_get_content_type' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='827' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_content_type'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='827' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='hb_buffer_set_unicode_funcs' mangled-name='hb_buffer_set_unicode_funcs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='843' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_unicode_funcs'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='843' column='1'/>
      <parameter type-id='type-id-91' name='unicode_funcs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='844' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_buffer_get_unicode_funcs' mangled-name='hb_buffer_get_unicode_funcs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='869' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_unicode_funcs'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='869' column='1'/>
      <return type-id='type-id-91'/>
    </function-decl>
    <function-decl name='hb_buffer_set_direction' mangled-name='hb_buffer_set_direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='884' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_direction'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='884' column='1'/>
      <parameter type-id='type-id-75' name='direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='885' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_buffer_get_direction' mangled-name='hb_buffer_get_direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='905' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_direction'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='905' column='1'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='hb_buffer_set_script' mangled-name='hb_buffer_set_script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='920' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_script'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='920' column='1'/>
      <parameter type-id='type-id-76' name='script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='921' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_buffer_get_script' mangled-name='hb_buffer_get_script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='940' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_script'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='940' column='1'/>
      <return type-id='type-id-76'/>
    </function-decl>
    <function-decl name='hb_buffer_set_language' mangled-name='hb_buffer_set_language' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='955' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_language'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='955' column='1'/>
      <parameter type-id='type-id-105' name='language' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='956' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_buffer_get_language' mangled-name='hb_buffer_get_language' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='975' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_language'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='975' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='hb_buffer_set_segment_properties' mangled-name='hb_buffer_set_segment_properties' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='990' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_segment_properties'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='990' column='1'/>
      <parameter type-id='type-id-175' name='props' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='991' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_buffer_get_segment_properties' mangled-name='hb_buffer_get_segment_properties' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1009' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_segment_properties'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1009' column='1'/>
      <parameter type-id='type-id-183' name='props' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1010' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_buffer_set_flags' mangled-name='hb_buffer_set_flags' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1026' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_flags'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1026' column='1'/>
      <parameter type-id='type-id-72' name='flags' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1027' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_buffer_get_flags' mangled-name='hb_buffer_get_flags' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1046' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_flags'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1046' column='1'/>
      <return type-id='type-id-72'/>
    </function-decl>
    <function-decl name='hb_buffer_set_replacement_codepoint' mangled-name='hb_buffer_set_replacement_codepoint' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1062' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_replacement_codepoint'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1062' column='1'/>
      <parameter type-id='type-id-79' name='replacement' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1063' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_buffer_get_replacement_codepoint' mangled-name='hb_buffer_get_replacement_codepoint' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1082' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_replacement_codepoint'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1082' column='1'/>
      <return type-id='type-id-79'/>
    </function-decl>
    <function-decl name='hb_buffer_reset' mangled-name='hb_buffer_reset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1097' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_reset'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1097' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_buffer_clear_contents' mangled-name='hb_buffer_clear_contents' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_clear_contents'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1111' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_buffer_pre_allocate' mangled-name='hb_buffer_pre_allocate' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_pre_allocate'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1128' column='1'/>
      <parameter type-id='type-id-18' name='size' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1128' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='hb_buffer_allocation_successful' mangled-name='hb_buffer_allocation_successful' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_allocation_successful'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1144' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='hb_buffer_add' mangled-name='hb_buffer_add' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1160' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1160' column='1'/>
      <parameter type-id='type-id-79' name='codepoint' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1161' column='1'/>
      <parameter type-id='type-id-18' name='cluster' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1162' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_buffer_set_length' mangled-name='hb_buffer_set_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_length'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1180' column='1'/>
      <parameter type-id='type-id-18' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1181' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='hb_buffer_get_length' mangled-name='hb_buffer_get_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1219' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_length'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1219' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='hb_buffer_get_glyph_infos' mangled-name='hb_buffer_get_glyph_infos' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1237' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_glyph_infos'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1237' column='1'/>
      <parameter type-id='type-id-66' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1238' column='1'/>
      <return type-id='type-id-93'/>
    </function-decl>
    <function-decl name='hb_buffer_get_glyph_positions' mangled-name='hb_buffer_get_glyph_positions' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_glyph_positions'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1259' column='1'/>
      <parameter type-id='type-id-66' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1260' column='1'/>
      <return type-id='type-id-94'/>
    </function-decl>
    <function-decl name='hb_buffer_reverse' mangled-name='hb_buffer_reverse' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_reverse'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_buffer_reverse_clusters' mangled-name='hb_buffer_reverse_clusters' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_reverse_clusters'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1296' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_buffer_guess_segment_properties' mangled-name='hb_buffer_guess_segment_properties' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_guess_segment_properties'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1326' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_buffer_add_utf8' mangled-name='hb_buffer_add_utf8' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add_utf8'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1413' column='1'/>
      <parameter type-id='type-id-17' name='text' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1414' column='1'/>
      <parameter type-id='type-id-11' name='text_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1415' column='1'/>
      <parameter type-id='type-id-18' name='item_offset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1416' column='1'/>
      <parameter type-id='type-id-11' name='item_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1417' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_buffer_add_utf16' mangled-name='hb_buffer_add_utf16' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1435' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add_utf16'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1435' column='1'/>
      <parameter type-id='type-id-177' name='text' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1436' column='1'/>
      <parameter type-id='type-id-11' name='text_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1437' column='1'/>
      <parameter type-id='type-id-18' name='item_offset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1438' column='1'/>
      <parameter type-id='type-id-11' name='item_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1439' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_buffer_add_utf32' mangled-name='hb_buffer_add_utf32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1457' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add_utf32'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1457' column='1'/>
      <parameter type-id='type-id-179' name='text' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1458' column='1'/>
      <parameter type-id='type-id-11' name='text_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1459' column='1'/>
      <parameter type-id='type-id-18' name='item_offset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1460' column='1'/>
      <parameter type-id='type-id-11' name='item_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1461' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_buffer_add_codepoints' mangled-name='hb_buffer_add_codepoints' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1479' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add_codepoints'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1479' column='1'/>
      <parameter type-id='type-id-145' name='text' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1480' column='1'/>
      <parameter type-id='type-id-11' name='text_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1481' column='1'/>
      <parameter type-id='type-id-18' name='item_offset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1482' column='1'/>
      <parameter type-id='type-id-11' name='item_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1483' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_buffer_normalize_glyphs' mangled-name='hb_buffer_normalize_glyphs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1553' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_normalize_glyphs'>
      <parameter type-id='type-id-155' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1553' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='hb-common.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='8' id='type-id-185'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-4' id='type-id-186'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-39' size-in-bits='8' id='type-id-170'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-4' id='type-id-186'/>
    </array-type-def>
    <class-decl name='hb_language_item_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='212' column='1' id='type-id-187'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-188' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lang' type-id='type-id-105' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='215' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='hb_tag_t' type-id='type-id-100' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='91' column='1' id='type-id-189'/>
    <qualified-type-def type-id='type-id-187' const='yes' id='type-id-190'/>
    <pointer-type-def type-id='type-id-190' size-in-bits='64' id='type-id-191'/>
    <qualified-type-def type-id='type-id-191' const='yes' id='type-id-192'/>
    <qualified-type-def type-id='type-id-51' const='yes' id='type-id-193'/>
    <reference-type-def kind='lvalue' type-id='type-id-187' size-in-bits='64' id='type-id-194'/>
    <pointer-type-def type-id='type-id-187' size-in-bits='64' id='type-id-188'/>
    <qualified-type-def type-id='type-id-188' const='yes' id='type-id-195'/>
    <function-decl name='hb_tag_from_string' mangled-name='hb_tag_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_tag_from_string'>
      <parameter type-id='type-id-17' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='70' column='1'/>
      <parameter type-id='type-id-11' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='70' column='1'/>
      <return type-id='type-id-189'/>
    </function-decl>
    <function-decl name='hb_tag_to_string' mangled-name='hb_tag_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_tag_to_string'>
      <parameter type-id='type-id-189' name='tag' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='98' column='1'/>
      <parameter type-id='type-id-38' name='buf' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='98' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_direction_from_string' mangled-name='hb_direction_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_direction_from_string'>
      <parameter type-id='type-id-17' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='128' column='1'/>
      <parameter type-id='type-id-11' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='128' column='1'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='hb_direction_to_string' mangled-name='hb_direction_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_direction_to_string'>
      <parameter type-id='type-id-75' name='direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='155' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='hb_language_from_string' mangled-name='hb_language_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_language_from_string'>
      <parameter type-id='type-id-17' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='293' column='1'/>
      <parameter type-id='type-id-11' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='293' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='hb_language_to_string' mangled-name='hb_language_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='325' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_language_to_string'>
      <parameter type-id='type-id-105' name='language' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='325' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='hb_language_get_default' mangled-name='hb_language_get_default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='341' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_language_get_default'>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='hb_script_from_iso15924_tag' mangled-name='hb_script_from_iso15924_tag' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='368' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_script_from_iso15924_tag'>
      <parameter type-id='type-id-189' name='tag' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='368' column='1'/>
      <return type-id='type-id-76'/>
    </function-decl>
    <function-decl name='hb_script_from_string' mangled-name='hb_script_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_script_from_string'>
      <parameter type-id='type-id-17' name='s' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='413' column='1'/>
      <parameter type-id='type-id-11' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='413' column='1'/>
      <return type-id='type-id-76'/>
    </function-decl>
    <function-decl name='hb_script_to_iso15924_tag' mangled-name='hb_script_to_iso15924_tag' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='429' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_script_to_iso15924_tag'>
      <parameter type-id='type-id-76' name='script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='429' column='1'/>
      <return type-id='type-id-189'/>
    </function-decl>
    <function-decl name='hb_script_get_horizontal_direction' mangled-name='hb_script_get_horizontal_direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='445' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_script_get_horizontal_direction'>
      <parameter type-id='type-id-76' name='script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='445' column='1'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='hb_version' mangled-name='hb_version' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='547' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_version'>
      <parameter type-id='type-id-66' name='major' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='547' column='1'/>
      <parameter type-id='type-id-66' name='minor' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='548' column='1'/>
      <parameter type-id='type-id-66' name='micro' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='549' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_version_string' mangled-name='hb_version_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='566' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_version_string'>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='hb_version_atleast' mangled-name='hb_version_atleast' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='584' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_version_atleast'>
      <parameter type-id='type-id-18' name='major' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='584' column='1'/>
      <parameter type-id='type-id-18' name='minor' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='585' column='1'/>
      <parameter type-id='type-id-18' name='micro' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='586' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='hb-face.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-196' size-in-bits='32' id='type-id-197'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-4' id='type-id-186'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-198' size-in-bits='128' id='type-id-199'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-4' id='type-id-186'/>
    </array-type-def>
    <class-decl name='hb_auto_trace_t&lt;0, bool&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='749' column='1' id='type-id-200'/>
    <class-decl name='hb_face_t' size-in-bits='1472' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='43' column='1' id='type-id-201'>
      <member-type access='public'>
        <class-decl name='plan_node_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='59' column='1' id='type-id-202'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='shape_plan' type-id='type-id-203' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='60' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='next' type-id='type-id-204' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='61' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-16' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='immutable' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='reference_table_func' type-id='type-id-205' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='user_data' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='destroy' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='index' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='upem' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='num_glyphs' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='shaper_data' type-id='type-id-169' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='shape_plans' type-id='type-id-204' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hb_feature_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='43' column='1' id='type-id-206'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tag' type-id='type-id-189' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='value' type-id='type-id-100' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='start' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='end' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hb_font_funcs_t' size-in-bits='3072' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='58' column='1' id='type-id-207'>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__2' size-in-bits='704' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='78' column='1' id='type-id-208'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='glyph' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='glyph_h_advance' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='glyph_v_advance' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='glyph_h_origin' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='glyph_v_origin' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <var-decl name='glyph_h_kerning' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <var-decl name='glyph_v_kerning' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <var-decl name='glyph_extents' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='512'>
            <var-decl name='glyph_contour_point' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='576'>
            <var-decl name='glyph_name' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='640'>
            <var-decl name='glyph_from_name' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__' size-in-bits='704' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='66' column='1' id='type-id-209'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='glyph' type-id='type-id-210' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='glyph_h_advance' type-id='type-id-211' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='glyph_v_advance' type-id='type-id-212' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='glyph_h_origin' type-id='type-id-213' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='glyph_v_origin' type-id='type-id-214' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <var-decl name='glyph_h_kerning' type-id='type-id-215' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <var-decl name='glyph_v_kerning' type-id='type-id-216' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <var-decl name='glyph_extents' type-id='type-id-217' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='512'>
            <var-decl name='glyph_contour_point' type-id='type-id-218' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='576'>
            <var-decl name='glyph_name' type-id='type-id-219' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='640'>
            <var-decl name='glyph_from_name' type-id='type-id-220' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__1' size-in-bits='704' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='72' column='1' id='type-id-221'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='glyph' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='glyph_h_advance' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='glyph_v_advance' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='glyph_h_origin' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='glyph_v_origin' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <var-decl name='glyph_h_kerning' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <var-decl name='glyph_v_kerning' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <var-decl name='glyph_extents' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='512'>
            <var-decl name='glyph_contour_point' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='576'>
            <var-decl name='glyph_name' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='640'>
            <var-decl name='glyph_from_name' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-16' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='immutable' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='get' type-id='type-id-209' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='user_data' type-id='type-id-221' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='destroy' type-id='type-id-208' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='82' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hb_glyph_extents_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='84' column='1' id='type-id-222'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x_bearing' type-id='type-id-103' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y_bearing' type-id='type-id-103' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='width' type-id='type-id-103' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='height' type-id='type-id-103' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='88' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hb_shape_plan_t' size-in-bits='1664' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='36' column='1' id='type-id-223'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-16' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='default_shaper_list' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='face_unsafe' type-id='type-id-167' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='props' type-id='type-id-92' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='shaper_func' type-id='type-id-224' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='shaper_name' type-id='type-id-17' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='user_features' type-id='type-id-225' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='num_user_features' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='shaper_data' type-id='type-id-169' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='50' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hb_shaper_data_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shaper-private.hh' line='53' column='1' id='type-id-169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ot' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shaper-list.hh' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fallback' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shaper-list.hh' line='54' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='hb_face_t' type-id='type-id-201' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.h' line='44' column='1' id='type-id-226'/>
    <typedef-decl name='hb_feature_t' type-id='type-id-206' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='48' column='1' id='type-id-227'/>
    <typedef-decl name='hb_font_funcs_t' type-id='type-id-207' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='47' column='1' id='type-id-228'/>
    <typedef-decl name='hb_font_get_glyph_advance_func_t' type-id='type-id-229' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='102' column='1' id='type-id-230'/>
    <typedef-decl name='hb_font_get_glyph_contour_point_func_t' type-id='type-id-231' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='127' column='1' id='type-id-218'/>
    <typedef-decl name='hb_font_get_glyph_extents_func_t' type-id='type-id-232' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='123' column='1' id='type-id-217'/>
    <typedef-decl name='hb_font_get_glyph_from_name_func_t' type-id='type-id-233' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='137' column='1' id='type-id-220'/>
    <typedef-decl name='hb_font_get_glyph_func_t' type-id='type-id-234' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='97' column='1' id='type-id-210'/>
    <typedef-decl name='hb_font_get_glyph_h_advance_func_t' type-id='type-id-230' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='103' column='1' id='type-id-211'/>
    <typedef-decl name='hb_font_get_glyph_h_kerning_func_t' type-id='type-id-235' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='116' column='1' id='type-id-215'/>
    <typedef-decl name='hb_font_get_glyph_h_origin_func_t' type-id='type-id-236' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='110' column='1' id='type-id-213'/>
    <typedef-decl name='hb_font_get_glyph_kerning_func_t' type-id='type-id-237' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='115' column='1' id='type-id-235'/>
    <typedef-decl name='hb_font_get_glyph_name_func_t' type-id='type-id-238' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='133' column='1' id='type-id-219'/>
    <typedef-decl name='hb_font_get_glyph_origin_func_t' type-id='type-id-239' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='109' column='1' id='type-id-236'/>
    <typedef-decl name='hb_font_get_glyph_v_advance_func_t' type-id='type-id-230' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='104' column='1' id='type-id-212'/>
    <typedef-decl name='hb_font_get_glyph_v_kerning_func_t' type-id='type-id-235' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='117' column='1' id='type-id-216'/>
    <typedef-decl name='hb_font_get_glyph_v_origin_func_t' type-id='type-id-236' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='111' column='1' id='type-id-214'/>
    <typedef-decl name='hb_glyph_extents_t' type-id='type-id-222' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='89' column='1' id='type-id-240'/>
    <typedef-decl name='hb_reference_table_func_t' type-id='type-id-241' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.h' line='50' column='1' id='type-id-205'/>
    <typedef-decl name='hb_shape_func_t' type-id='type-id-242' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shaper-private.hh' line='36' column='1' id='type-id-243'/>
    <typedef-decl name='hb_shape_plan_t' type-id='type-id-223' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan.h' line='39' column='1' id='type-id-244'/>
    <array-type-def dimensions='1' type-id='type-id-138' size-in-bits='16' id='type-id-245'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-4' id='type-id-10'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-246' size-in-bits='64' id='type-id-247'/>
    <qualified-type-def type-id='type-id-247' const='yes' id='type-id-248'/>
    <pointer-type-def type-id='type-id-249' size-in-bits='64' id='type-id-250'/>
    <pointer-type-def type-id='type-id-251' size-in-bits='64' id='type-id-252'/>
    <pointer-type-def type-id='type-id-253' size-in-bits='64' id='type-id-254'/>
    <pointer-type-def type-id='type-id-255' size-in-bits='64' id='type-id-256'/>
    <qualified-type-def type-id='type-id-256' const='yes' id='type-id-257'/>
    <pointer-type-def type-id='type-id-258' size-in-bits='64' id='type-id-259'/>
    <pointer-type-def type-id='type-id-260' size-in-bits='64' id='type-id-261'/>
    <qualified-type-def type-id='type-id-261' const='yes' id='type-id-262'/>
    <pointer-type-def type-id='type-id-263' size-in-bits='64' id='type-id-264'/>
    <pointer-type-def type-id='type-id-265' size-in-bits='64' id='type-id-266'/>
    <pointer-type-def type-id='type-id-267' size-in-bits='64' id='type-id-268'/>
    <pointer-type-def type-id='type-id-269' size-in-bits='64' id='type-id-270'/>
    <qualified-type-def type-id='type-id-270' const='yes' id='type-id-271'/>
    <pointer-type-def type-id='type-id-272' size-in-bits='64' id='type-id-273'/>
    <reference-type-def kind='lvalue' type-id='type-id-274' size-in-bits='64' id='type-id-275'/>
    <pointer-type-def type-id='type-id-274' size-in-bits='64' id='type-id-276'/>
    <qualified-type-def type-id='type-id-276' const='yes' id='type-id-277'/>
    <reference-type-def kind='lvalue' type-id='type-id-196' size-in-bits='64' id='type-id-278'/>
    <pointer-type-def type-id='type-id-196' size-in-bits='64' id='type-id-279'/>
    <qualified-type-def type-id='type-id-279' const='yes' id='type-id-280'/>
    <pointer-type-def type-id='type-id-281' size-in-bits='64' id='type-id-282'/>
    <qualified-type-def type-id='type-id-282' const='yes' id='type-id-283'/>
    <pointer-type-def type-id='type-id-284' size-in-bits='64' id='type-id-285'/>
    <qualified-type-def type-id='type-id-285' const='yes' id='type-id-286'/>
    <pointer-type-def type-id='type-id-287' size-in-bits='64' id='type-id-288'/>
    <qualified-type-def type-id='type-id-288' const='yes' id='type-id-289'/>
    <pointer-type-def type-id='type-id-198' size-in-bits='64' id='type-id-290'/>
    <pointer-type-def type-id='type-id-291' size-in-bits='64' id='type-id-292'/>
    <pointer-type-def type-id='type-id-293' size-in-bits='64' id='type-id-294'/>
    <qualified-type-def type-id='type-id-294' const='yes' id='type-id-295'/>
    <pointer-type-def type-id='type-id-296' size-in-bits='64' id='type-id-297'/>
    <pointer-type-def type-id='type-id-298' size-in-bits='64' id='type-id-299'/>
    <qualified-type-def type-id='type-id-299' const='yes' id='type-id-300'/>
    <pointer-type-def type-id='type-id-301' size-in-bits='64' id='type-id-302'/>
    <qualified-type-def type-id='type-id-302' const='yes' id='type-id-303'/>
    <qualified-type-def type-id='type-id-246' const='yes' id='type-id-304'/>
    <pointer-type-def type-id='type-id-304' size-in-bits='64' id='type-id-305'/>
    <qualified-type-def type-id='type-id-305' const='yes' id='type-id-306'/>
    <qualified-type-def type-id='type-id-249' const='yes' id='type-id-307'/>
    <reference-type-def kind='lvalue' type-id='type-id-307' size-in-bits='64' id='type-id-308'/>
    <pointer-type-def type-id='type-id-307' size-in-bits='64' id='type-id-309'/>
    <qualified-type-def type-id='type-id-251' const='yes' id='type-id-310'/>
    <reference-type-def kind='lvalue' type-id='type-id-310' size-in-bits='64' id='type-id-311'/>
    <pointer-type-def type-id='type-id-310' size-in-bits='64' id='type-id-312'/>
    <qualified-type-def type-id='type-id-253' const='yes' id='type-id-313'/>
    <reference-type-def kind='lvalue' type-id='type-id-313' size-in-bits='64' id='type-id-314'/>
    <pointer-type-def type-id='type-id-313' size-in-bits='64' id='type-id-315'/>
    <qualified-type-def type-id='type-id-315' const='yes' id='type-id-316'/>
    <qualified-type-def type-id='type-id-255' const='yes' id='type-id-317'/>
    <reference-type-def kind='lvalue' type-id='type-id-317' size-in-bits='64' id='type-id-318'/>
    <pointer-type-def type-id='type-id-317' size-in-bits='64' id='type-id-319'/>
    <qualified-type-def type-id='type-id-319' const='yes' id='type-id-320'/>
    <qualified-type-def type-id='type-id-258' const='yes' id='type-id-321'/>
    <pointer-type-def type-id='type-id-321' size-in-bits='64' id='type-id-322'/>
    <qualified-type-def type-id='type-id-260' const='yes' id='type-id-323'/>
    <pointer-type-def type-id='type-id-323' size-in-bits='64' id='type-id-324'/>
    <qualified-type-def type-id='type-id-263' const='yes' id='type-id-325'/>
    <reference-type-def kind='lvalue' type-id='type-id-325' size-in-bits='64' id='type-id-326'/>
    <pointer-type-def type-id='type-id-325' size-in-bits='64' id='type-id-327'/>
    <qualified-type-def type-id='type-id-265' const='yes' id='type-id-328'/>
    <reference-type-def kind='lvalue' type-id='type-id-328' size-in-bits='64' id='type-id-329'/>
    <pointer-type-def type-id='type-id-328' size-in-bits='64' id='type-id-330'/>
    <qualified-type-def type-id='type-id-267' const='yes' id='type-id-331'/>
    <reference-type-def kind='lvalue' type-id='type-id-331' size-in-bits='64' id='type-id-332'/>
    <pointer-type-def type-id='type-id-331' size-in-bits='64' id='type-id-333'/>
    <qualified-type-def type-id='type-id-333' const='yes' id='type-id-334'/>
    <qualified-type-def type-id='type-id-269' const='yes' id='type-id-335'/>
    <reference-type-def kind='lvalue' type-id='type-id-335' size-in-bits='64' id='type-id-336'/>
    <pointer-type-def type-id='type-id-335' size-in-bits='64' id='type-id-337'/>
    <qualified-type-def type-id='type-id-337' const='yes' id='type-id-338'/>
    <qualified-type-def type-id='type-id-272' const='yes' id='type-id-339'/>
    <pointer-type-def type-id='type-id-339' size-in-bits='64' id='type-id-340'/>
    <qualified-type-def type-id='type-id-341' const='yes' id='type-id-342'/>
    <pointer-type-def type-id='type-id-342' size-in-bits='64' id='type-id-343'/>
    <qualified-type-def type-id='type-id-274' const='yes' id='type-id-344'/>
    <reference-type-def kind='lvalue' type-id='type-id-344' size-in-bits='64' id='type-id-345'/>
    <pointer-type-def type-id='type-id-344' size-in-bits='64' id='type-id-346'/>
    <qualified-type-def type-id='type-id-346' const='yes' id='type-id-347'/>
    <qualified-type-def type-id='type-id-196' const='yes' id='type-id-348'/>
    <reference-type-def kind='lvalue' type-id='type-id-348' size-in-bits='64' id='type-id-349'/>
    <pointer-type-def type-id='type-id-348' size-in-bits='64' id='type-id-350'/>
    <qualified-type-def type-id='type-id-350' const='yes' id='type-id-351'/>
    <qualified-type-def type-id='type-id-352' const='yes' id='type-id-353'/>
    <reference-type-def kind='lvalue' type-id='type-id-353' size-in-bits='64' id='type-id-354'/>
    <qualified-type-def type-id='type-id-281' const='yes' id='type-id-355'/>
    <pointer-type-def type-id='type-id-355' size-in-bits='64' id='type-id-356'/>
    <qualified-type-def type-id='type-id-356' const='yes' id='type-id-357'/>
    <qualified-type-def type-id='type-id-284' const='yes' id='type-id-358'/>
    <pointer-type-def type-id='type-id-358' size-in-bits='64' id='type-id-359'/>
    <qualified-type-def type-id='type-id-359' const='yes' id='type-id-360'/>
    <qualified-type-def type-id='type-id-287' const='yes' id='type-id-361'/>
    <pointer-type-def type-id='type-id-361' size-in-bits='64' id='type-id-362'/>
    <qualified-type-def type-id='type-id-362' const='yes' id='type-id-363'/>
    <qualified-type-def type-id='type-id-198' const='yes' id='type-id-364'/>
    <reference-type-def kind='lvalue' type-id='type-id-364' size-in-bits='64' id='type-id-365'/>
    <pointer-type-def type-id='type-id-364' size-in-bits='64' id='type-id-366'/>
    <qualified-type-def type-id='type-id-291' const='yes' id='type-id-367'/>
    <pointer-type-def type-id='type-id-367' size-in-bits='64' id='type-id-368'/>
    <qualified-type-def type-id='type-id-369' const='yes' id='type-id-370'/>
    <pointer-type-def type-id='type-id-370' size-in-bits='64' id='type-id-371'/>
    <qualified-type-def type-id='type-id-293' const='yes' id='type-id-372'/>
    <pointer-type-def type-id='type-id-372' size-in-bits='64' id='type-id-373'/>
    <qualified-type-def type-id='type-id-373' const='yes' id='type-id-374'/>
    <qualified-type-def type-id='type-id-298' const='yes' id='type-id-375'/>
    <pointer-type-def type-id='type-id-375' size-in-bits='64' id='type-id-376'/>
    <qualified-type-def type-id='type-id-376' const='yes' id='type-id-377'/>
    <qualified-type-def type-id='type-id-301' const='yes' id='type-id-378'/>
    <pointer-type-def type-id='type-id-378' size-in-bits='64' id='type-id-379'/>
    <qualified-type-def type-id='type-id-379' const='yes' id='type-id-380'/>
    <qualified-type-def type-id='type-id-201' const='yes' id='type-id-381'/>
    <pointer-type-def type-id='type-id-381' size-in-bits='64' id='type-id-382'/>
    <qualified-type-def type-id='type-id-382' const='yes' id='type-id-383'/>
    <qualified-type-def type-id='type-id-227' const='yes' id='type-id-384'/>
    <pointer-type-def type-id='type-id-384' size-in-bits='64' id='type-id-385'/>
    <qualified-type-def type-id='type-id-207' const='yes' id='type-id-386'/>
    <pointer-type-def type-id='type-id-386' size-in-bits='64' id='type-id-387'/>
    <qualified-type-def type-id='type-id-120' const='yes' id='type-id-388'/>
    <pointer-type-def type-id='type-id-388' size-in-bits='64' id='type-id-389'/>
    <qualified-type-def type-id='type-id-223' const='yes' id='type-id-390'/>
    <pointer-type-def type-id='type-id-390' size-in-bits='64' id='type-id-391'/>
    <qualified-type-def type-id='type-id-189' const='yes' id='type-id-392'/>
    <qualified-type-def type-id='type-id-11' const='yes' id='type-id-393'/>
    <reference-type-def kind='lvalue' type-id='type-id-393' size-in-bits='64' id='type-id-394'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' id='type-id-395'/>
    <qualified-type-def type-id='type-id-395' const='yes' id='type-id-396'/>
    <pointer-type-def type-id='type-id-397' size-in-bits='64' id='type-id-241'/>
    <pointer-type-def type-id='type-id-398' size-in-bits='64' id='type-id-233'/>
    <pointer-type-def type-id='type-id-399' size-in-bits='64' id='type-id-238'/>
    <pointer-type-def type-id='type-id-400' size-in-bits='64' id='type-id-234'/>
    <pointer-type-def type-id='type-id-401' size-in-bits='64' id='type-id-232'/>
    <pointer-type-def type-id='type-id-402' size-in-bits='64' id='type-id-239'/>
    <pointer-type-def type-id='type-id-403' size-in-bits='64' id='type-id-231'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='64' id='type-id-167'/>
    <pointer-type-def type-id='type-id-202' size-in-bits='64' id='type-id-204'/>
    <pointer-type-def type-id='type-id-227' size-in-bits='64' id='type-id-225'/>
    <pointer-type-def type-id='type-id-228' size-in-bits='64' id='type-id-168'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-166'/>
    <pointer-type-def type-id='type-id-240' size-in-bits='64' id='type-id-404'/>
    <pointer-type-def type-id='type-id-405' size-in-bits='64' id='type-id-237'/>
    <pointer-type-def type-id='type-id-406' size-in-bits='64' id='type-id-229'/>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-407'/>
    <pointer-type-def type-id='type-id-243' size-in-bits='64' id='type-id-224'/>
    <pointer-type-def type-id='type-id-244' size-in-bits='64' id='type-id-203'/>
    <reference-type-def kind='lvalue' type-id='type-id-408' size-in-bits='64' id='type-id-409'/>
    <function-decl name='hb_face_create_for_tables' mangled-name='hb_face_create_for_tables' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_create_for_tables'>
      <parameter type-id='type-id-205' name='reference_table_func' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='83' column='1'/>
      <parameter type-id='type-id-19' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='84' column='1'/>
      <parameter type-id='type-id-20' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='85' column='1'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='hb_face_create' mangled-name='hb_face_create' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_create'>
      <parameter type-id='type-id-52' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='163' column='1'/>
      <parameter type-id='type-id-18' name='index' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='164' column='1'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='hb_face_get_empty' mangled-name='hb_face_get_empty' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_get_empty'>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='hb_face_reference' mangled-name='hb_face_reference' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='212' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_reference'>
      <parameter type-id='type-id-167' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='212' column='1'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='hb_face_destroy' mangled-name='hb_face_destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_destroy'>
      <parameter type-id='type-id-167' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='226' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_face_set_user_data' mangled-name='hb_face_set_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_set_user_data'>
      <parameter type-id='type-id-167' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='263' column='1'/>
      <parameter type-id='type-id-29' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='264' column='1'/>
      <parameter type-id='type-id-19' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='265' column='1'/>
      <parameter type-id='type-id-20' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='266' column='1'/>
      <parameter type-id='type-id-33' name='replace' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='267' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='hb_face_get_user_data' mangled-name='hb_face_get_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='284' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_get_user_data'>
      <parameter type-id='type-id-167' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='284' column='1'/>
      <parameter type-id='type-id-29' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='285' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='hb_face_make_immutable' mangled-name='hb_face_make_immutable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_make_immutable'>
      <parameter type-id='type-id-167' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='299' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_face_is_immutable' mangled-name='hb_face_is_immutable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_is_immutable'>
      <parameter type-id='type-id-167' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='318' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='hb_face_reference_table' mangled-name='hb_face_reference_table' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='336' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_reference_table'>
      <parameter type-id='type-id-167' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='336' column='1'/>
      <parameter type-id='type-id-189' name='tag' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='337' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='hb_face_reference_blob' mangled-name='hb_face_reference_blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='353' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_reference_blob'>
      <parameter type-id='type-id-167' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='353' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='hb_face_set_index' mangled-name='hb_face_set_index' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='368' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_set_index'>
      <parameter type-id='type-id-167' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='368' column='1'/>
      <parameter type-id='type-id-18' name='index' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='369' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_face_get_index' mangled-name='hb_face_get_index' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='388' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_get_index'>
      <parameter type-id='type-id-167' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='388' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='hb_face_set_upem' mangled-name='hb_face_set_upem' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='403' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_set_upem'>
      <parameter type-id='type-id-167' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='403' column='1'/>
      <parameter type-id='type-id-18' name='upem' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='404' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_face_get_upem' mangled-name='hb_face_get_upem' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='423' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_get_upem'>
      <parameter type-id='type-id-167' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='423' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='hb_face_set_glyph_count' mangled-name='hb_face_set_glyph_count' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='447' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_set_glyph_count'>
      <parameter type-id='type-id-167' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='447' column='1'/>
      <parameter type-id='type-id-18' name='glyph_count' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='448' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_face_get_glyph_count' mangled-name='hb_face_get_glyph_count' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='467' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_get_glyph_count'>
      <parameter type-id='type-id-167' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='467' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <namespace-decl name='OT'>
      <class-decl name='ArrayOf&lt;OT::OffsetTo&lt;OT::OffsetTable, OT::IntType&lt;unsigned int, 4u&gt; &gt;, OT::IntType&lt;unsigned int, 4u&gt; &gt;' size-in-bits='64' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='793' column='1' id='type-id-246'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='len' type-id='type-id-269' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='892' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='array' type-id='type-id-197' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='893' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='895' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='BEInt&lt;int, 4&gt;' size-in-bits='32' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='532' column='1' id='type-id-249'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='v' type-id='type-id-140' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='607' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='BEInt&lt;short int, 2&gt;' size-in-bits='16' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='532' column='1' id='type-id-251'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='v' type-id='type-id-245' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='554' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='BEInt&lt;short unsigned int, 2&gt;' size-in-bits='16' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='532' column='1' id='type-id-253'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='v' type-id='type-id-245' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='554' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='BEInt&lt;unsigned int, 4&gt;' size-in-bits='32' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='532' column='1' id='type-id-255'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='v' type-id='type-id-140' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='607' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='CheckSum' size-in-bits='32' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='692' column='1' id='type-id-258'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-269'/>
        <data-member access='public' static='yes'>
          <var-decl name='static_size' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='709' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='709' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='FixedVersion' size-in-bits='32' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='718' column='1' id='type-id-260'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='major' type-id='type-id-410' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='726' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='16'>
          <var-decl name='minor' type-id='type-id-410' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='727' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='static_size' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='729' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='729' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='IntType&lt;int, 4u&gt;' size-in-bits='32' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='613' column='1' id='type-id-263'>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='v' type-id='type-id-249' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='626' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='static_size' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='628' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='628' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='IntType&lt;short int, 2u&gt;' size-in-bits='16' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='613' column='1' id='type-id-265'>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='v' type-id='type-id-251' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='626' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='static_size' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='628' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='628' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='IntType&lt;short unsigned int, 2u&gt;' size-in-bits='16' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='613' column='1' id='type-id-267'>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='v' type-id='type-id-253' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='626' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='static_size' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='628' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='628' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='IntType&lt;unsigned int, 4u&gt;' size-in-bits='32' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='613' column='1' id='type-id-269'>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='v' type-id='type-id-255' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='626' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='static_size' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='628' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='628' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='LONGDATETIME' size-in-bits='64' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='647' column='1' id='type-id-272'>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='major' type-id='type-id-411' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='653' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='32'>
          <var-decl name='minor' type-id='type-id-369' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='654' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='static_size' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='656' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='656' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='Offset&lt;OT::IntType&lt;unsigned int, 4u&gt; &gt;' size-in-bits='32' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='683' column='1' id='type-id-341'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-269'/>
        <data-member access='public' static='yes'>
          <var-decl name='static_size' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='686' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='686' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='OffsetTable' size-in-bits='224' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='71' column='1' id='type-id-274'>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='sfnt_version' type-id='type-id-291' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='111' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='32'>
          <var-decl name='numTables' type-id='type-id-410' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='112' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='48'>
          <var-decl name='searchRangeZ' type-id='type-id-410' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='113' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='64'>
          <var-decl name='entrySelectorZ' type-id='type-id-410' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='114' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='80'>
          <var-decl name='rangeShiftZ' type-id='type-id-410' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='115' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='96'>
          <var-decl name='tables' type-id='type-id-199' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='116' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='118' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='OffsetTo&lt;OT::OffsetTable, OT::IntType&lt;unsigned int, 4u&gt; &gt;' size-in-bits='32' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='741' column='1' id='type-id-196'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-341'/>
        <data-member access='public' static='yes'>
          <var-decl name='static_size' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='778' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='778' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='OpenTypeFontFile' size-in-bits='224' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='199' column='1' id='type-id-281'>
        <member-type access='protected'>
          <union-decl name='__anonymous_union__' size-in-bits='224' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='250' column='1' id='type-id-412'>
            <data-member access='public'>
              <var-decl name='tag' type-id='type-id-291' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='251' column='1'/>
            </data-member>
            <data-member access='public'>
              <var-decl name='fontFace' type-id='type-id-352' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='252' column='1'/>
            </data-member>
            <data-member access='public'>
              <var-decl name='ttcHeader' type-id='type-id-284' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='253' column='1'/>
            </data-member>
          </union-decl>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='tableTag' type-id='type-id-392' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='200' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='CFFTag' type-id='type-id-392' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='202' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='TrueTypeTag' type-id='type-id-392' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='203' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='TTCTag' type-id='type-id-392' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='204' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='TrueTag' type-id='type-id-392' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='205' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='Typ1Tag' type-id='type-id-392' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='206' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='u' type-id='type-id-412' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='254' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='256' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='Sanitizer&lt;OT::OpenTypeFontFile&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='292' column='1' id='type-id-413'/>
      <class-decl name='Sanitizer&lt;OT::head&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='292' column='1' id='type-id-414'/>
      <class-decl name='Sanitizer&lt;OT::maxp&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='292' column='1' id='type-id-415'/>
      <class-decl name='TTCHeader' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='150' column='1' id='type-id-284'>
        <member-type access='protected'>
          <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='183' column='1' id='type-id-416'>
            <member-type access='public'>
              <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='184' column='1' id='type-id-417'>
                <data-member access='public' layout-offset-in-bits='0'>
                  <var-decl name='ttcTag' type-id='type-id-291' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='185' column='1'/>
                </data-member>
                <data-member access='public' layout-offset-in-bits='32'>
                  <var-decl name='version' type-id='type-id-260' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='186' column='1'/>
                </data-member>
              </class-decl>
            </member-type>
            <data-member access='public'>
              <var-decl name='header' type-id='type-id-417' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='188' column='1'/>
            </data-member>
            <data-member access='public'>
              <var-decl name='version1' type-id='type-id-287' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='189' column='1'/>
            </data-member>
          </union-decl>
        </member-type>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='u' type-id='type-id-416' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='190' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='TTCHeaderVersion1' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='127' column='1' id='type-id-287'>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='ttcTag' type-id='type-id-291' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='139' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='32'>
          <var-decl name='version' type-id='type-id-260' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='140' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='64'>
          <var-decl name='table' type-id='type-id-246' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='143' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='146' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='TableRecord' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='55' column='1' id='type-id-198'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='tag' type-id='type-id-291' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='61' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='checkSum' type-id='type-id-258' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='62' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='offset' type-id='type-id-369' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='63' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='length' type-id='type-id-369' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='65' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='static_size' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='67' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='67' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='Tag' size-in-bits='32' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='662' column='1' id='type-id-291'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-269'/>
        <data-member access='public' static='yes'>
          <var-decl name='static_size' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='667' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='667' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='hb_sanitize_context_t' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='178' column='1' id='type-id-293'>
        <member-type access='public'>
          <typedef-decl name='return_t' type-id='type-id-1' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='181' column='1' id='type-id-418'/>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='max_debug_depth' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='180' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='debug_depth' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='280' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='start' type-id='type-id-17' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='281' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='end' type-id='type-id-17' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='281' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='writable' type-id='type-id-1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='282' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='224'>
          <var-decl name='edit_count' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='283' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='blob' type-id='type-id-52' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='284' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='hb_serialize_context_t' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='377' column='1' id='type-id-296'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='debug_depth' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='480' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='start' type-id='type-id-38' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='481' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='end' type-id='type-id-38' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='481' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='head' type-id='type-id-38' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='481' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='ran_out_of_room' type-id='type-id-1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='482' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='head' size-in-bits='432' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='45' column='1' id='type-id-298'>
        <data-member access='public' static='yes'>
          <var-decl name='tableTag' type-id='type-id-392' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='46' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='version' type-id='type-id-260' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='60' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='32'>
          <var-decl name='fontRevision' type-id='type-id-260' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='62' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='64'>
          <var-decl name='checkSumAdjustment' type-id='type-id-369' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='63' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='96'>
          <var-decl name='magicNumber' type-id='type-id-369' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='66' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='128'>
          <var-decl name='flags' type-id='type-id-410' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='67' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='144'>
          <var-decl name='unitsPerEm' type-id='type-id-410' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='113' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='160'>
          <var-decl name='created' type-id='type-id-272' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='116' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='224'>
          <var-decl name='modified' type-id='type-id-272' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='118' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='288'>
          <var-decl name='xMin' type-id='type-id-419' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='120' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='304'>
          <var-decl name='yMin' type-id='type-id-419' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='121' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='320'>
          <var-decl name='xMax' type-id='type-id-419' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='122' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='336'>
          <var-decl name='yMax' type-id='type-id-419' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='123' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='352'>
          <var-decl name='macStyle' type-id='type-id-410' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='124' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='368'>
          <var-decl name='lowestRecPPEM' type-id='type-id-410' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='132' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='384'>
          <var-decl name='fontDirectionHint' type-id='type-id-419' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='133' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='400'>
          <var-decl name='indexToLocFormat' type-id='type-id-419' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='139' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='416'>
          <var-decl name='glyphDataFormat' type-id='type-id-419' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='140' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='static_size' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='142' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='142' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='maxp' size-in-bits='48' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-maxp-table.hh' line='43' column='1' id='type-id-301'>
        <data-member access='public' static='yes'>
          <var-decl name='tableTag' type-id='type-id-392' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-maxp-table.hh' line='44' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='version' type-id='type-id-260' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-maxp-table.hh' line='58' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='32'>
          <var-decl name='numGlyphs' type-id='type-id-410' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-maxp-table.hh' line='60' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='static_size' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-maxp-table.hh' line='62' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-maxp-table.hh' line='62' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='LONG' type-id='type-id-263' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='635' column='1' id='type-id-411'/>
      <typedef-decl name='OpenTypeFontFace' type-id='type-id-274' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='119' column='1' id='type-id-352'/>
      <typedef-decl name='SHORT' type-id='type-id-265' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='633' column='1' id='type-id-419'/>
      <typedef-decl name='ULONG' type-id='type-id-269' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='634' column='1' id='type-id-369'/>
      <typedef-decl name='USHORT' type-id='type-id-267' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='632' column='1' id='type-id-410'/>
      <class-decl name='Supplier&lt;OT::OffsetTo&lt;OT::OffsetTable, OT::IntType&lt;unsigned int, 4u&gt; &gt; &gt;' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-408'/>
    </namespace-decl>
    <type-decl name='variadic parameter type' id='type-id-420'/>
    <function-type size-in-bits='64' id='type-id-397'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-189'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-52'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-398'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-33'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-399'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-33'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-401'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-404'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-33'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-402'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-407'/>
      <parameter type-id='type-id-407'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-33'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-400'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-33'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-403'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-407'/>
      <parameter type-id='type-id-407'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-33'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-405'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-103'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-406'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-103'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-242'>
      <parameter type-id='type-id-203'/>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-385'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-33'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='hb-fallback-shape.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='hb-font.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='type-id-166' const='yes' id='type-id-421'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-422'/>
    <function-decl name='hb_font_funcs_create' mangled-name='hb_font_funcs_create' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='242' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_funcs_create'>
      <return type-id='type-id-168'/>
    </function-decl>
    <function-decl name='hb_font_funcs_get_empty' mangled-name='hb_font_funcs_get_empty' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_funcs_get_empty'>
      <return type-id='type-id-168'/>
    </function-decl>
    <function-decl name='hb_font_funcs_reference' mangled-name='hb_font_funcs_reference' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_funcs_reference'>
      <parameter type-id='type-id-168' name='ffuncs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='280' column='1'/>
      <return type-id='type-id-168'/>
    </function-decl>
    <function-decl name='hb_font_funcs_destroy' mangled-name='hb_font_funcs_destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_funcs_destroy'>
      <parameter type-id='type-id-168' name='ffuncs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='294' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_font_funcs_set_user_data' mangled-name='hb_font_funcs_set_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='321' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_funcs_set_user_data'>
      <parameter type-id='type-id-168' name='ffuncs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='321' column='1'/>
      <parameter type-id='type-id-29' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='322' column='1'/>
      <parameter type-id='type-id-19' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='323' column='1'/>
      <parameter type-id='type-id-20' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='324' column='1'/>
      <parameter type-id='type-id-33' name='replace' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='325' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='hb_font_funcs_get_user_data' mangled-name='hb_font_funcs_get_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_funcs_get_user_data'>
      <parameter type-id='type-id-168' name='ffuncs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='342' column='1'/>
      <parameter type-id='type-id-29' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='343' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='hb_font_funcs_make_immutable' mangled-name='hb_font_funcs_make_immutable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_funcs_make_immutable'>
      <parameter type-id='type-id-168' name='ffuncs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='358' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_font_funcs_is_immutable' mangled-name='hb_font_funcs_is_immutable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='377' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_funcs_is_immutable'>
      <parameter type-id='type-id-168' name='ffuncs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='377' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='hb_font_funcs_set_glyph_contour_point_func' mangled-name='hb_font_funcs_set_glyph_contour_point_func' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_funcs_set_glyph_contour_point_func'>
      <parameter type-id='type-id-168' name='ffuncs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-218' name='func' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-19' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-20' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_font_funcs_set_glyph_extents_func' mangled-name='hb_font_funcs_set_glyph_extents_func' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_funcs_set_glyph_extents_func'>
      <parameter type-id='type-id-168' name='ffuncs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-217' name='func' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-19' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-20' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_font_funcs_set_glyph_from_name_func' mangled-name='hb_font_funcs_set_glyph_from_name_func' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_funcs_set_glyph_from_name_func'>
      <parameter type-id='type-id-168' name='ffuncs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-220' name='func' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-19' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-20' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_font_funcs_set_glyph_func' mangled-name='hb_font_funcs_set_glyph_func' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_funcs_set_glyph_func'>
      <parameter type-id='type-id-168' name='ffuncs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-210' name='func' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-19' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-20' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_font_funcs_set_glyph_h_advance_func' mangled-name='hb_font_funcs_set_glyph_h_advance_func' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_funcs_set_glyph_h_advance_func'>
      <parameter type-id='type-id-168' name='ffuncs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-211' name='func' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-19' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-20' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_font_funcs_set_glyph_h_kerning_func' mangled-name='hb_font_funcs_set_glyph_h_kerning_func' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_funcs_set_glyph_h_kerning_func'>
      <parameter type-id='type-id-168' name='ffuncs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-215' name='func' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-19' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-20' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_font_funcs_set_glyph_h_origin_func' mangled-name='hb_font_funcs_set_glyph_h_origin_func' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_funcs_set_glyph_h_origin_func'>
      <parameter type-id='type-id-168' name='ffuncs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-213' name='func' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-19' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-20' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_font_funcs_set_glyph_name_func' mangled-name='hb_font_funcs_set_glyph_name_func' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_funcs_set_glyph_name_func'>
      <parameter type-id='type-id-168' name='ffuncs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-219' name='func' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-19' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-20' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_font_funcs_set_glyph_v_advance_func' mangled-name='hb_font_funcs_set_glyph_v_advance_func' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_funcs_set_glyph_v_advance_func'>
      <parameter type-id='type-id-168' name='ffuncs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-212' name='func' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-19' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-20' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_font_funcs_set_glyph_v_kerning_func' mangled-name='hb_font_funcs_set_glyph_v_kerning_func' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_funcs_set_glyph_v_kerning_func'>
      <parameter type-id='type-id-168' name='ffuncs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-216' name='func' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-19' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-20' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_font_funcs_set_glyph_v_origin_func' mangled-name='hb_font_funcs_set_glyph_v_origin_func' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_funcs_set_glyph_v_origin_func'>
      <parameter type-id='type-id-168' name='ffuncs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-214' name='func' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-19' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <parameter type-id='type-id-20' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_font_get_glyph' mangled-name='hb_font_get_glyph' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='431' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_get_glyph'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='431' column='1'/>
      <parameter type-id='type-id-79' name='unicode' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='432' column='1'/>
      <parameter type-id='type-id-79' name='variation_selector' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='432' column='1'/>
      <parameter type-id='type-id-157' name='glyph' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='433' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='hb_font_get_glyph_h_advance' mangled-name='hb_font_get_glyph_h_advance' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='450' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_get_glyph_h_advance'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='450' column='1'/>
      <parameter type-id='type-id-79' name='glyph' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='451' column='1'/>
      <return type-id='type-id-103'/>
    </function-decl>
    <function-decl name='hb_font_get_glyph_v_advance' mangled-name='hb_font_get_glyph_v_advance' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='468' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_get_glyph_v_advance'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='468' column='1'/>
      <parameter type-id='type-id-79' name='glyph' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='469' column='1'/>
      <return type-id='type-id-103'/>
    </function-decl>
    <function-decl name='hb_font_get_glyph_h_origin' mangled-name='hb_font_get_glyph_h_origin' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='488' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_get_glyph_h_origin'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='488' column='1'/>
      <parameter type-id='type-id-79' name='glyph' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='489' column='1'/>
      <parameter type-id='type-id-407' name='x' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='490' column='1'/>
      <parameter type-id='type-id-407' name='y' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='490' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='hb_font_get_glyph_v_origin' mangled-name='hb_font_get_glyph_v_origin' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='509' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_get_glyph_v_origin'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='509' column='1'/>
      <parameter type-id='type-id-79' name='glyph' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='510' column='1'/>
      <parameter type-id='type-id-407' name='x' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='511' column='1'/>
      <parameter type-id='type-id-407' name='y' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='511' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='hb_font_get_glyph_h_kerning' mangled-name='hb_font_get_glyph_h_kerning' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='529' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_get_glyph_h_kerning'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='529' column='1'/>
      <parameter type-id='type-id-79' name='left_glyph' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='530' column='1'/>
      <parameter type-id='type-id-79' name='right_glyph' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='530' column='1'/>
      <return type-id='type-id-103'/>
    </function-decl>
    <function-decl name='hb_font_get_glyph_v_kerning' mangled-name='hb_font_get_glyph_v_kerning' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='548' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_get_glyph_v_kerning'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='548' column='1'/>
      <parameter type-id='type-id-79' name='top_glyph' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='549' column='1'/>
      <parameter type-id='type-id-79' name='bottom_glyph' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='549' column='1'/>
      <return type-id='type-id-103'/>
    </function-decl>
    <function-decl name='hb_font_get_glyph_extents' mangled-name='hb_font_get_glyph_extents' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='567' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_get_glyph_extents'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='567' column='1'/>
      <parameter type-id='type-id-79' name='glyph' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='568' column='1'/>
      <parameter type-id='type-id-404' name='extents' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='569' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='hb_font_get_glyph_contour_point' mangled-name='hb_font_get_glyph_contour_point' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='589' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_get_glyph_contour_point'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='589' column='1'/>
      <parameter type-id='type-id-79' name='glyph' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='590' column='1'/>
      <parameter type-id='type-id-18' name='point_index' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='590' column='1'/>
      <parameter type-id='type-id-407' name='x' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='591' column='1'/>
      <parameter type-id='type-id-407' name='y' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='591' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='hb_font_get_glyph_name' mangled-name='hb_font_get_glyph_name' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='610' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_get_glyph_name'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='610' column='1'/>
      <parameter type-id='type-id-79' name='glyph' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='611' column='1'/>
      <parameter type-id='type-id-38' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='612' column='1'/>
      <parameter type-id='type-id-18' name='size' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='612' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='hb_font_get_glyph_from_name' mangled-name='hb_font_get_glyph_from_name' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='631' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_get_glyph_from_name'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='631' column='1'/>
      <parameter type-id='type-id-17' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='632' column='1'/>
      <parameter type-id='type-id-11' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='632' column='1'/>
      <parameter type-id='type-id-157' name='glyph' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='633' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='hb_font_get_glyph_advance_for_direction' mangled-name='hb_font_get_glyph_advance_for_direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='654' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_get_glyph_advance_for_direction'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='654' column='1'/>
      <parameter type-id='type-id-79' name='glyph' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='655' column='1'/>
      <parameter type-id='type-id-75' name='direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='656' column='1'/>
      <parameter type-id='type-id-407' name='x' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='657' column='1'/>
      <parameter type-id='type-id-407' name='y' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='657' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_font_get_glyph_origin_for_direction' mangled-name='hb_font_get_glyph_origin_for_direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='675' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_get_glyph_origin_for_direction'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='675' column='1'/>
      <parameter type-id='type-id-79' name='glyph' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='676' column='1'/>
      <parameter type-id='type-id-75' name='direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='677' column='1'/>
      <parameter type-id='type-id-407' name='x' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='678' column='1'/>
      <parameter type-id='type-id-407' name='y' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='678' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_font_add_glyph_origin_for_direction' mangled-name='hb_font_add_glyph_origin_for_direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='696' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_add_glyph_origin_for_direction'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='696' column='1'/>
      <parameter type-id='type-id-79' name='glyph' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='697' column='1'/>
      <parameter type-id='type-id-75' name='direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='698' column='1'/>
      <parameter type-id='type-id-407' name='x' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='699' column='1'/>
      <parameter type-id='type-id-407' name='y' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='699' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_font_subtract_glyph_origin_for_direction' mangled-name='hb_font_subtract_glyph_origin_for_direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='717' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_subtract_glyph_origin_for_direction'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='717' column='1'/>
      <parameter type-id='type-id-79' name='glyph' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='718' column='1'/>
      <parameter type-id='type-id-75' name='direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='719' column='1'/>
      <parameter type-id='type-id-407' name='x' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='720' column='1'/>
      <parameter type-id='type-id-407' name='y' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='720' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_font_get_glyph_kerning_for_direction' mangled-name='hb_font_get_glyph_kerning_for_direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='739' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_get_glyph_kerning_for_direction'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='739' column='1'/>
      <parameter type-id='type-id-79' name='first_glyph' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='740' column='1'/>
      <parameter type-id='type-id-79' name='second_glyph' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='740' column='1'/>
      <parameter type-id='type-id-75' name='direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='741' column='1'/>
      <parameter type-id='type-id-407' name='x' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='742' column='1'/>
      <parameter type-id='type-id-407' name='y' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='742' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_font_get_glyph_extents_for_origin' mangled-name='hb_font_get_glyph_extents_for_origin' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='761' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_get_glyph_extents_for_origin'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='761' column='1'/>
      <parameter type-id='type-id-79' name='glyph' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='762' column='1'/>
      <parameter type-id='type-id-75' name='direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='763' column='1'/>
      <parameter type-id='type-id-404' name='extents' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='764' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='hb_font_get_glyph_contour_point_for_origin' mangled-name='hb_font_get_glyph_contour_point_for_origin' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='785' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_get_glyph_contour_point_for_origin'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='785' column='1'/>
      <parameter type-id='type-id-79' name='glyph' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='786' column='1'/>
      <parameter type-id='type-id-18' name='point_index' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='786' column='1'/>
      <parameter type-id='type-id-75' name='direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='787' column='1'/>
      <parameter type-id='type-id-407' name='x' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='788' column='1'/>
      <parameter type-id='type-id-407' name='y' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='788' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='hb_font_glyph_to_string' mangled-name='hb_font_glyph_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='806' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_glyph_to_string'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='806' column='1'/>
      <parameter type-id='type-id-79' name='glyph' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='807' column='1'/>
      <parameter type-id='type-id-38' name='s' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='808' column='1'/>
      <parameter type-id='type-id-18' name='size' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='808' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_font_glyph_from_string' mangled-name='hb_font_glyph_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='828' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_glyph_from_string'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='828' column='1'/>
      <parameter type-id='type-id-17' name='s' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='829' column='1'/>
      <parameter type-id='type-id-11' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='829' column='1'/>
      <parameter type-id='type-id-157' name='glyph' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='830' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='hb_font_create' mangled-name='hb_font_create' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='851' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_create'>
      <parameter type-id='type-id-167' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='851' column='1'/>
      <return type-id='type-id-158'/>
    </function-decl>
    <function-decl name='hb_font_create_sub_font' mangled-name='hb_font_create_sub_font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='880' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_create_sub_font'>
      <parameter type-id='type-id-158' name='parent' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='880' column='1'/>
      <return type-id='type-id-158'/>
    </function-decl>
    <function-decl name='hb_font_get_empty' mangled-name='hb_font_get_empty' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='911' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_get_empty'>
      <return type-id='type-id-158'/>
    </function-decl>
    <function-decl name='hb_font_reference' mangled-name='hb_font_reference' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='952' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_reference'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='952' column='1'/>
      <return type-id='type-id-158'/>
    </function-decl>
    <function-decl name='hb_font_destroy' mangled-name='hb_font_destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='966' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_destroy'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='966' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_font_set_user_data' mangled-name='hb_font_set_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='999' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_set_user_data'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='999' column='1'/>
      <parameter type-id='type-id-29' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1000' column='1'/>
      <parameter type-id='type-id-19' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1001' column='1'/>
      <parameter type-id='type-id-20' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1002' column='1'/>
      <parameter type-id='type-id-33' name='replace' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1003' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='hb_font_get_user_data' mangled-name='hb_font_get_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1020' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_get_user_data'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1020' column='1'/>
      <parameter type-id='type-id-29' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1021' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='hb_font_make_immutable' mangled-name='hb_font_make_immutable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1035' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_make_immutable'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1035' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_font_is_immutable' mangled-name='hb_font_is_immutable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1054' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_is_immutable'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1054' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='hb_font_get_parent' mangled-name='hb_font_get_parent' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1070' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_get_parent'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1070' column='1'/>
      <return type-id='type-id-158'/>
    </function-decl>
    <function-decl name='hb_font_get_face' mangled-name='hb_font_get_face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1086' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_get_face'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1086' column='1'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='hb_font_set_funcs' mangled-name='hb_font_set_funcs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_set_funcs'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1104' column='1'/>
      <parameter type-id='type-id-168' name='klass' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1105' column='1'/>
      <parameter type-id='type-id-19' name='font_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1106' column='1'/>
      <parameter type-id='type-id-20' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1107' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_font_set_funcs_data' mangled-name='hb_font_set_funcs_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1139' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_set_funcs_data'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1139' column='1'/>
      <parameter type-id='type-id-19' name='font_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1140' column='1'/>
      <parameter type-id='type-id-20' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1141' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_font_set_scale' mangled-name='hb_font_set_scale' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1169' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_set_scale'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1169' column='1'/>
      <parameter type-id='type-id-11' name='x_scale' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1170' column='1'/>
      <parameter type-id='type-id-11' name='y_scale' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1171' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_font_get_scale' mangled-name='hb_font_get_scale' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_get_scale'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1191' column='1'/>
      <parameter type-id='type-id-422' name='x_scale' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1192' column='1'/>
      <parameter type-id='type-id-422' name='y_scale' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1193' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_font_set_ppem' mangled-name='hb_font_set_ppem' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1210' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_set_ppem'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1210' column='1'/>
      <parameter type-id='type-id-18' name='x_ppem' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1211' column='1'/>
      <parameter type-id='type-id-18' name='y_ppem' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1212' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='hb_font_get_ppem' mangled-name='hb_font_get_ppem' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_get_ppem'>
      <parameter type-id='type-id-158' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1232' column='1'/>
      <parameter type-id='type-id-66' name='x_ppem' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1233' column='1'/>
      <parameter type-id='type-id-66' name='y_ppem' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='1234' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='hb-ft.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <enum-decl name='FT_Encoding_' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='698' column='1' id='type-id-423'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='FT_ENCODING_NONE' value='0'/>
      <enumerator name='FT_ENCODING_MS_SYMBOL' value='1937337698'/>
      <enumerator name='FT_ENCODING_UNICODE' value='1970170211'/>
      <enumerator name='FT_ENCODING_SJIS' value='1936353651'/>
      <enumerator name='FT_ENCODING_GB2312' value='1734484000'/>
      <enumerator name='FT_ENCODING_BIG5' value='1651074869'/>
      <enumerator name='FT_ENCODING_WANSUNG' value='2002873971'/>
      <enumerator name='FT_ENCODING_JOHAB' value='1785686113'/>
      <enumerator name='FT_ENCODING_MS_SJIS' value='1936353651'/>
      <enumerator name='FT_ENCODING_MS_GB2312' value='1734484000'/>
      <enumerator name='FT_ENCODING_MS_BIG5' value='1651074869'/>
      <enumerator name='FT_ENCODING_MS_WANSUNG' value='2002873971'/>
      <enumerator name='FT_ENCODING_MS_JOHAB' value='1785686113'/>
      <enumerator name='FT_ENCODING_ADOBE_STANDARD' value='1094995778'/>
      <enumerator name='FT_ENCODING_ADOBE_EXPERT' value='1094992453'/>
      <enumerator name='FT_ENCODING_ADOBE_CUSTOM' value='1094992451'/>
      <enumerator name='FT_ENCODING_ADOBE_LATIN_1' value='1818326065'/>
      <enumerator name='FT_ENCODING_OLD_LATIN_2' value='1818326066'/>
      <enumerator name='FT_ENCODING_APPLE_ROMAN' value='1634889070'/>
    </enum-decl>
    <enum-decl name='FT_Glyph_Format_' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/ftimage.h' line='787' column='1' id='type-id-424'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='FT_GLYPH_FORMAT_NONE' value='0'/>
      <enumerator name='FT_GLYPH_FORMAT_COMPOSITE' value='1668246896'/>
      <enumerator name='FT_GLYPH_FORMAT_BITMAP' value='1651078259'/>
      <enumerator name='FT_GLYPH_FORMAT_OUTLINE' value='1869968492'/>
      <enumerator name='FT_GLYPH_FORMAT_PLOTTER' value='1886154612'/>
    </enum-decl>
    <class-decl name='FT_BBox_' size-in-bits='256' is-struct='yes' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/ftimage.h' line='116' column='1' id='type-id-425'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='xMin' type-id='type-id-426' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/ftimage.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='yMin' type-id='type-id-426' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/ftimage.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='xMax' type-id='type-id-426' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/ftimage.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='yMax' type-id='type-id-426' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/ftimage.h' line='118' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='FT_Bitmap_' size-in-bits='320' is-struct='yes' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/ftimage.h' line='320' column='1' id='type-id-427'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rows' type-id='type-id-11' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/ftimage.h' line='321' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='width' type-id='type-id-11' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/ftimage.h' line='322' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pitch' type-id='type-id-11' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/ftimage.h' line='323' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='buffer' type-id='type-id-428' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/ftimage.h' line='324' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='num_grays' type-id='type-id-87' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/ftimage.h' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='pixel_mode' type-id='type-id-2' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/ftimage.h' line='326' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='palette_mode' type-id='type-id-2' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/ftimage.h' line='327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='palette' type-id='type-id-19' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/ftimage.h' line='328' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='FT_Bitmap_Size_' size-in-bits='256' is-struct='yes' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='334' column='1' id='type-id-429'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='height' type-id='type-id-430' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='335' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='width' type-id='type-id-430' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='336' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-426' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='338' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='x_ppem' type-id='type-id-426' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='340' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='y_ppem' type-id='type-id-426' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='341' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='FT_CharMapRec_' size-in-bits='128' is-struct='yes' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='780' column='1' id='type-id-431'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='face' type-id='type-id-432' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='781' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='encoding' type-id='type-id-433' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='782' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='platform_id' type-id='type-id-434' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='783' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='encoding_id' type-id='type-id-434' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='784' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='FT_FaceRec_' size-in-bits='1984' is-struct='yes' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='959' column='1' id='type-id-435'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num_faces' type-id='type-id-436' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='960' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='face_index' type-id='type-id-436' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='961' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='face_flags' type-id='type-id-436' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='963' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='style_flags' type-id='type-id-436' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='964' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='num_glyphs' type-id='type-id-436' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='966' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='family_name' type-id='type-id-437' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='968' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='style_name' type-id='type-id-437' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='969' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='num_fixed_sizes' type-id='type-id-438' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='971' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='available_sizes' type-id='type-id-439' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='972' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='num_charmaps' type-id='type-id-438' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='974' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='charmaps' type-id='type-id-440' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='975' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='generic' type-id='type-id-441' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='977' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='bbox' type-id='type-id-442' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='982' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='units_per_EM' type-id='type-id-434' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='984' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1104'>
        <var-decl name='ascender' type-id='type-id-430' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='985' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='descender' type-id='type-id-430' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='986' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1136'>
        <var-decl name='height' type-id='type-id-430' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='987' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='max_advance_width' type-id='type-id-430' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='989' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1168'>
        <var-decl name='max_advance_height' type-id='type-id-430' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='990' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='underline_position' type-id='type-id-430' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='992' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1200'>
        <var-decl name='underline_thickness' type-id='type-id-430' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='993' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='glyph' type-id='type-id-443' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='995' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='size' type-id='type-id-444' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='996' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='charmap' type-id='type-id-445' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='997' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='driver' type-id='type-id-446' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='1001' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='memory' type-id='type-id-447' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='1002' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='stream' type-id='type-id-448' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='1003' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='sizes_list' type-id='type-id-449' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='1005' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='autohint' type-id='type-id-441' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='1007' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='extensions' type-id='type-id-19' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='1008' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='internal' type-id='type-id-450' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='1010' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='FT_Generic_' size-in-bits='128' is-struct='yes' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/fttypes.h' line='456' column='1' id='type-id-451'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-19' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/fttypes.h' line='457' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='finalizer' type-id='type-id-452' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/fttypes.h' line='458' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='FT_GlyphSlotRec_' size-in-bits='2432' is-struct='yes' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='1671' column='1' id='type-id-453'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='library' type-id='type-id-454' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='1672' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='face' type-id='type-id-432' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='1673' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='next' type-id='type-id-443' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='1674' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='reserved' type-id='type-id-455' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='1675' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='generic' type-id='type-id-441' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='1676' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='metrics' type-id='type-id-456' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='1678' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='linearHoriAdvance' type-id='type-id-457' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='1679' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='linearVertAdvance' type-id='type-id-457' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='1680' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='advance' type-id='type-id-458' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='1681' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='format' type-id='type-id-459' visibility='default' filepath='/collab/usr/global/tools/order/spack/opt/chaos_5_x86_64_ib/gcc@4.4.7/freetype@2.5.3-77fab1b8/include/freetype2/freetype.h' line='1683' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
