<abi-corpus version='2.3' soname='libtcmalloc_and_profiler.so.4'>
  <elf-needed>
    <dependency name='libunwind.so.8'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
    <dependency name='libgcc_s.so.1'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='GetHeapProfile' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='HeapProfilerDump' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='HeapProfilerStart' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='HeapProfilerStop' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='IsHeapProfilerRunning' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='MallocExtension_GetAllocatedSize' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='MallocExtension_GetEstimatedAllocatedSize' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='_ZTS16MmapSysAllocator' size='19' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS16SbrkSysAllocator' size='19' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS18DevMemSysAllocator' size='21' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS19DefaultSysAllocator' size='22' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS19HugetlbSysAllocator' size='22' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS22TCMallocImplementation' size='25' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV12SysAllocator' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV15MallocExtension' size='232' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV16MmapSysAllocator' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV16SbrkSysAllocator' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV18DevMemSysAllocator' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV19DefaultSysAllocator' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV19HugetlbSysAllocator' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV22TCMallocImplementation' size='232' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE13kPageHeapType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE14kLargeSpanType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE16kThreadCacheType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE17kCentralCacheType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE18kTransferCacheType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE21kPageHeapUnmappedType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE22kLargeUnmappedSpanType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__free_hook' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__malloc_hook' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__memalign_hook' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__realloc_hook' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='heap_leak_checker_bcad_variable' size='1' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='sys_alloc' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='src/base/atomicops-internals-x86.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/dynamic_annotations.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C89'>
    <function-decl name='RunningOnValgrind' mangled-name='RunningOnValgrind' filepath='src/base/dynamic_annotations.c' line='152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='RunningOnValgrind'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='ValgrindSlowdown' mangled-name='ValgrindSlowdown' filepath='src/base/dynamic_annotations.c' line='166' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ValgrindSlowdown'>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/elf_mem_image.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <class-decl name='Elf64_Ehdr' size-in-bits='512' is-struct='yes' visibility='default' filepath='/usr/include/elf.h' line='88' column='1' id='type-id-3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='e_ident' type-id='type-id-4' visibility='default' filepath='/usr/include/elf.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='e_type' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='e_machine' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='e_version' type-id='type-id-6' visibility='default' filepath='/usr/include/elf.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='e_entry' type-id='type-id-7' visibility='default' filepath='/usr/include/elf.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='e_phoff' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='e_shoff' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='e_flags' type-id='type-id-6' visibility='default' filepath='/usr/include/elf.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='e_ehsize' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='432'>
        <var-decl name='e_phentsize' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='e_phnum' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='e_shentsize' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='e_shnum' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='496'>
        <var-decl name='e_shstrndx' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='102' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Elf64_Phdr' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/elf.h' line='551' column='1' id='type-id-9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p_type' type-id='type-id-6' visibility='default' filepath='/usr/include/elf.h' line='552' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='p_flags' type-id='type-id-6' visibility='default' filepath='/usr/include/elf.h' line='553' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='p_offset' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='554' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='p_vaddr' type-id='type-id-7' visibility='default' filepath='/usr/include/elf.h' line='555' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='p_paddr' type-id='type-id-7' visibility='default' filepath='/usr/include/elf.h' line='556' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='p_filesz' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='557' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='p_memsz' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='558' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='p_align' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='559' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Elf64_Sym' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/elf.h' line='389' column='1' id='type-id-11'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_name' type-id='type-id-6' visibility='default' filepath='/usr/include/elf.h' line='390' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='st_info' type-id='type-id-12' visibility='default' filepath='/usr/include/elf.h' line='391' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='st_other' type-id='type-id-12' visibility='default' filepath='/usr/include/elf.h' line='392' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='st_shndx' type-id='type-id-13' visibility='default' filepath='/usr/include/elf.h' line='393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_value' type-id='type-id-7' visibility='default' filepath='/usr/include/elf.h' line='394' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_size' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='395' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Elf64_Verdaux' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/elf.h' line='849' column='1' id='type-id-14'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vda_name' type-id='type-id-6' visibility='default' filepath='/usr/include/elf.h' line='850' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vda_next' type-id='type-id-6' visibility='default' filepath='/usr/include/elf.h' line='851' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Elf64_Verdef' size-in-bits='160' is-struct='yes' visibility='default' filepath='/usr/include/elf.h' line='812' column='1' id='type-id-15'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vd_version' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='813' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='vd_flags' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='814' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vd_ndx' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='815' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='vd_cnt' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='816' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vd_hash' type-id='type-id-6' visibility='default' filepath='/usr/include/elf.h' line='817' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='vd_aux' type-id='type-id-6' visibility='default' filepath='/usr/include/elf.h' line='818' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='vd_next' type-id='type-id-6' visibility='default' filepath='/usr/include/elf.h' line='819' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='Elf64_Addr' type-id='type-id-16' filepath='/usr/include/elf.h' line='50' column='1' id='type-id-7'/>
    <typedef-decl name='Elf64_Half' type-id='type-id-17' filepath='/usr/include/elf.h' line='34' column='1' id='type-id-5'/>
    <typedef-decl name='Elf64_Off' type-id='type-id-16' filepath='/usr/include/elf.h' line='54' column='1' id='type-id-8'/>
    <typedef-decl name='Elf64_Section' type-id='type-id-17' filepath='/usr/include/elf.h' line='58' column='1' id='type-id-13'/>
    <typedef-decl name='Elf64_Versym' type-id='type-id-5' filepath='/usr/include/elf.h' line='62' column='1' id='type-id-18'/>
    <typedef-decl name='Elf64_Word' type-id='type-id-19' filepath='/usr/include/elf.h' line='39' column='1' id='type-id-6'/>
    <typedef-decl name='Elf64_Xword' type-id='type-id-16' filepath='/usr/include/elf.h' line='45' column='1' id='type-id-10'/>
    <typedef-decl name='uint16_t' type-id='type-id-20' filepath='/usr/include/stdint.h' line='50' column='1' id='type-id-17'/>
    <array-type-def dimensions='1' type-id='type-id-12' size-in-bits='128' id='type-id-4'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-21' id='type-id-22'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-24'/>
    <qualified-type-def type-id='type-id-24' const='yes' id='type-id-25'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-27'/>
    <reference-type-def kind='lvalue' type-id='type-id-28' size-in-bits='64' id='type-id-29'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-30'/>
    <qualified-type-def type-id='type-id-30' const='yes' id='type-id-31'/>
    <qualified-type-def type-id='type-id-3' const='yes' id='type-id-32'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-33'/>
    <qualified-type-def type-id='type-id-9' const='yes' id='type-id-34'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-35'/>
    <qualified-type-def type-id='type-id-11' const='yes' id='type-id-36'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-37'/>
    <qualified-type-def type-id='type-id-14' const='yes' id='type-id-38'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-39'/>
    <qualified-type-def type-id='type-id-15' const='yes' id='type-id-40'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-41'/>
    <qualified-type-def type-id='type-id-18' const='yes' id='type-id-42'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-43'/>
    <qualified-type-def type-id='type-id-6' const='yes' id='type-id-44'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-45'/>
    <qualified-type-def type-id='type-id-23' const='yes' id='type-id-46'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-47'/>
    <qualified-type-def type-id='type-id-47' const='yes' id='type-id-48'/>
    <qualified-type-def type-id='type-id-26' const='yes' id='type-id-49'/>
    <reference-type-def kind='lvalue' type-id='type-id-49' size-in-bits='64' id='type-id-50'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-51'/>
    <qualified-type-def type-id='type-id-28' const='yes' id='type-id-52'/>
    <reference-type-def kind='lvalue' type-id='type-id-52' size-in-bits='64' id='type-id-53'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-54'/>
    <qualified-type-def type-id='type-id-54' const='yes' id='type-id-55'/>
    <qualified-type-def type-id='type-id-56' const='yes' id='type-id-57'/>
    <namespace-decl name='base'>
      <class-decl name='ElfMemImage' size-in-bits='576' visibility='default' filepath='./src/base/elf_mem_image.h' line='56' column='1' id='type-id-23'>
        <member-type access='private'>
          <class-decl name='SymbolIterator' size-in-bits='384' visibility='default' filepath='./src/base/elf_mem_image.h' line='73' column='1' id='type-id-28'>
            <data-member access='private' layout-offset-in-bits='0'>
              <var-decl name='info_' type-id='type-id-26' visibility='default' filepath='./src/base/elf_mem_image.h' line='84' column='1'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='256'>
              <var-decl name='index_' type-id='type-id-1' visibility='default' filepath='./src/base/elf_mem_image.h' line='85' column='1'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='320'>
              <var-decl name='image_' type-id='type-id-57' visibility='default' filepath='./src/base/elf_mem_image.h' line='86' column='1'/>
            </data-member>
            <member-function access='private' constructor='yes'>
              <function-decl name='SymbolIterator' mangled-name='_ZN4base11ElfMemImage14SymbolIteratorC2EPKvi' filepath='src/base/elf_mem_image.cc' line='358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImage14SymbolIteratorC2EPKvi'>
                <parameter type-id='type-id-30' name='this' is-artificial='yes'/>
                <parameter type-id='type-id-57' name='image' filepath='src/base/elf_mem_image.cc' line='358' column='1'/>
                <parameter type-id='type-id-1' name='index' filepath='src/base/elf_mem_image.cc' line='358' column='1'/>
                <return type-id='type-id-58'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='operator-&gt;' mangled-name='_ZNK4base11ElfMemImage14SymbolIteratorptEv' filepath='src/base/elf_mem_image.cc' line='362' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage14SymbolIteratorptEv'>
                <parameter type-id='type-id-54' name='this' is-artificial='yes'/>
                <return type-id='type-id-51'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='operator*' mangled-name='_ZNK4base11ElfMemImage14SymbolIteratordeEv' filepath='src/base/elf_mem_image.cc' line='366' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage14SymbolIteratordeEv'>
                <parameter type-id='type-id-54' name='this' is-artificial='yes'/>
                <return type-id='type-id-50'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='operator==' mangled-name='_ZNK4base11ElfMemImage14SymbolIteratoreqERKS1_' filepath='src/base/elf_mem_image.cc' line='370' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage14SymbolIteratoreqERKS1_'>
                <parameter type-id='type-id-54' name='this' is-artificial='yes'/>
                <parameter type-id='type-id-53' name='rhs' filepath='src/base/elf_mem_image.cc' line='370' column='1'/>
                <return type-id='type-id-59'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='operator!=' mangled-name='_ZNK4base11ElfMemImage14SymbolIteratorneERKS1_' filepath='src/base/elf_mem_image.cc' line='374' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage14SymbolIteratorneERKS1_'>
                <parameter type-id='type-id-54' name='this' is-artificial='yes'/>
                <parameter type-id='type-id-53' name='rhs' filepath='src/base/elf_mem_image.cc' line='374' column='1'/>
                <return type-id='type-id-59'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='Update' mangled-name='_ZN4base11ElfMemImage14SymbolIterator6UpdateEi' filepath='src/base/elf_mem_image.cc' line='393' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImage14SymbolIterator6UpdateEi'>
                <parameter type-id='type-id-30' name='this' is-artificial='yes'/>
                <parameter type-id='type-id-1' name='increment' filepath='src/base/elf_mem_image.cc' line='393' column='1'/>
                <return type-id='type-id-58'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='operator++' mangled-name='_ZN4base11ElfMemImage14SymbolIteratorppEv' filepath='src/base/elf_mem_image.cc' line='378' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImage14SymbolIteratorppEv'>
                <parameter type-id='type-id-30' name='this' is-artificial='yes'/>
                <return type-id='type-id-29'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='SymbolInfo' size-in-bits='256' is-struct='yes' visibility='default' filepath='./src/base/elf_mem_image.h' line='64' column='1' id='type-id-26'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='name' type-id='type-id-60' visibility='default' filepath='./src/base/elf_mem_image.h' line='65' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='version' type-id='type-id-60' visibility='default' filepath='./src/base/elf_mem_image.h' line='66' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='address' type-id='type-id-56' visibility='default' filepath='./src/base/elf_mem_image.h' line='68' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='192'>
              <var-decl name='symbol' type-id='type-id-37' visibility='default' filepath='./src/base/elf_mem_image.h' line='69' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='private' static='yes'>
          <var-decl name='kInvalidBase' type-id='type-id-57' mangled-name='_ZN4base11ElfMemImage12kInvalidBaseE' visibility='default' filepath='./src/base/elf_mem_image.h' line='59' column='1' elf-symbol-id='_ZN4base11ElfMemImage12kInvalidBaseE'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='ehdr_' type-id='type-id-33' visibility='default' filepath='./src/base/elf_mem_image.h' line='120' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='dynsym_' type-id='type-id-37' visibility='default' filepath='./src/base/elf_mem_image.h' line='121' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='versym_' type-id='type-id-43' visibility='default' filepath='./src/base/elf_mem_image.h' line='122' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <var-decl name='verdef_' type-id='type-id-41' visibility='default' filepath='./src/base/elf_mem_image.h' line='123' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='256'>
          <var-decl name='hash_' type-id='type-id-45' visibility='default' filepath='./src/base/elf_mem_image.h' line='124' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='320'>
          <var-decl name='dynstr_' type-id='type-id-60' visibility='default' filepath='./src/base/elf_mem_image.h' line='125' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='384'>
          <var-decl name='strsize_' type-id='type-id-61' visibility='default' filepath='./src/base/elf_mem_image.h' line='126' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='448'>
          <var-decl name='verdefnum_' type-id='type-id-61' visibility='default' filepath='./src/base/elf_mem_image.h' line='127' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='512'>
          <var-decl name='link_base_' type-id='type-id-7' visibility='default' filepath='./src/base/elf_mem_image.h' line='128' column='1'/>
        </data-member>
        <member-function access='private'>
          <function-decl name='GetNumSymbols' mangled-name='_ZNK4base11ElfMemImage13GetNumSymbolsEv' filepath='src/base/elf_mem_image.cc' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage13GetNumSymbolsEv'>
            <parameter type-id='type-id-47' name='this' is-artificial='yes'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetVerdefAux' mangled-name='_ZNK4base11ElfMemImage12GetVerdefAuxEPK12Elf64_Verdef' filepath='src/base/elf_mem_image.cc' line='172' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage12GetVerdefAuxEPK12Elf64_Verdef'>
            <parameter type-id='type-id-47' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-41' name='verdef' filepath='src/base/elf_mem_image.cc' line='173' column='1'/>
            <return type-id='type-id-39'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='end' mangled-name='_ZNK4base11ElfMemImage3endEv' filepath='src/base/elf_mem_image.cc' line='389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage3endEv'>
            <parameter type-id='type-id-47' name='this' is-artificial='yes'/>
            <return type-id='type-id-28'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetVerstr' mangled-name='_ZNK4base11ElfMemImage9GetVerstrEj' filepath='src/base/elf_mem_image.cc' line='177' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetVerstrEj'>
            <parameter type-id='type-id-47' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-6' name='offset' filepath='src/base/elf_mem_image.cc' line='177' column='1'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetVerdef' mangled-name='_ZNK4base11ElfMemImage9GetVerdefEi' filepath='src/base/elf_mem_image.cc' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetVerdefEi'>
            <parameter type-id='type-id-47' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-1' name='index' filepath='src/base/elf_mem_image.cc' line='159' column='1'/>
            <return type-id='type-id-41'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetSymAddr' mangled-name='_ZNK4base11ElfMemImage10GetSymAddrEPK9Elf64_Sym' filepath='src/base/elf_mem_image.cc' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage10GetSymAddrEPK9Elf64_Sym'>
            <parameter type-id='type-id-47' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-37' name='sym' filepath='src/base/elf_mem_image.cc' line='150' column='1'/>
            <return type-id='type-id-56'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetDynstr' mangled-name='_ZNK4base11ElfMemImage9GetDynstrEj' filepath='src/base/elf_mem_image.cc' line='145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetDynstrEj'>
            <parameter type-id='type-id-47' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-6' name='offset' filepath='src/base/elf_mem_image.cc' line='145' column='1'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetPhdr' mangled-name='_ZNK4base11ElfMemImage7GetPhdrEi' filepath='src/base/elf_mem_image.cc' line='137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage7GetPhdrEi'>
            <parameter type-id='type-id-47' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-1' name='index' filepath='src/base/elf_mem_image.cc' line='137' column='1'/>
            <return type-id='type-id-35'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='Init' mangled-name='_ZN4base11ElfMemImage4InitEPKv' filepath='src/base/elf_mem_image.cc' line='182' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImage4InitEPKv'>
            <parameter type-id='type-id-24' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-56' name='base' filepath='src/base/elf_mem_image.cc' line='182' column='1'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private' constructor='yes'>
          <function-decl name='ElfMemImage' mangled-name='_ZN4base11ElfMemImageC1EPKv' filepath='src/base/elf_mem_image.cc' line='114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImageC1EPKv'>
            <parameter type-id='type-id-24' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-56' name='base' filepath='src/base/elf_mem_image.cc' line='114' column='1'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetVersym' mangled-name='_ZNK4base11ElfMemImage9GetVersymEi' filepath='src/base/elf_mem_image.cc' line='132' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetVersymEi'>
            <parameter type-id='type-id-47' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-1' name='index' filepath='src/base/elf_mem_image.cc' line='132' column='1'/>
            <return type-id='type-id-43'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetDynsym' mangled-name='_ZNK4base11ElfMemImage9GetDynsymEi' filepath='src/base/elf_mem_image.cc' line='127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetDynsymEi'>
            <parameter type-id='type-id-47' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-1' name='index' filepath='src/base/elf_mem_image.cc' line='127' column='1'/>
            <return type-id='type-id-37'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='begin' mangled-name='_ZNK4base11ElfMemImage5beginEv' filepath='src/base/elf_mem_image.cc' line='383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage5beginEv'>
            <parameter type-id='type-id-47' name='this' is-artificial='yes'/>
            <return type-id='type-id-28'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='LookupSymbolByAddress' mangled-name='_ZNK4base11ElfMemImage21LookupSymbolByAddressEPKvPNS0_10SymbolInfoE' filepath='src/base/elf_mem_image.cc' line='332' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage21LookupSymbolByAddressEPKvPNS0_10SymbolInfoE'>
            <parameter type-id='type-id-47' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-56' name='address' filepath='src/base/elf_mem_image.cc' line='332' column='1'/>
            <parameter type-id='type-id-27' name='info_out' filepath='src/base/elf_mem_image.cc' line='333' column='1'/>
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='LookupSymbol' mangled-name='_ZNK4base11ElfMemImage12LookupSymbolEPKcS2_iPNS0_10SymbolInfoE' filepath='src/base/elf_mem_image.cc' line='316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage12LookupSymbolEPKcS2_iPNS0_10SymbolInfoE'>
            <parameter type-id='type-id-47' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-60' name='name' filepath='src/base/elf_mem_image.cc' line='316' column='1'/>
            <parameter type-id='type-id-60' name='version' filepath='src/base/elf_mem_image.cc' line='317' column='1'/>
            <parameter type-id='type-id-1' name='type' filepath='src/base/elf_mem_image.cc' line='318' column='1'/>
            <parameter type-id='type-id-27' name='info' filepath='src/base/elf_mem_image.cc' line='319' column='1'/>
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/linuxthreads.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <typedef-decl name='ListAllProcessThreadsCallBack' type-id='type-id-62' filepath='./src/base/thread_lister.h' line='48' column='1' id='type-id-63'/>
    <typedef-decl name='__pid_t' type-id='type-id-1' filepath='/usr/include/bits/types.h' line='143' column='1' id='type-id-64'/>
    <typedef-decl name='pid_t' type-id='type-id-64' filepath='/usr/include/sched.h' line='37' column='1' id='type-id-65'/>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-62'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-67'/>
    <function-decl name='TCMalloc_ListAllProcessThreads' mangled-name='TCMalloc_ListAllProcessThreads' filepath='src/base/linuxthreads.cc' line='551' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='TCMalloc_ListAllProcessThreads'>
      <parameter type-id='type-id-56' name='parameter' filepath='src/base/linuxthreads.cc' line='551' column='1'/>
      <parameter type-id='type-id-63' name='callback' filepath='src/base/linuxthreads.cc' line='552' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='TCMalloc_ResumeAllProcessThreads' mangled-name='TCMalloc_ResumeAllProcessThreads' filepath='src/base/linuxthreads.cc' line='696' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='TCMalloc_ResumeAllProcessThreads'>
      <parameter type-id='type-id-1' name='num_threads' filepath='src/base/linuxthreads.cc' line='696' column='1'/>
      <parameter type-id='type-id-67' name='thread_pids' filepath='src/base/linuxthreads.cc' line='696' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-66'>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-67'/>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-1'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/logging.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <namespace-decl name='FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead'>
      <var-decl name='FLAGS_verbose' type-id='type-id-69' mangled-name='_ZN61FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead13FLAGS_verboseE' visibility='default' filepath='./src/base/logging.h' line='76' column='1' elf-symbol-id='_ZN61FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead13FLAGS_verboseE'/>
      <var-decl name='FLAGS_noverbose' type-id='type-id-70' mangled-name='_ZN61FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead15FLAGS_noverboseE' visibility='default' filepath='src/base/logging.cc' line='40' column='1' elf-symbol-id='_ZN61FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead15FLAGS_noverboseE'/>
    </namespace-decl>
    <function-decl name='RawOpenForWriting' mangled-name='_Z17RawOpenForWritingPKc' filepath='src/base/logging.cc' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z17RawOpenForWritingPKc'>
      <parameter type-id='type-id-60' name='filename' filepath='src/base/logging.cc' line='90' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='RawWrite' mangled-name='_Z8RawWriteiPKcm' filepath='src/base/logging.cc' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z8RawWriteiPKcm'>
      <parameter type-id='type-id-71' name='fd' filepath='src/base/logging.cc' line='94' column='1'/>
      <parameter type-id='type-id-60' name='buf' filepath='src/base/logging.cc' line='94' column='1'/>
      <parameter type-id='type-id-61' name='len' filepath='src/base/logging.cc' line='94' column='1'/>
      <return type-id='type-id-58'/>
    </function-decl>
    <function-decl name='RawClose' mangled-name='_Z8RawClosei' filepath='src/base/logging.cc' line='104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z8RawClosei'>
      <parameter type-id='type-id-71' name='fd' filepath='src/base/logging.cc' line='104' column='1'/>
      <return type-id='type-id-58'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/low_level_alloc.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-72' size-in-bits='1920' id='type-id-73'>
      <subrange length='30' lower-bound='0' upper-bound='29' type-id='type-id-21' id='type-id-74'/>
    </array-type-def>
    <qualified-type-def type-id='type-id-75' const='yes' id='type-id-76'/>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-72'/>
    <namespace-decl name='base'>
      <namespace-decl name='subtle'>
        <typedef-decl name='Atomic64' type-id='type-id-78' filepath='./src/base/atomicops-internals-x86.h' line='70' column='1' id='type-id-79'/>
      </namespace-decl>
      <enum-decl name='LinkerInitialized' filepath='./src/base/basictypes.h' line='381' column='1' id='type-id-80'>
        <underlying-type type-id='type-id-81'/>
        <enumerator name='LINKER_INITIALIZED' value='0'/>
      </enum-decl>
      <namespace-decl name='internal'>
        <class-decl name='HookList&lt;void (*)(const void*)&gt;' is-struct='yes' visibility='default' id='type-id-82'/>
        <class-decl name='HookList&lt;void (*)(const void*, size_t)&gt;' is-struct='yes' visibility='default' id='type-id-83'/>
      </namespace-decl>
    </namespace-decl>
    <namespace-decl name='low_level_alloc_internal'>
      <class-decl name='AllocList' size-in-bits='2240' is-struct='yes' visibility='default' filepath='src/base/low_level_alloc.cc' line='67' column='1' id='type-id-77'>
        <member-type access='public'>
          <class-decl name='Header' size-in-bits='256' is-struct='yes' visibility='default' filepath='src/base/low_level_alloc.cc' line='68' column='1' id='type-id-84'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='size' type-id='type-id-85' visibility='default' filepath='src/base/low_level_alloc.cc' line='69' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='magic' type-id='type-id-85' visibility='default' filepath='src/base/low_level_alloc.cc' line='71' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='arena' type-id='type-id-75' visibility='default' filepath='src/base/low_level_alloc.cc' line='72' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='192'>
              <var-decl name='dummy_for_alignment' type-id='type-id-56' visibility='default' filepath='src/base/low_level_alloc.cc' line='73' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='header' type-id='type-id-84' visibility='default' filepath='src/base/low_level_alloc.cc' line='74' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='levels' type-id='type-id-1' visibility='default' filepath='src/base/low_level_alloc.cc' line='78' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='next' type-id='type-id-73' visibility='default' filepath='src/base/low_level_alloc.cc' line='79' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/spinlock.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <class-decl name='CycleClock' size-in-bits='8' is-struct='yes' visibility='default' filepath='./src/base/cycleclock.h' line='79' column='1' id='type-id-86'/>
    <namespace-decl name='base'>
      <function-decl name='SubmitSpinLockProfileData' mangled-name='_ZN4base25SubmitSpinLockProfileDataEPKvl' filepath='./src/base/synchronization_profiling.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base25SubmitSpinLockProfileDataEPKvl'>
        <parameter type-id='type-id-56' name='contendedlock' filepath='./src/base/synchronization_profiling.h' line='48' column='1'/>
        <parameter type-id='type-id-87' name='wait_cycles' filepath='./src/base/synchronization_profiling.h' line='49' column='1'/>
        <return type-id='type-id-58'/>
      </function-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/spinlock_internal.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='type-id-88' const='yes' id='type-id-89'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-90'/>
    <namespace-decl name='base'>
      <namespace-decl name='subtle'>
      </namespace-decl>
      <namespace-decl name='internal'>
        <class-decl name='SpinLockWaitTransition' size-in-bits='96' is-struct='yes' visibility='default' filepath='./src/base/spinlock_internal.h' line='48' column='1' id='type-id-88'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='from' type-id='type-id-69' visibility='default' filepath='./src/base/spinlock_internal.h' line='49' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='32'>
            <var-decl name='to' type-id='type-id-69' visibility='default' filepath='./src/base/spinlock_internal.h' line='50' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='done' type-id='type-id-59' visibility='default' filepath='./src/base/spinlock_internal.h' line='51' column='1'/>
          </data-member>
        </class-decl>
        <function-decl name='SpinLockDelay' mangled-name='_ZN4base8internal13SpinLockDelayEPViii' filepath='./src/base/spinlock_linux-inl.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base8internal13SpinLockDelayEPViii'>
          <parameter type-id='type-id-91' name='w' filepath='./src/base/spinlock_linux-inl.h' line='74' column='1'/>
          <parameter type-id='type-id-69' name='value' filepath='./src/base/spinlock_linux-inl.h' line='74' column='1'/>
          <parameter type-id='type-id-1' name='loop' filepath='./src/base/spinlock_linux-inl.h' line='74' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
        <function-decl name='SpinLockWake' mangled-name='_ZN4base8internal12SpinLockWakeEPVib' filepath='./src/base/spinlock_linux-inl.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base8internal12SpinLockWakeEPVib'>
          <parameter type-id='type-id-91' name='w' filepath='./src/base/spinlock_linux-inl.h' line='96' column='1'/>
          <parameter type-id='type-id-59' name='all' filepath='./src/base/spinlock_linux-inl.h' line='96' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
        <function-decl name='SpinLockWait' mangled-name='_ZN4base8internal12SpinLockWaitEPViiPKNS0_22SpinLockWaitTransitionE' filepath='src/base/spinlock_internal.cc' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base8internal12SpinLockWaitEPViiPKNS0_22SpinLockWaitTransitionE'>
          <parameter type-id='type-id-91' name='w' filepath='src/base/spinlock_internal.cc' line='61' column='1'/>
          <parameter type-id='type-id-1' name='n' filepath='src/base/spinlock_internal.cc' line='61' column='1'/>
          <parameter type-id='type-id-90' name='trans' filepath='src/base/spinlock_internal.cc' line='62' column='1'/>
          <return type-id='type-id-69'/>
        </function-decl>
      </namespace-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/sysinfo.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-70' size-in-bits='80' id='type-id-92'>
      <subrange length='10' lower-bound='0' upper-bound='9' type-id='type-id-21' id='type-id-93'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-70' size-in-bits='40960' id='type-id-94'>
      <subrange length='5120' lower-bound='0' upper-bound='5119' type-id='type-id-21' id='type-id-95'/>
    </array-type-def>
    <class-decl name='ProcMapsIterator' size-in-bits='640' visibility='default' filepath='./src/base/sysinfo.h' line='102' column='1' id='type-id-96'>
      <member-type access='private'>
        <class-decl name='Buffer' size-in-bits='40960' is-struct='yes' visibility='default' filepath='./src/base/sysinfo.h' line='104' column='1' id='type-id-97'>
          <data-member access='public' static='yes'>
            <var-decl name='kBufSize' type-id='type-id-98' visibility='default' filepath='./src/base/sysinfo.h' line='110' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='buf_' type-id='type-id-94' visibility='default' filepath='./src/base/sysinfo.h' line='112' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='ibuf_' type-id='type-id-99' visibility='default' filepath='./src/base/sysinfo.h' line='193' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='stext_' type-id='type-id-99' visibility='default' filepath='./src/base/sysinfo.h' line='194' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='etext_' type-id='type-id-99' visibility='default' filepath='./src/base/sysinfo.h' line='195' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='nextline_' type-id='type-id-99' visibility='default' filepath='./src/base/sysinfo.h' line='196' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='ebuf_' type-id='type-id-99' visibility='default' filepath='./src/base/sysinfo.h' line='197' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='fd_' type-id='type-id-1' visibility='default' filepath='./src/base/sysinfo.h' line='219' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='352'>
        <var-decl name='pid_' type-id='type-id-65' visibility='default' filepath='./src/base/sysinfo.h' line='221' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='flags_' type-id='type-id-92' visibility='default' filepath='./src/base/sysinfo.h' line='222' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='512'>
        <var-decl name='dynamic_buffer_' type-id='type-id-100' visibility='default' filepath='./src/base/sysinfo.h' line='223' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='using_maps_backing_' type-id='type-id-59' visibility='default' filepath='./src/base/sysinfo.h' line='224' column='1'/>
      </data-member>
      <member-function access='private'>
        <function-decl name='Valid' mangled-name='_ZNK16ProcMapsIterator5ValidEv' filepath='src/base/sysinfo.cc' line='815' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16ProcMapsIterator5ValidEv'>
          <parameter type-id='type-id-101' name='this' is-artificial='yes'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='FormatLine' mangled-name='_ZN16ProcMapsIterator10FormatLineEPcimmPKcmlS2_m' filepath='src/base/sysinfo.cc' line='1084' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIterator10FormatLineEPcimmPKcmlS2_m'>
          <parameter type-id='type-id-99' name='buffer' filepath='src/base/sysinfo.cc' line='1084' column='1'/>
          <parameter type-id='type-id-1' name='bufsize' filepath='src/base/sysinfo.cc' line='1084' column='1'/>
          <parameter type-id='type-id-102' name='start' filepath='src/base/sysinfo.cc' line='1085' column='1'/>
          <parameter type-id='type-id-102' name='end' filepath='src/base/sysinfo.cc' line='1085' column='1'/>
          <parameter type-id='type-id-60' name='flags' filepath='src/base/sysinfo.cc' line='1085' column='1'/>
          <parameter type-id='type-id-102' name='offset' filepath='src/base/sysinfo.cc' line='1086' column='1'/>
          <parameter type-id='type-id-87' name='inode' filepath='src/base/sysinfo.cc' line='1086' column='1'/>
          <parameter type-id='type-id-60' name='filename' filepath='src/base/sysinfo.cc' line='1087' column='1'/>
          <parameter type-id='type-id-103' name='dev' filepath='src/base/sysinfo.cc' line='1087' column='1'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~ProcMapsIterator' mangled-name='_ZN16ProcMapsIteratorD1Ev' filepath='src/base/sysinfo.cc' line='804' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIteratorD1Ev'>
          <parameter type-id='type-id-104' name='this' is-artificial='yes'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Init' mangled-name='_ZN16ProcMapsIterator4InitEiPNS_6BufferEb' filepath='src/base/sysinfo.cc' line='741' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIterator4InitEiPNS_6BufferEb'>
          <parameter type-id='type-id-104' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-65' name='pid' filepath='src/base/sysinfo.cc' line='741' column='1'/>
          <parameter type-id='type-id-100' name='buffer' filepath='src/base/sysinfo.cc' line='741' column='1'/>
          <parameter type-id='type-id-59' name='use_maps_backing' filepath='src/base/sysinfo.cc' line='742' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='ProcMapsIterator' mangled-name='_ZN16ProcMapsIteratorC1EiPNS_6BufferEb' filepath='src/base/sysinfo.cc' line='736' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIteratorC1EiPNS_6BufferEb'>
          <parameter type-id='type-id-104' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-65' name='pid' filepath='src/base/sysinfo.cc' line='736' column='1'/>
          <parameter type-id='type-id-100' name='buffer' filepath='src/base/sysinfo.cc' line='736' column='1'/>
          <parameter type-id='type-id-59' name='use_maps_backing' filepath='src/base/sysinfo.cc' line='737' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='ProcMapsIterator' mangled-name='_ZN16ProcMapsIteratorC2EiPNS_6BufferE' filepath='src/base/sysinfo.cc' line='732' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIteratorC2EiPNS_6BufferE'>
          <parameter type-id='type-id-104' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-65' name='pid' filepath='src/base/sysinfo.cc' line='732' column='1'/>
          <parameter type-id='type-id-100' name='buffer' filepath='src/base/sysinfo.cc' line='732' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='ProcMapsIterator' mangled-name='_ZN16ProcMapsIteratorC1Ei' filepath='src/base/sysinfo.cc' line='728' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIteratorC1Ei'>
          <parameter type-id='type-id-104' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-65' name='pid' filepath='src/base/sysinfo.cc' line='728' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='NextExt' mangled-name='_ZN16ProcMapsIterator7NextExtEPmS0_PPcS0_PlS2_S0_S0_S0_S0_S0_' filepath='src/base/sysinfo.cc' line='834' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIterator7NextExtEPmS0_PPcS0_PlS2_S0_S0_S0_S0_S0_'>
          <parameter type-id='type-id-104' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-105' name='start' filepath='src/base/sysinfo.cc' line='834' column='1'/>
          <parameter type-id='type-id-105' name='end' filepath='src/base/sysinfo.cc' line='834' column='1'/>
          <parameter type-id='type-id-106' name='flags' filepath='src/base/sysinfo.cc' line='834' column='1'/>
          <parameter type-id='type-id-105' name='offset' filepath='src/base/sysinfo.cc' line='835' column='1'/>
          <parameter type-id='type-id-107' name='inode' filepath='src/base/sysinfo.cc' line='835' column='1'/>
          <parameter type-id='type-id-106' name='filename' filepath='src/base/sysinfo.cc' line='835' column='1'/>
          <parameter type-id='type-id-105' name='file_mapping' filepath='src/base/sysinfo.cc' line='836' column='1'/>
          <parameter type-id='type-id-105' name='file_pages' filepath='src/base/sysinfo.cc' line='836' column='1'/>
          <parameter type-id='type-id-105' name='anon_mapping' filepath='src/base/sysinfo.cc' line='837' column='1'/>
          <parameter type-id='type-id-105' name='anon_pages' filepath='src/base/sysinfo.cc' line='837' column='1'/>
          <parameter type-id='type-id-108' name='dev' filepath='src/base/sysinfo.cc' line='838' column='1'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Next' mangled-name='_ZN16ProcMapsIterator4NextEPmS0_PPcS0_PlS2_' filepath='src/base/sysinfo.cc' line='825' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIterator4NextEPmS0_PPcS0_PlS2_'>
          <parameter type-id='type-id-104' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-105' name='start' filepath='src/base/sysinfo.cc' line='825' column='1'/>
          <parameter type-id='type-id-105' name='end' filepath='src/base/sysinfo.cc' line='825' column='1'/>
          <parameter type-id='type-id-106' name='flags' filepath='src/base/sysinfo.cc' line='825' column='1'/>
          <parameter type-id='type-id-105' name='offset' filepath='src/base/sysinfo.cc' line='826' column='1'/>
          <parameter type-id='type-id-107' name='inode' filepath='src/base/sysinfo.cc' line='826' column='1'/>
          <parameter type-id='type-id-106' name='filename' filepath='src/base/sysinfo.cc' line='826' column='1'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='__dev_t' type-id='type-id-21' filepath='/usr/include/bits/types.h' line='134' column='1' id='type-id-109'/>
    <typedef-decl name='dev_t' type-id='type-id-109' filepath='/usr/include/sys/types.h' line='61' column='1' id='type-id-103'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-104'/>
    <qualified-type-def type-id='type-id-104' const='yes' id='type-id-110'/>
    <pointer-type-def type-id='type-id-97' size-in-bits='64' id='type-id-100'/>
    <qualified-type-def type-id='type-id-96' const='yes' id='type-id-111'/>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' id='type-id-101'/>
    <qualified-type-def type-id='type-id-101' const='yes' id='type-id-112'/>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-108'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-107'/>
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-105'/>
    <namespace-decl name='tcmalloc'>
      <function-decl name='FillProcSelfMaps' mangled-name='_ZN8tcmalloc16FillProcSelfMapsEPciPb' filepath='src/base/sysinfo.cc' line='1111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc16FillProcSelfMapsEPciPb'>
        <parameter type-id='type-id-99' name='buf' filepath='src/base/sysinfo.cc' line='1111' column='1'/>
        <parameter type-id='type-id-1' name='size' filepath='src/base/sysinfo.cc' line='1111' column='1'/>
        <parameter type-id='type-id-113' name='wrote_all' filepath='src/base/sysinfo.cc' line='1111' column='1'/>
        <return type-id='type-id-1'/>
      </function-decl>
      <function-decl name='DumpProcSelfMaps' mangled-name='_ZN8tcmalloc16DumpProcSelfMapsEi' filepath='src/base/sysinfo.cc' line='1137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc16DumpProcSelfMapsEi'>
        <parameter type-id='type-id-71' name='fd' filepath='src/base/sysinfo.cc' line='1137' column='1'/>
        <return type-id='type-id-58'/>
      </function-decl>
    </namespace-decl>
    <function-decl name='GetenvBeforeMain' mangled-name='_Z16GetenvBeforeMainPKc' filepath='src/base/sysinfo.cc' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z16GetenvBeforeMainPKc'>
      <parameter type-id='type-id-60' name='name' filepath='src/base/sysinfo.cc' line='122' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='TCMallocGetenvSafe' mangled-name='TCMallocGetenvSafe' filepath='src/base/sysinfo.cc' line='174' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='TCMallocGetenvSafe'>
      <parameter type-id='type-id-60' name='name' filepath='src/base/sysinfo.cc' line='174' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='GetUniquePathFromEnv' mangled-name='_Z20GetUniquePathFromEnvPKcPc' filepath='src/base/sysinfo.cc' line='201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z20GetUniquePathFromEnvPKcPc'>
      <parameter type-id='type-id-60' name='env_name' filepath='src/base/sysinfo.cc' line='201' column='1'/>
      <parameter type-id='type-id-99' name='path' filepath='src/base/sysinfo.cc' line='201' column='1'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='SleepForMilliseconds' mangled-name='_Z20SleepForMillisecondsi' filepath='src/base/sysinfo.cc' line='226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z20SleepForMillisecondsi'>
      <parameter type-id='type-id-1' name='milliseconds' filepath='src/base/sysinfo.cc' line='226' column='1'/>
      <return type-id='type-id-58'/>
    </function-decl>
    <function-decl name='CyclesPerSecond' mangled-name='_Z15CyclesPerSecondv' filepath='src/base/sysinfo.cc' line='500' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z15CyclesPerSecondv'>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='NumCPUs' mangled-name='_Z7NumCPUsv' filepath='src/base/sysinfo.cc' line='505' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z7NumCPUsv'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='HasPosixThreads' mangled-name='_Z15HasPosixThreadsv' filepath='src/base/sysinfo.cc' line='518' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z15HasPosixThreadsv'>
      <return type-id='type-id-59'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/vdso_support.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-115'/>
    <qualified-type-def type-id='type-id-115' const='yes' id='type-id-116'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-118'/>
    <qualified-type-def type-id='type-id-118' const='yes' id='type-id-119'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-121'/>
    <qualified-type-def type-id='type-id-117' const='yes' id='type-id-122'/>
    <reference-type-def kind='lvalue' type-id='type-id-122' size-in-bits='64' id='type-id-123'/>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-124'/>
    <qualified-type-def type-id='type-id-124' const='yes' id='type-id-125'/>
    <namespace-decl name='base'>
      <class-decl name='ElfMemImage' visibility='default' id='type-id-126'/>
      <class-decl name='VDSOInitHelper' size-in-bits='8' visibility='default' filepath='src/base/vdso_support.cc' line='137' column='1' id='type-id-114'/>
      <class-decl name='VDSOSupport' size-in-bits='576' visibility='default' filepath='./src/base/vdso_support.h' line='72' column='1' id='type-id-117'>
        <member-type access='private'>
          <typedef-decl name='SymbolInfo' type-id='type-id-26' filepath='./src/base/vdso_support.h' line='76' column='1' id='type-id-120'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='SymbolIterator' type-id='type-id-28' filepath='./src/base/vdso_support.h' line='77' column='1' id='type-id-127'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='image_' type-id='type-id-23' visibility='default' filepath='./src/base/vdso_support.h' line='112' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='vdso_base_' type-id='type-id-56' mangled-name='_ZN4base11VDSOSupport10vdso_base_E' visibility='default' filepath='./src/base/vdso_support.h' line='123' column='1' elf-symbol-id='_ZN4base11VDSOSupport10vdso_base_E'/>
        </data-member>
        <member-function access='private'>
          <function-decl name='LookupSymbolByAddress' mangled-name='_ZNK4base11VDSOSupport21LookupSymbolByAddressEPKvPNS_11ElfMemImage10SymbolInfoE' filepath='src/base/vdso_support.cc' line='124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11VDSOSupport21LookupSymbolByAddressEPKvPNS_11ElfMemImage10SymbolInfoE'>
            <parameter type-id='type-id-124' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-56' name='address' filepath='src/base/vdso_support.cc' line='124' column='1'/>
            <parameter type-id='type-id-121' name='info_out' filepath='src/base/vdso_support.cc' line='125' column='1'/>
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='LookupSymbol' mangled-name='_ZNK4base11VDSOSupport12LookupSymbolEPKcS2_iPNS_11ElfMemImage10SymbolInfoE' filepath='src/base/vdso_support.cc' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11VDSOSupport12LookupSymbolEPKcS2_iPNS_11ElfMemImage10SymbolInfoE'>
            <parameter type-id='type-id-124' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-60' name='name' filepath='src/base/vdso_support.cc' line='117' column='1'/>
            <parameter type-id='type-id-60' name='version' filepath='src/base/vdso_support.cc' line='118' column='1'/>
            <parameter type-id='type-id-1' name='type' filepath='src/base/vdso_support.cc' line='119' column='1'/>
            <parameter type-id='type-id-121' name='info' filepath='src/base/vdso_support.cc' line='120' column='1'/>
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='SetBase' mangled-name='_ZN4base11VDSOSupport7SetBaseEPKv' filepath='src/base/vdso_support.cc' line='109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11VDSOSupport7SetBaseEPKv'>
            <parameter type-id='type-id-118' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-56' name='base' filepath='src/base/vdso_support.cc' line='109' column='1'/>
            <return type-id='type-id-56'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='Init' mangled-name='_ZN4base11VDSOSupport4InitEv' filepath='src/base/vdso_support.cc' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11VDSOSupport4InitEv'>
            <return type-id='type-id-56'/>
          </function-decl>
        </member-function>
        <member-function access='private' constructor='yes'>
          <function-decl name='VDSOSupport' mangled-name='_ZN4base11VDSOSupportC1Ev' filepath='src/base/vdso_support.cc' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11VDSOSupportC1Ev'>
            <parameter type-id='type-id-118' name='this' is-artificial='yes'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/central_freelist.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <reference-type-def kind='lvalue' type-id='type-id-128' size-in-bits='64' id='type-id-129'/>
    <qualified-type-def type-id='type-id-130' const='yes' id='type-id-131'/>
    <reference-type-def kind='lvalue' type-id='type-id-131' size-in-bits='64' id='type-id-132'/>
    <qualified-type-def type-id='type-id-133' const='yes' id='type-id-134'/>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-135'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-137'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/libio.h' line='271' column='1' id='type-id-138'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-1' visibility='default' filepath='/usr/include/libio.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-99' visibility='default' filepath='/usr/include/libio.h' line='277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-99' visibility='default' filepath='/usr/include/libio.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-99' visibility='default' filepath='/usr/include/libio.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-99' visibility='default' filepath='/usr/include/libio.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-99' visibility='default' filepath='/usr/include/libio.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-99' visibility='default' filepath='/usr/include/libio.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-99' visibility='default' filepath='/usr/include/libio.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-99' visibility='default' filepath='/usr/include/libio.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-99' visibility='default' filepath='/usr/include/libio.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-99' visibility='default' filepath='/usr/include/libio.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-99' visibility='default' filepath='/usr/include/libio.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-139' visibility='default' filepath='/usr/include/libio.h' line='290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-140' visibility='default' filepath='/usr/include/libio.h' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-1' visibility='default' filepath='/usr/include/libio.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-1' visibility='default' filepath='/usr/include/libio.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-141' visibility='default' filepath='/usr/include/libio.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-20' visibility='default' filepath='/usr/include/libio.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-142' visibility='default' filepath='/usr/include/libio.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-143' visibility='default' filepath='/usr/include/libio.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-144' visibility='default' filepath='/usr/include/libio.h' line='310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-145' visibility='default' filepath='/usr/include/libio.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='__pad1' type-id='type-id-56' visibility='default' filepath='/usr/include/libio.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='__pad2' type-id='type-id-56' visibility='default' filepath='/usr/include/libio.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='__pad3' type-id='type-id-56' visibility='default' filepath='/usr/include/libio.h' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='__pad4' type-id='type-id-56' visibility='default' filepath='/usr/include/libio.h' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-61' visibility='default' filepath='/usr/include/libio.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-1' visibility='default' filepath='/usr/include/libio.h' line='334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-146' visibility='default' filepath='/usr/include/libio.h' line='336' column='1'/>
      </data-member>
    </class-decl>
    <namespace-decl name='base'>
      <class-decl name='MallocRange' is-struct='yes' visibility='default' id='type-id-147'>
      </class-decl>
    </namespace-decl>
    <function-decl name='strtod' filepath='/usr/include/stdlib.h' line='165' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-106'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='strtol' filepath='/usr/include/stdlib.h' line='184' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-106'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-148'/>
    </function-decl>
    <function-decl name='strtoll' filepath='/usr/include/stdlib.h' line='210' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-106'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-149'/>
    </function-decl>
    <function-decl name='strtoull' filepath='/usr/include/stdlib.h' line='215' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-106'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='atoi' filepath='/usr/include/stdlib.h' line='284' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='getenv' filepath='/usr/include/stdlib.h' line='567' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-99'/>
    </function-decl>
    <namespace-decl name='tcmalloc'>
      <class-decl name='CentralFreeList' visibility='default' id='type-id-151'/>
      <class-decl name='CentralFreeListPadded' visibility='default' id='type-id-152'/>
      <class-decl name='PageHeap' visibility='default' id='type-id-153'/>
      <class-decl name='Static' visibility='default' id='type-id-154'/>
      <class-decl name='Span' is-struct='yes' visibility='default' id='type-id-155'/>
      <class-decl name='StackTrace' is-struct='yes' visibility='default' id='type-id-156'/>
      <class-decl name='LogItem' visibility='default' id='type-id-157'>
      </class-decl>
      <class-decl name='PageHeapAllocator&lt;tcmalloc::Span&gt;' size-in-bits='256' visibility='default' filepath='src/page_heap_allocator.h' line='47' column='1' id='type-id-158'>
        <data-member access='private' static='yes'>
          <var-decl name='kAllocIncrement' type-id='type-id-128' visibility='default' filepath='src/page_heap_allocator.h' line='99' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='free_area_' type-id='type-id-99' visibility='default' filepath='src/page_heap_allocator.h' line='102' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='free_avail_' type-id='type-id-61' visibility='default' filepath='src/page_heap_allocator.h' line='103' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='free_list_' type-id='type-id-56' visibility='default' filepath='src/page_heap_allocator.h' line='106' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <var-decl name='inuse_' type-id='type-id-1' visibility='default' filepath='src/page_heap_allocator.h' line='109' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='PageHeapAllocator&lt;tcmalloc::StackTrace&gt;' size-in-bits='256' visibility='default' filepath='src/page_heap_allocator.h' line='47' column='1' id='type-id-159'>
        <data-member access='private' static='yes'>
          <var-decl name='kAllocIncrement' type-id='type-id-128' visibility='default' filepath='src/page_heap_allocator.h' line='99' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='free_area_' type-id='type-id-99' visibility='default' filepath='src/page_heap_allocator.h' line='102' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='free_avail_' type-id='type-id-61' visibility='default' filepath='src/page_heap_allocator.h' line='103' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='free_list_' type-id='type-id-56' visibility='default' filepath='src/page_heap_allocator.h' line='106' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <var-decl name='inuse_' type-id='type-id-1' visibility='default' filepath='src/page_heap_allocator.h' line='109' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='PageHeapAllocator&lt;tcmalloc::StackTraceTable::Bucket&gt;' size-in-bits='256' visibility='default' filepath='src/page_heap_allocator.h' line='47' column='1' id='type-id-160'>
        <data-member access='private' static='yes'>
          <var-decl name='kAllocIncrement' type-id='type-id-128' visibility='default' filepath='src/page_heap_allocator.h' line='99' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='free_area_' type-id='type-id-99' visibility='default' filepath='src/page_heap_allocator.h' line='102' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='free_avail_' type-id='type-id-61' visibility='default' filepath='src/page_heap_allocator.h' line='103' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='free_list_' type-id='type-id-56' visibility='default' filepath='src/page_heap_allocator.h' line='106' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <var-decl name='inuse_' type-id='type-id-1' visibility='default' filepath='src/page_heap_allocator.h' line='109' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='SizeMap' visibility='default' id='type-id-161'/>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/common.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <namespace-decl name='base'>
    </namespace-decl>
    <namespace-decl name='tcmalloc'>
      <function-decl name='AlignmentForSize' mangled-name='_ZN8tcmalloc16AlignmentForSizeEm' filepath='src/common.cc' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc16AlignmentForSizeEm'>
        <parameter type-id='type-id-61' name='size' filepath='src/common.cc' line='77' column='1'/>
        <return type-id='type-id-1'/>
      </function-decl>
      <function-decl name='MetaDataAlloc' mangled-name='_ZN8tcmalloc13MetaDataAllocEm' filepath='src/common.cc' line='233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc13MetaDataAllocEm'>
        <parameter type-id='type-id-61' name='bytes' filepath='src/common.cc' line='233' column='1'/>
        <return type-id='type-id-56'/>
      </function-decl>
      <function-decl name='metadata_system_bytes' mangled-name='_ZN8tcmalloc21metadata_system_bytesEv' filepath='src/common.cc' line='274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc21metadata_system_bytesEv'>
        <return type-id='type-id-16'/>
      </function-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/heap-checker-bcad.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <class-decl name='HeapLeakCheckerGlobalPrePost' size-in-bits='8' visibility='default' filepath='src/heap-checker-bcad.cc' line='60' column='1' id='type-id-162'>
      <data-member access='private' static='yes'>
        <var-decl name='count_' type-id='type-id-1' mangled-name='_ZN28HeapLeakCheckerGlobalPrePost6count_E' visibility='default' filepath='src/heap-checker-bcad.cc' line='87' column='1' elf-symbol-id='_ZN28HeapLeakCheckerGlobalPrePost6count_E'/>
      </data-member>
      <member-function access='private' destructor='yes'>
        <function-decl name='~HeapLeakCheckerGlobalPrePost' mangled-name='_ZN28HeapLeakCheckerGlobalPrePostD1Ev' filepath='src/heap-checker-bcad.cc' line='79' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN28HeapLeakCheckerGlobalPrePostD1Ev'>
          <parameter type-id='type-id-163' name='this' is-artificial='yes'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
    </class-decl>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-163'/>
    <qualified-type-def type-id='type-id-163' const='yes' id='type-id-164'/>
    <var-decl name='heap_leak_checker_bcad_variable' type-id='type-id-59' mangled-name='heap_leak_checker_bcad_variable' visibility='default' filepath='src/heap-checker-bcad.cc' line='53' column='1' elf-symbol-id='heap_leak_checker_bcad_variable'/>
  </abi-instr>
  <abi-instr address-size='64' path='src/heap-checker.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-165' size-in-bits='512' id='type-id-166'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-21' id='type-id-167'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-70' size-in-bits='unknown' id='type-id-168'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' id='type-id-169'/>
    </array-type-def>
    <class-decl name='AddressMap&lt;HeapProfileTable::AllocValue&gt;' size-in-bits='320' visibility='default' filepath='src/addressmap-inl.h' line='104' column='1' id='type-id-170'>
      <member-type access='private'>
        <class-decl name='Cluster' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-171'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='Cluster' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-172'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='Entry' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-173'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='Entry' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-174'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='Object' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-175'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='kBlockBits' type-id='type-id-128' visibility='default' filepath='src/addressmap-inl.h' line='159' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kBlockSize' type-id='type-id-128' visibility='default' filepath='src/addressmap-inl.h' line='160' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kClusterBits' type-id='type-id-128' visibility='default' filepath='src/addressmap-inl.h' line='172' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kClusterSize' type-id='type-id-176' visibility='default' filepath='src/addressmap-inl.h' line='173' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kClusterBlocks' type-id='type-id-128' visibility='default' filepath='src/addressmap-inl.h' line='174' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kHashBits' type-id='type-id-128' visibility='default' filepath='src/addressmap-inl.h' line='187' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kHashSize' type-id='type-id-128' visibility='default' filepath='src/addressmap-inl.h' line='188' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='ALLOC_COUNT' type-id='type-id-128' visibility='default' filepath='src/addressmap-inl.h' line='191' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='hashtable_' type-id='type-id-177' visibility='default' filepath='src/addressmap-inl.h' line='193' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='free_' type-id='type-id-178' visibility='default' filepath='src/addressmap-inl.h' line='194' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kHashMultiplier' type-id='type-id-179' visibility='default' filepath='src/addressmap-inl.h' line='202' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='alloc_' type-id='type-id-180' visibility='default' filepath='src/addressmap-inl.h' line='251' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='dealloc_' type-id='type-id-181' visibility='default' filepath='src/addressmap-inl.h' line='252' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='allocated_' type-id='type-id-182' visibility='default' filepath='src/addressmap-inl.h' line='253' column='1'/>
      </data-member>
      <member-function access='private'>
        <function-decl name='AddressMap' mangled-name='_ZN10AddressMapIN16HeapProfileTable10AllocValueEEC2EPFPvmEPFvS3_E' filepath='src/addressmap-inl.h' line='271' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10AddressMapIN16HeapProfileTable10AllocValueEEC2EPFPvmEPFvS3_E'>
          <parameter type-id='type-id-183' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-180' name='alloc' filepath='src/addressmap-inl.h' line='271' column='1'/>
          <parameter type-id='type-id-181' name='dealloc' filepath='src/addressmap-inl.h' line='271' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Insert' mangled-name='_ZN10AddressMapIN16HeapProfileTable10AllocValueEE6InsertEPKvS1_' filepath='src/addressmap-inl.h' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10AddressMapIN16HeapProfileTable10AllocValueEE6InsertEPKvS1_'>
          <parameter type-id='type-id-183' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-56' name='key' filepath='src/addressmap-inl.h' line='309' column='1'/>
          <parameter type-id='type-id-184' name='value' filepath='src/addressmap-inl.h' line='309' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='GoogleInitializer' size-in-bits='128' visibility='default' filepath='src/base/googleinit.h' line='39' column='1' id='type-id-185'>
      <member-type access='private'>
        <typedef-decl name='VoidFunction' type-id='type-id-187' filepath='src/base/googleinit.h' line='41' column='1' id='type-id-186'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='name_' type-id='type-id-188' visibility='default' filepath='src/base/googleinit.h' line='55' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='destructor_' type-id='type-id-189' visibility='default' filepath='src/base/googleinit.h' line='56' column='1'/>
      </data-member>
      <member-function access='private' destructor='yes'>
        <function-decl name='~GoogleInitializer' mangled-name='_ZN17GoogleInitializerD2Ev' filepath='src/base/googleinit.h' line='48' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17GoogleInitializerD2Ev'>
          <parameter type-id='type-id-190' name='this' is-artificial='yes'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~GoogleInitializer' mangled-name='_ZN17GoogleInitializerD2Ev' filepath='src/base/googleinit.h' line='48' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17GoogleInitializerD2Ev'>
          <parameter type-id='type-id-190' name='this' is-artificial='yes'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~GoogleInitializer' mangled-name='_ZN17GoogleInitializerD2Ev' filepath='src/base/googleinit.h' line='48' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17GoogleInitializerD2Ev'>
          <parameter type-id='type-id-190' name='this' is-artificial='yes'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~GoogleInitializer' mangled-name='_ZN17GoogleInitializerD2Ev' filepath='src/base/googleinit.h' line='48' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17GoogleInitializerD2Ev'>
          <parameter type-id='type-id-190' name='this' is-artificial='yes'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~GoogleInitializer' mangled-name='_ZN17GoogleInitializerD2Ev' filepath='src/base/googleinit.h' line='48' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17GoogleInitializerD2Ev'>
          <parameter type-id='type-id-190' name='this' is-artificial='yes'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~GoogleInitializer' mangled-name='_ZN17GoogleInitializerD2Ev' filepath='src/base/googleinit.h' line='48' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17GoogleInitializerD2Ev'>
          <parameter type-id='type-id-190' name='this' is-artificial='yes'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~GoogleInitializer' mangled-name='_ZN17GoogleInitializerD2Ev' filepath='./src/base/googleinit.h' line='48' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17GoogleInitializerD2Ev'>
          <parameter type-id='type-id-190' name='this' is-artificial='yes'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~GoogleInitializer' mangled-name='_ZN17GoogleInitializerD2Ev' filepath='src/base/googleinit.h' line='48' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17GoogleInitializerD2Ev'>
          <parameter type-id='type-id-190' name='this' is-artificial='yes'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='HeapCleaner' size-in-bits='8' visibility='default' filepath='./src/gperftools/heap-checker.h' line='403' column='1' id='type-id-191'>
      <member-type access='private'>
        <typedef-decl name='void_function' type-id='type-id-187' filepath='./src/gperftools/heap-checker.h' line='405' column='1' id='type-id-192'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='heap_cleanups_' type-id='type-id-193' mangled-name='_ZN11HeapCleaner14heap_cleanups_E' visibility='default' filepath='./src/gperftools/heap-checker.h' line='409' column='1' elf-symbol-id='_ZN11HeapCleaner14heap_cleanups_E'/>
      </data-member>
      <member-function access='private' static='yes'>
        <function-decl name='RunHeapCleanups' mangled-name='_ZN11HeapCleaner15RunHeapCleanupsEv' filepath='src/heap-checker.cc' line='1917' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11HeapCleaner15RunHeapCleanupsEv'>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='HeapCleaner' mangled-name='_ZN11HeapCleanerC1EPFvvE' filepath='src/heap-checker.cc' line='1910' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11HeapCleanerC1EPFvvE'>
          <parameter type-id='type-id-194' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-192' name='f' filepath='src/heap-checker.cc' line='1910' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='HeapLeakChecker' size-in-bits='448' visibility='default' filepath='src/gperftools/heap-checker.h' line='78' column='1' id='type-id-195'>
      <member-type access='private'>
        <class-decl name='Disabler' size-in-bits='8' visibility='default' filepath='./src/gperftools/heap-checker.h' line='175' column='1' id='type-id-196'>
          <member-function access='private' destructor='yes'>
            <function-decl name='~Disabler' mangled-name='_ZN15HeapLeakChecker8DisablerD1Ev' filepath='src/heap-checker.cc' line='516' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker8DisablerD1Ev'>
              <parameter type-id='type-id-197' name='this' is-artificial='yes'/>
              <return type-id='type-id-58'/>
            </function-decl>
          </member-function>
          <member-function access='private' constructor='yes'>
            <function-decl name='Disabler' mangled-name='_ZN15HeapLeakChecker8DisablerC1Ev' filepath='src/heap-checker.cc' line='507' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker8DisablerC1Ev'>
              <parameter type-id='type-id-197' name='this' is-artificial='yes'/>
              <return type-id='type-id-58'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <enum-decl name='ProcMapsResult' filepath='./src/gperftools/heap-checker.h' line='301' column='1' id='type-id-198'>
          <underlying-type type-id='type-id-81'/>
          <enumerator name='PROC_MAPS_USED' value='0'/>
          <enumerator name='CANT_OPEN_PROC_MAPS' value='1'/>
          <enumerator name='NO_SHARED_LIBS_IN_PROC_MAPS' value='2'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <enum-decl name='ProcMapsTask' filepath='./src/gperftools/heap-checker.h' line='295' column='1' id='type-id-199'>
          <underlying-type type-id='type-id-81'/>
          <enumerator name='RECORD_GLOBAL_DATA' value='0'/>
          <enumerator name='DISABLE_LIBRARY_ALLOCS' value='1'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <enum-decl name='ShouldSymbolize' filepath='./src/gperftools/heap-checker.h' line='225' column='1' id='type-id-200'>
          <underlying-type type-id='type-id-81'/>
          <enumerator name='SYMBOLIZE' value='0'/>
          <enumerator name='DO_NOT_SYMBOLIZE' value='1'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='Allocator' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/heap-checker.cc' line='292' column='1' id='type-id-201'>
          <data-member access='private' static='yes'>
            <var-decl name='arena_' type-id='type-id-75' mangled-name='_ZN15HeapLeakChecker9Allocator6arena_E' visibility='default' filepath='src/heap-checker.cc' line='333' column='1' elf-symbol-id='_ZN15HeapLeakChecker9Allocator6arena_E'/>
          </data-member>
          <data-member access='private' static='yes'>
            <var-decl name='alloc_count_' type-id='type-id-1' mangled-name='_ZN15HeapLeakChecker9Allocator12alloc_count_E' visibility='default' filepath='src/heap-checker.cc' line='334' column='1' elf-symbol-id='_ZN15HeapLeakChecker9Allocator12alloc_count_E'/>
          </data-member>
          <member-function access='public' static='yes'>
            <function-decl name='Allocate' mangled-name='_ZN15HeapLeakChecker9Allocator8AllocateEm' filepath='src/heap-checker.cc' line='309' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker9Allocator8AllocateEm'>
              <parameter type-id='type-id-61' name='n' filepath='src/heap-checker.cc' line='309' column='1'/>
              <return type-id='type-id-56'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='Free' mangled-name='_ZN15HeapLeakChecker9Allocator4FreeEPv' filepath='src/heap-checker.cc' line='315' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker9Allocator4FreeEPv'>
              <parameter type-id='type-id-56' name='p' filepath='src/heap-checker.cc' line='315' column='1'/>
              <return type-id='type-id-58'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='RangeValue' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/heap-checker.cc' line='404' column='1' id='type-id-202'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='start_address' type-id='type-id-203' visibility='default' filepath='src/heap-checker.cc' line='405' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='max_depth' type-id='type-id-1' visibility='default' filepath='src/heap-checker.cc' line='406' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='lock_' type-id='type-id-204' visibility='default' filepath='./src/gperftools/heap-checker.h' line='358' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='name_' type-id='type-id-60' visibility='default' filepath='./src/gperftools/heap-checker.h' line='359' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='start_snapshot_' type-id='type-id-56' visibility='default' filepath='./src/gperftools/heap-checker.h' line='365' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='has_checked_' type-id='type-id-59' visibility='default' filepath='./src/gperftools/heap-checker.h' line='367' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='inuse_bytes_increase_' type-id='type-id-205' visibility='default' filepath='./src/gperftools/heap-checker.h' line='368' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='inuse_allocs_increase_' type-id='type-id-205' visibility='default' filepath='./src/gperftools/heap-checker.h' line='369' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='keep_profiles_' type-id='type-id-59' visibility='default' filepath='./src/gperftools/heap-checker.h' line='371' column='1'/>
      </data-member>
      <member-function access='private' static='yes'>
        <function-decl name='DisableChecksIn' mangled-name='_ZN15HeapLeakChecker15DisableChecksInEPKc' filepath='src/heap-checker.cc' line='1514' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker15DisableChecksInEPKc'>
          <parameter type-id='type-id-60' name='pattern' filepath='src/heap-checker.cc' line='1514' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='BeforeConstructorsLocked' mangled-name='_ZN15HeapLeakChecker24BeforeConstructorsLockedEv' filepath='src/heap-checker.cc' line='2203' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker24BeforeConstructorsLockedEv'>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='MakeProfileNameLocked' mangled-name='_ZN15HeapLeakChecker21MakeProfileNameLockedEv' filepath='src/heap-checker.cc' line='1564' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker21MakeProfileNameLockedEv'>
          <parameter type-id='type-id-206' name='this' is-artificial='yes'/>
          <return type-id='type-id-99'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DisableChecksFromToLocked' mangled-name='_ZN15HeapLeakChecker25DisableChecksFromToLockedEPKvS1_i' filepath='src/heap-checker.cc' line='2336' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker25DisableChecksFromToLockedEPKvS1_i'>
          <parameter type-id='type-id-56' name='start_address' filepath='src/heap-checker.cc' line='2336' column='1'/>
          <parameter type-id='type-id-56' name='end_address' filepath='src/heap-checker.cc' line='2337' column='1'/>
          <parameter type-id='type-id-1' name='max_depth' filepath='src/heap-checker.cc' line='2338' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DisableLibraryAllocsLocked' mangled-name='_ZN15HeapLeakChecker26DisableLibraryAllocsLockedEPKcmm' filepath='src/heap-checker.cc' line='827' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker26DisableLibraryAllocsLockedEPKcmm'>
          <parameter type-id='type-id-60' name='library' filepath='src/heap-checker.cc' line='827' column='1'/>
          <parameter type-id='type-id-203' name='start_address' filepath='src/heap-checker.cc' line='828' column='1'/>
          <parameter type-id='type-id-203' name='end_address' filepath='src/heap-checker.cc' line='829' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='TurnItselfOffLocked' mangled-name='_ZN15HeapLeakChecker19TurnItselfOffLockedEv' filepath='src/heap-checker.cc' line='2229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker19TurnItselfOffLockedEv'>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IgnoreLiveObjectsLocked' mangled-name='_ZN15HeapLeakChecker23IgnoreLiveObjectsLockedEPKcS1_' filepath='src/heap-checker.cc' line='1392' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker23IgnoreLiveObjectsLockedEPKcS1_'>
          <parameter type-id='type-id-60' name='name' filepath='src/heap-checker.cc' line='1392' column='1'/>
          <parameter type-id='type-id-60' name='name2' filepath='src/heap-checker.cc' line='1393' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='GetAllocCaller' mangled-name='_ZN15HeapLeakChecker14GetAllocCallerEPv' filepath='src/heap-checker.cc' line='2380' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker14GetAllocCallerEPv'>
          <parameter type-id='type-id-56' name='ptr' filepath='src/heap-checker.cc' line='2380' column='1'/>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='CancelGlobalCheck' mangled-name='_ZN15HeapLeakChecker17CancelGlobalCheckEv' filepath='src/heap-checker.cc' line='2193' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker17CancelGlobalCheckEv'>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='GlobalChecker' mangled-name='_ZN15HeapLeakChecker13GlobalCheckerEv' filepath='src/heap-checker.cc' line='2181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker13GlobalCheckerEv'>
          <return type-id='type-id-206'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IsActive' mangled-name='_ZN15HeapLeakChecker8IsActiveEv' filepath='src/heap-checker.cc' line='1901' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker8IsActiveEv'>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='ObjectsLeaked' mangled-name='_ZNK15HeapLeakChecker13ObjectsLeakedEv' filepath='src/heap-checker.cc' line='1645' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15HeapLeakChecker13ObjectsLeakedEv'>
          <parameter type-id='type-id-207' name='this' is-artificial='yes'/>
          <return type-id='type-id-205'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='BytesLeaked' mangled-name='_ZNK15HeapLeakChecker11BytesLeakedEv' filepath='src/heap-checker.cc' line='1637' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15HeapLeakChecker11BytesLeakedEv'>
          <parameter type-id='type-id-207' name='this' is-artificial='yes'/>
          <return type-id='type-id-205'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='UnIgnoreObject' mangled-name='_ZN15HeapLeakChecker14UnIgnoreObjectEPKv' filepath='src/heap-checker.cc' line='1539' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker14UnIgnoreObjectEPKv'>
          <parameter type-id='type-id-56' name='ptr' filepath='src/heap-checker.cc' line='1539' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~HeapLeakChecker' mangled-name='_ZN15HeapLeakCheckerD1Ev' filepath='src/heap-checker.cc' line='1875' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakCheckerD1Ev'>
          <parameter type-id='type-id-206' name='this' is-artificial='yes'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IgnoreNonThreadLiveObjectsLocked' mangled-name='_ZN15HeapLeakChecker32IgnoreNonThreadLiveObjectsLockedEv' filepath='src/heap-checker.cc' line='1093' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker32IgnoreNonThreadLiveObjectsLockedEv'>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DoIgnoreObject' mangled-name='_ZN15HeapLeakChecker14DoIgnoreObjectEPKv' filepath='src/heap-checker.cc' line='1519' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker14DoIgnoreObjectEPKv'>
          <parameter type-id='type-id-56' name='ptr' filepath='src/heap-checker.cc' line='1519' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Create' mangled-name='_ZN15HeapLeakChecker6CreateEPKcb' filepath='src/heap-checker.cc' line='1576' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker6CreateEPKcb'>
          <parameter type-id='type-id-206' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-60' name='name' filepath='src/heap-checker.cc' line='1576' column='1'/>
          <parameter type-id='type-id-59' name='make_start_snapshot' filepath='src/heap-checker.cc' line='1576' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='HeapLeakChecker' mangled-name='_ZN15HeapLeakCheckerC1Ev' filepath='src/heap-checker.cc' line='1621' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakCheckerC1Ev'>
          <parameter type-id='type-id-206' name='this' is-artificial='yes'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='HeapLeakChecker' mangled-name='_ZN15HeapLeakCheckerC1EPKc' filepath='src/heap-checker.cc' line='1616' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakCheckerC1EPKc'>
          <parameter type-id='type-id-206' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-60' name='name' filepath='src/heap-checker.cc' line='1616' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='UseProcMapsLocked' mangled-name='_ZN15HeapLeakChecker17UseProcMapsLockedENS_12ProcMapsTaskE' filepath='src/heap-checker.cc' line='892' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker17UseProcMapsLockedENS_12ProcMapsTaskE'>
          <parameter type-id='type-id-199' name='proc_maps_task' filepath='src/heap-checker.cc' line='893' column='1'/>
          <return type-id='type-id-198'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IgnoreLiveThreadsLocked' mangled-name='_ZN15HeapLeakChecker23IgnoreLiveThreadsLockedEPviPiP13__va_list_tag' filepath='src/heap-checker.cc' line='1021' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker23IgnoreLiveThreadsLockedEPviPiP13__va_list_tag'>
          <parameter type-id='type-id-56' name='parameter' filepath='src/heap-checker.cc' line='1021' column='1'/>
          <parameter type-id='type-id-1' name='num_threads' filepath='src/heap-checker.cc' line='1022' column='1'/>
          <parameter type-id='type-id-67' name='thread_pids' filepath='src/heap-checker.cc' line='1023' column='1'/>
          <parameter type-id='type-id-68'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IgnoreAllLiveObjectsLocked' mangled-name='_ZN15HeapLeakChecker26IgnoreAllLiveObjectsLockedEPKv' filepath='src/heap-checker.cc' line='1261' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker26IgnoreAllLiveObjectsLockedEPKv'>
          <parameter type-id='type-id-56' name='self_stack_top' filepath='src/heap-checker.cc' line='1261' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='DoNoLeaks' mangled-name='_ZN15HeapLeakChecker9DoNoLeaksENS_15ShouldSymbolizeE' filepath='src/heap-checker.cc' line='1712' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker9DoNoLeaksENS_15ShouldSymbolizeE'>
          <parameter type-id='type-id-206' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-200' name='should_symbolize' filepath='src/heap-checker.cc' line='1712' column='1'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='NoGlobalLeaksMaybeSymbolize' mangled-name='_ZN15HeapLeakChecker27NoGlobalLeaksMaybeSymbolizeENS_15ShouldSymbolizeE' filepath='src/heap-checker.cc' line='2141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker27NoGlobalLeaksMaybeSymbolizeENS_15ShouldSymbolizeE'>
          <parameter type-id='type-id-200' name='should_symbolize' filepath='src/heap-checker.cc' line='2142' column='1'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='NoGlobalLeaks' mangled-name='_ZN15HeapLeakChecker13NoGlobalLeaksEv' filepath='src/heap-checker.cc' line='2187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker13NoGlobalLeaksEv'>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DoMainHeapCheck' mangled-name='_ZN15HeapLeakChecker15DoMainHeapCheckEv' filepath='src/heap-checker.cc' line='2153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker15DoMainHeapCheckEv'>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='HeapProfileTable' size-in-bits='832' visibility='default' filepath='src/heap-profile-table.h' line='51' column='1' id='type-id-208'>
      <member-type access='private'>
        <class-decl name='AddNonLiveArgs' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='305' column='1' id='type-id-209'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='dest' type-id='type-id-210' visibility='default' filepath='src/heap-profile-table.h' line='306' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='base' type-id='type-id-210' visibility='default' filepath='src/heap-profile-table.h' line='307' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='AllocContextInfo' size-in-bits='320' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='77' column='1' id='type-id-211'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-212'/>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='stack_depth' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.h' line='78' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='call_stack' type-id='type-id-213' visibility='default' filepath='src/heap-profile-table.h' line='79' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='AllocInfo' size-in-bits='192' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='66' column='1' id='type-id-214'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='object_size' type-id='type-id-61' visibility='default' filepath='src/heap-profile-table.h' line='67' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='call_stack' type-id='type-id-213' visibility='default' filepath='src/heap-profile-table.h' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='stack_depth' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.h' line='69' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='160'>
            <var-decl name='live' type-id='type-id-59' visibility='default' filepath='src/heap-profile-table.h' line='70' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='168'>
            <var-decl name='ignored' type-id='type-id-59' visibility='default' filepath='src/heap-profile-table.h' line='71' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='AllocValue' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='190' column='1' id='type-id-184'>
          <member-type access='private'>
            <typedef-decl name='Bucket' type-id='type-id-216' filepath='src/heap-profile-table.h' line='187' column='1' id='type-id-215'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='bytes' type-id='type-id-61' visibility='default' filepath='src/heap-profile-table.h' line='197' column='1'/>
          </data-member>
          <data-member access='private' static='yes'>
            <var-decl name='kLive' type-id='type-id-128' visibility='default' filepath='src/heap-profile-table.h' line='214' column='1'/>
          </data-member>
          <data-member access='private' static='yes'>
            <var-decl name='kIgnore' type-id='type-id-128' visibility='default' filepath='src/heap-profile-table.h' line='215' column='1'/>
          </data-member>
          <data-member access='private' static='yes'>
            <var-decl name='kMask' type-id='type-id-128' visibility='default' filepath='src/heap-profile-table.h' line='216' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='64'>
            <var-decl name='bucket_rep' type-id='type-id-203' visibility='default' filepath='src/heap-profile-table.h' line='218' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='BufferArgs' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='227' column='1' id='type-id-217'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='buf' type-id='type-id-99' visibility='default' filepath='src/heap-profile-table.h' line='234' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='buflen' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.h' line='235' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='96'>
            <var-decl name='bufsize' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.h' line='236' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='DumpArgs' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='242' column='1' id='type-id-218'>
          <member-type access='public'>
            <typedef-decl name='Stats' type-id='type-id-212' filepath='src/heap-profile-table.h' line='63' column='1' id='type-id-219'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='fd' type-id='type-id-71' visibility='default' filepath='src/heap-profile-table.h' line='248' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='profile_stats' type-id='type-id-220' visibility='default' filepath='src/heap-profile-table.h' line='249' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='Snapshot' size-in-bits='768' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='347' column='1' id='type-id-221'>
          <member-type access='private'>
            <class-decl name='Entry' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/heap-profile-table.cc' line='514' column='1' id='type-id-222'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='count' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.cc' line='515' column='1'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='32'>
                <var-decl name='bytes' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.cc' line='516' column='1'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='64'>
                <var-decl name='bucket' type-id='type-id-223' visibility='default' filepath='src/heap-profile-table.cc' line='517' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <member-type access='private'>
            <class-decl name='ReportState' size-in-bits='384' is-struct='yes' visibility='default' filepath='src/heap-profile-table.cc' line='528' column='1' id='type-id-224'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='buckets_' type-id='type-id-225' visibility='default' filepath='src/heap-profile-table.cc' line='529' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='total_' type-id='type-id-215' visibility='default' filepath='src/heap-profile-table.h' line='372' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='448'>
            <var-decl name='map_' type-id='type-id-226' visibility='default' filepath='src/heap-profile-table.h' line='376' column='1'/>
          </data-member>
          <member-function access='private' static='yes'>
            <function-decl name='ReportObject' mangled-name='_ZN16HeapProfileTable8Snapshot12ReportObjectEPKvPNS_10AllocValueEPc' filepath='src/heap-profile-table.cc' line='614' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable8Snapshot12ReportObjectEPKvPNS_10AllocValueEPc'>
              <parameter type-id='type-id-56' name='ptr' filepath='src/heap-profile-table.cc' line='614' column='1'/>
              <parameter type-id='type-id-227' name='v' filepath='src/heap-profile-table.cc' line='615' column='1'/>
              <parameter type-id='type-id-99' name='unused' filepath='src/heap-profile-table.cc' line='616' column='1'/>
              <return type-id='type-id-58'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='ReportIndividualObjects' mangled-name='_ZN16HeapProfileTable8Snapshot23ReportIndividualObjectsEv' filepath='src/heap-profile-table.cc' line='622' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable8Snapshot23ReportIndividualObjectsEv'>
              <parameter type-id='type-id-210' name='this' is-artificial='yes'/>
              <return type-id='type-id-58'/>
            </function-decl>
          </member-function>
          <member-function access='private' static='yes'>
            <function-decl name='ReportCallback' mangled-name='_ZN16HeapProfileTable8Snapshot14ReportCallbackEPKvPNS_10AllocValueEPNS0_11ReportStateE' filepath='src/heap-profile-table.cc' line='533' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable8Snapshot14ReportCallbackEPKvPNS_10AllocValueEPNS0_11ReportStateE'>
              <parameter type-id='type-id-56' name='ptr' filepath='src/heap-profile-table.cc' line='533' column='1'/>
              <parameter type-id='type-id-227' name='v' filepath='src/heap-profile-table.cc' line='534' column='1'/>
              <parameter type-id='type-id-228' name='state' filepath='src/heap-profile-table.cc' line='535' column='1'/>
              <return type-id='type-id-58'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='ReportLeaks' mangled-name='_ZN16HeapProfileTable8Snapshot11ReportLeaksEPKcS2_b' filepath='src/heap-profile-table.cc' line='542' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable8Snapshot11ReportLeaksEPKcS2_b'>
              <parameter type-id='type-id-210' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-60' name='checker_name' filepath='src/heap-profile-table.cc' line='542' column='1'/>
              <parameter type-id='type-id-60' name='filename' filepath='src/heap-profile-table.cc' line='543' column='1'/>
              <parameter type-id='type-id-59' name='should_symbolize' filepath='src/heap-profile-table.cc' line='544' column='1'/>
              <return type-id='type-id-58'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='AllocContextIterator' type-id='type-id-230' filepath='src/heap-profile-table.h' line='147' column='1' id='type-id-229'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='AllocIterator' type-id='type-id-232' filepath='src/heap-profile-table.h' line='138' column='1' id='type-id-231'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='AllocationMap' type-id='type-id-170' filepath='src/heap-profile-table.h' line='224' column='1' id='type-id-226'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='Allocator' type-id='type-id-180' filepath='src/heap-profile-table.h' line='83' column='1' id='type-id-233'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='DeAllocator' type-id='type-id-181' filepath='src/heap-profile-table.h' line='84' column='1' id='type-id-234'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='kFileExt' type-id='type-id-168' mangled-name='_ZN16HeapProfileTable8kFileExtE' visibility='default' filepath='src/heap-profile-table.h' line='55' column='1' elf-symbol-id='_ZN16HeapProfileTable8kFileExtE'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kMaxStackDepth' type-id='type-id-128' mangled-name='_ZN16HeapProfileTable14kMaxStackDepthE' visibility='default' filepath='src/heap-profile-table.h' line='58' column='1' elf-symbol-id='_ZN16HeapProfileTable14kMaxStackDepthE'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='alloc_' type-id='type-id-233' visibility='default' filepath='src/heap-profile-table.h' line='325' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='dealloc_' type-id='type-id-234' visibility='default' filepath='src/heap-profile-table.h' line='326' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='total_' type-id='type-id-215' visibility='default' filepath='src/heap-profile-table.h' line='330' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='profile_mmap_' type-id='type-id-59' visibility='default' filepath='src/heap-profile-table.h' line='332' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='640'>
        <var-decl name='bucket_table_' type-id='type-id-235' visibility='default' filepath='src/heap-profile-table.h' line='338' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='704'>
        <var-decl name='num_buckets_' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.h' line='339' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <var-decl name='address_map_' type-id='type-id-236' visibility='default' filepath='src/heap-profile-table.h' line='342' column='1'/>
      </data-member>
      <member-function access='private' static='yes'>
        <function-decl name='MapArgsAllocIterator' mangled-name='_ZN16HeapProfileTable20MapArgsAllocIteratorEPKvPNS_10AllocValueEPFvS1_RKNS_9AllocInfoEE' filepath='src/heap-profile-table.h' line='276' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable20MapArgsAllocIteratorEPKvPNS_10AllocValueEPFvS1_RKNS_9AllocInfoEE'>
          <parameter type-id='type-id-56' name='ptr' filepath='src/heap-profile-table.h' line='276' column='1'/>
          <parameter type-id='type-id-227' name='v' filepath='src/heap-profile-table.h' line='276' column='1'/>
          <parameter type-id='type-id-231' name='callback' filepath='src/heap-profile-table.h' line='277' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='AllocValueSize' mangled-name='_ZN16HeapProfileTable14AllocValueSizeERKNS_10AllocValueE' filepath='src/heap-profile-table.h' line='222' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable14AllocValueSizeERKNS_10AllocValueE'>
          <parameter type-id='type-id-237' name='v' filepath='src/heap-profile-table.h' line='222' column='1'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~HeapProfileTable' mangled-name='_ZN16HeapProfileTableD1Ev' filepath='src/heap-profile-table.cc' line='148' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTableD1Ev'>
          <parameter type-id='type-id-238' name='this' is-artificial='yes'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='ReleaseSnapshot' mangled-name='_ZN16HeapProfileTable15ReleaseSnapshotEPNS_8SnapshotE' filepath='src/heap-profile-table.cc' line='485' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable15ReleaseSnapshotEPNS_8SnapshotE'>
          <parameter type-id='type-id-238' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-210' name='s' filepath='src/heap-profile-table.cc' line='485' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='HeapProfileTable' mangled-name='_ZN16HeapProfileTableC2EPFPvmEPFvS0_Eb' filepath='src/heap-profile-table.cc' line='125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTableC2EPFPvmEPFvS0_Eb'>
          <parameter type-id='type-id-238' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-233' name='alloc' filepath='src/heap-profile-table.cc' line='125' column='1'/>
          <parameter type-id='type-id-234' name='dealloc' filepath='src/heap-profile-table.cc' line='126' column='1'/>
          <parameter type-id='type-id-59' name='profile_mmap' filepath='src/heap-profile-table.cc' line='127' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='UnparseBucket' mangled-name='_ZN16HeapProfileTable13UnparseBucketERK17HeapProfileBucketPciiPKcP16HeapProfileStats' filepath='src/heap-profile-table.cc' line='280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable13UnparseBucketERK17HeapProfileBucketPciiPKcP16HeapProfileStats'>
          <parameter type-id='type-id-239' name='b' filepath='src/heap-profile-table.cc' line='280' column='1'/>
          <parameter type-id='type-id-99' name='buf' filepath='src/heap-profile-table.cc' line='281' column='1'/>
          <parameter type-id='type-id-1' name='buflen' filepath='src/heap-profile-table.cc' line='281' column='1'/>
          <parameter type-id='type-id-1' name='bufsize' filepath='src/heap-profile-table.cc' line='281' column='1'/>
          <parameter type-id='type-id-60' name='extra' filepath='src/heap-profile-table.cc' line='282' column='1'/>
          <parameter type-id='type-id-220' name='profile_stats' filepath='src/heap-profile-table.cc' line='283' column='1'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DumpNonLiveIterator' mangled-name='_ZN16HeapProfileTable19DumpNonLiveIteratorEPKvPNS_10AllocValueERKNS_8DumpArgsE' filepath='src/heap-profile-table.cc' line='397' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable19DumpNonLiveIteratorEPKvPNS_10AllocValueERKNS_8DumpArgsE'>
          <parameter type-id='type-id-56' name='ptr' filepath='src/heap-profile-table.cc' line='397' column='1'/>
          <parameter type-id='type-id-227' name='v' filepath='src/heap-profile-table.cc' line='397' column='1'/>
          <parameter type-id='type-id-240' name='args' filepath='src/heap-profile-table.cc' line='398' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DumpBucketIterator' mangled-name='_ZN16HeapProfileTable18DumpBucketIteratorEPK17HeapProfileBucketPNS_10BufferArgsE' filepath='src/heap-profile-table.cc' line='390' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable18DumpBucketIteratorEPK17HeapProfileBucketPNS_10BufferArgsE'>
          <parameter type-id='type-id-241' name='bucket' filepath='src/heap-profile-table.cc' line='390' column='1'/>
          <parameter type-id='type-id-242' name='args' filepath='src/heap-profile-table.cc' line='391' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='GetBucket' mangled-name='_ZN16HeapProfileTable9GetBucketEiPKPKv' filepath='src/heap-profile-table.cc' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable9GetBucketEiPKPKv'>
          <parameter type-id='type-id-238' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-1' name='depth' filepath='src/heap-profile-table.cc' line='167' column='1'/>
          <parameter type-id='type-id-213' name='key' filepath='src/heap-profile-table.cc' line='168' column='1'/>
          <return type-id='type-id-223'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='GetCallerStackTrace' mangled-name='_ZN16HeapProfileTable19GetCallerStackTraceEiPPv' filepath='src/heap-profile-table.cc' line='204' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable19GetCallerStackTraceEiPPv'>
          <parameter type-id='type-id-1' name='skip_count' filepath='src/heap-profile-table.cc' line='205' column='1'/>
          <parameter type-id='type-id-243' name='stack' filepath='src/heap-profile-table.cc' line='205' column='1'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='MakeSortedBucketList' mangled-name='_ZNK16HeapProfileTable20MakeSortedBucketListEv' filepath='src/heap-profile-table.cc' line='313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable20MakeSortedBucketListEv'>
          <parameter type-id='type-id-244' name='this' is-artificial='yes'/>
          <return type-id='type-id-235'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='IterateOrderedAllocContexts' mangled-name='_ZNK16HeapProfileTable27IterateOrderedAllocContextsEPFvRKNS_16AllocContextInfoEE' filepath='src/heap-profile-table.cc' line='329' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable27IterateOrderedAllocContextsEPFvRKNS_16AllocContextInfoEE'>
          <parameter type-id='type-id-244' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-229' name='callback' filepath='src/heap-profile-table.cc' line='330' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='FillOrderedProfile' mangled-name='_ZNK16HeapProfileTable18FillOrderedProfileEPci' filepath='src/heap-profile-table.cc' line='342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable18FillOrderedProfileEPci'>
          <parameter type-id='type-id-244' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-99' name='buf' filepath='src/heap-profile-table.cc' line='342' column='1'/>
          <parameter type-id='type-id-1' name='size' filepath='src/heap-profile-table.cc' line='342' column='1'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='MarkAsIgnored' mangled-name='_ZN16HeapProfileTable13MarkAsIgnoredEPKv' filepath='src/heap-profile-table.cc' line='272' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable13MarkAsIgnoredEPKv'>
          <parameter type-id='type-id-238' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-56' name='ptr' filepath='src/heap-profile-table.cc' line='272' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='WriteProfile' mangled-name='_ZN16HeapProfileTable12WriteProfileEPKcRK17HeapProfileBucketP10AddressMapINS_10AllocValueEE' filepath='src/heap-profile-table.cc' line='432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable12WriteProfileEPKcRK17HeapProfileBucketP10AddressMapINS_10AllocValueEE'>
          <parameter type-id='type-id-60' name='file_name' filepath='src/heap-profile-table.cc' line='432' column='1'/>
          <parameter type-id='type-id-239' name='total' filepath='src/heap-profile-table.cc' line='433' column='1'/>
          <parameter type-id='type-id-236' name='allocations' filepath='src/heap-profile-table.cc' line='434' column='1'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='FindInsideAlloc' mangled-name='_ZNK16HeapProfileTable15FindInsideAllocEPKvmPS1_Pm' filepath='src/heap-profile-table.cc' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable15FindInsideAllocEPKvmPS1_Pm'>
          <parameter type-id='type-id-244' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-56' name='ptr' filepath='src/heap-profile-table.cc' line='253' column='1'/>
          <parameter type-id='type-id-61' name='max_size' filepath='src/heap-profile-table.cc' line='254' column='1'/>
          <parameter type-id='type-id-243' name='object_ptr' filepath='src/heap-profile-table.cc' line='255' column='1'/>
          <parameter type-id='type-id-245' name='object_size' filepath='src/heap-profile-table.cc' line='256' column='1'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='AddToSnapshot' mangled-name='_ZN16HeapProfileTable13AddToSnapshotEPKvPNS_10AllocValueEPNS_8SnapshotE' filepath='src/heap-profile-table.cc' line='491' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable13AddToSnapshotEPKvPNS_10AllocValueEPNS_8SnapshotE'>
          <parameter type-id='type-id-56' name='ptr' filepath='src/heap-profile-table.cc' line='491' column='1'/>
          <parameter type-id='type-id-227' name='v' filepath='src/heap-profile-table.cc' line='491' column='1'/>
          <parameter type-id='type-id-210' name='snapshot' filepath='src/heap-profile-table.cc' line='492' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='TakeSnapshot' mangled-name='_ZN16HeapProfileTable12TakeSnapshotEv' filepath='src/heap-profile-table.cc' line='479' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable12TakeSnapshotEv'>
          <parameter type-id='type-id-238' name='this' is-artificial='yes'/>
          <return type-id='type-id-210'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='RecordAlloc' mangled-name='_ZN16HeapProfileTable11RecordAllocEPKvmiPKS1_' filepath='src/heap-profile-table.cc' line='210' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable11RecordAllocEPKvmiPKS1_'>
          <parameter type-id='type-id-238' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-56' name='ptr' filepath='src/heap-profile-table.cc' line='211' column='1'/>
          <parameter type-id='type-id-61' name='bytes' filepath='src/heap-profile-table.cc' line='211' column='1'/>
          <parameter type-id='type-id-1' name='stack_depth' filepath='src/heap-profile-table.cc' line='211' column='1'/>
          <parameter type-id='type-id-213' name='call_stack' filepath='src/heap-profile-table.cc' line='212' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='RecordFree' mangled-name='_ZN16HeapProfileTable10RecordFreeEPKv' filepath='src/heap-profile-table.cc' line='225' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable10RecordFreeEPKv'>
          <parameter type-id='type-id-238' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-56' name='ptr' filepath='src/heap-profile-table.cc' line='225' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='AddIfNonLive' mangled-name='_ZN16HeapProfileTable12AddIfNonLiveEPKvPNS_10AllocValueEPNS_14AddNonLiveArgsE' filepath='src/heap-profile-table.cc' line='419' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable12AddIfNonLiveEPKvPNS_10AllocValueEPNS_14AddNonLiveArgsE'>
          <parameter type-id='type-id-56' name='ptr' filepath='src/heap-profile-table.cc' line='419' column='1'/>
          <parameter type-id='type-id-227' name='v' filepath='src/heap-profile-table.cc' line='419' column='1'/>
          <parameter type-id='type-id-246' name='arg' filepath='src/heap-profile-table.cc' line='420' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='NonLiveSnapshot' mangled-name='_ZN16HeapProfileTable15NonLiveSnapshotEPNS_8SnapshotE' filepath='src/heap-profile-table.cc' line='496' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable15NonLiveSnapshotEPNS_8SnapshotE'>
          <parameter type-id='type-id-238' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-210' name='base' filepath='src/heap-profile-table.cc' line='497' column='1'/>
          <return type-id='type-id-210'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='MarkAsLive' mangled-name='_ZN16HeapProfileTable10MarkAsLiveEPKv' filepath='src/heap-profile-table.cc' line='263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable10MarkAsLiveEPKv'>
          <parameter type-id='type-id-238' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-56' name='ptr' filepath='src/heap-profile-table.cc' line='263' column='1'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='CleanupOldProfiles' mangled-name='_ZN16HeapProfileTable18CleanupOldProfilesEPKc' filepath='src/heap-profile-table.cc' line='455' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable18CleanupOldProfilesEPKc'>
          <parameter type-id='type-id-60' name='prefix' filepath='src/heap-profile-table.cc' line='455' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='FindAllocDetails' mangled-name='_ZNK16HeapProfileTable16FindAllocDetailsEPKvPNS_9AllocInfoE' filepath='src/heap-profile-table.cc' line='242' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable16FindAllocDetailsEPKvPNS_9AllocInfoE'>
          <parameter type-id='type-id-244' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-56' name='ptr' filepath='src/heap-profile-table.cc' line='242' column='1'/>
          <parameter type-id='type-id-247' name='info' filepath='src/heap-profile-table.cc' line='243' column='1'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='FindAlloc' mangled-name='_ZNK16HeapProfileTable9FindAllocEPKvPm' filepath='src/heap-profile-table.cc' line='236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable9FindAllocEPKvPm'>
          <parameter type-id='type-id-244' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-56' name='ptr' filepath='src/heap-profile-table.cc' line='236' column='1'/>
          <parameter type-id='type-id-245' name='object_size' filepath='src/heap-profile-table.cc' line='236' column='1'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='LowLevelAlloc' size-in-bits='8' visibility='default' filepath='src/base/low_level_alloc.h' line='44' column='1' id='type-id-248'>
      <member-type access='private'>
        <class-decl name='Arena' size-in-bits='2560' is-struct='yes' visibility='default' filepath='src/base/low_level_alloc.cc' line='184' column='1' id='type-id-249'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='mu' type-id='type-id-250' visibility='default' filepath='src/base/low_level_alloc.cc' line='189' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='freelist' type-id='type-id-77' visibility='default' filepath='src/base/low_level_alloc.cc' line='191' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2304'>
            <var-decl name='allocation_count' type-id='type-id-69' visibility='default' filepath='src/base/low_level_alloc.cc' line='192' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2336'>
            <var-decl name='flags' type-id='type-id-69' visibility='default' filepath='src/base/low_level_alloc.cc' line='193' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2368'>
            <var-decl name='pagesize' type-id='type-id-61' visibility='default' filepath='src/base/low_level_alloc.cc' line='194' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2432'>
            <var-decl name='roundup' type-id='type-id-61' visibility='default' filepath='src/base/low_level_alloc.cc' line='195' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2496'>
            <var-decl name='min_size' type-id='type-id-61' visibility='default' filepath='src/base/low_level_alloc.cc' line='197' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-function access='private' static='yes'>
        <function-decl name='DefaultArena' mangled-name='_ZN13LowLevelAlloc12DefaultArenaEv' filepath='src/base/low_level_alloc.cc' line='521' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc12DefaultArenaEv'>
          <return type-id='type-id-75'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='AllocWithArena' mangled-name='_ZN13LowLevelAlloc14AllocWithArenaEmPNS_5ArenaE' filepath='src/base/low_level_alloc.cc' line='510' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc14AllocWithArenaEmPNS_5ArenaE'>
          <parameter type-id='type-id-61' name='request' filepath='src/base/low_level_alloc.cc' line='510' column='1'/>
          <parameter type-id='type-id-75' name='arena' filepath='src/base/low_level_alloc.cc' line='510' column='1'/>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='NewArena' mangled-name='_ZN13LowLevelAlloc8NewArenaEiPNS_5ArenaE' filepath='src/base/low_level_alloc.cc' line='296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc8NewArenaEiPNS_5ArenaE'>
          <parameter type-id='type-id-69' name='flags' filepath='src/base/low_level_alloc.cc' line='296' column='1'/>
          <parameter type-id='type-id-75' name='meta_data_arena' filepath='src/base/low_level_alloc.cc' line='297' column='1'/>
          <return type-id='type-id-75'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='Alloc' mangled-name='_ZN13LowLevelAlloc5AllocEm' filepath='src/base/low_level_alloc.cc' line='500' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc5AllocEm'>
          <parameter type-id='type-id-61' name='request' filepath='src/base/low_level_alloc.cc' line='500' column='1'/>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='Free' mangled-name='_ZN13LowLevelAlloc4FreeEPv' filepath='src/base/low_level_alloc.cc' line='415' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc4FreeEPv'>
          <parameter type-id='type-id-56' name='v' filepath='src/base/low_level_alloc.cc' line='415' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DeleteArena' mangled-name='_ZN13LowLevelAlloc11DeleteArenaEPNS_5ArenaE' filepath='src/base/low_level_alloc.cc' line='315' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc11DeleteArenaEPNS_5ArenaE'>
          <parameter type-id='type-id-75' name='arena' filepath='src/base/low_level_alloc.cc' line='315' column='1'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='MemoryRegionMap' size-in-bits='8' visibility='default' filepath='src/memory_region_map.h' line='69' column='1' id='type-id-251'>
      <member-type access='private'>
        <class-decl name='LockHolder' size-in-bits='8' visibility='default' filepath='src/memory_region_map.h' line='126' column='1' id='type-id-252'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='MyAllocator' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/memory_region_map.h' line='252' column='1' id='type-id-253'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='Region' size-in-bits='2304' is-struct='yes' visibility='default' filepath='src/memory_region_map.h' line='137' column='1' id='type-id-254'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='start_addr' type-id='type-id-203' visibility='default' filepath='src/memory_region_map.h' line='138' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='end_addr' type-id='type-id-203' visibility='default' filepath='src/memory_region_map.h' line='139' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='call_stack_depth' type-id='type-id-1' visibility='default' filepath='src/memory_region_map.h' line='140' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='call_stack' type-id='type-id-255' visibility='default' filepath='src/memory_region_map.h' line='141' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2240'>
            <var-decl name='is_stack' type-id='type-id-59' visibility='default' filepath='src/memory_region_map.h' line='143' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='RegionCmp' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/memory_region_map.h' line='245' column='1' id='type-id-256'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='RegionIterator' type-id='type-id-258' filepath='src/memory_region_map.h' line='268' column='1' id='type-id-257'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='RegionSet' type-id='type-id-260' filepath='src/memory_region_map.h' line='263' column='1' id='type-id-259'/>
      </member-type>
      <member-type access='private'>
        <union-decl name='RegionSetRep' size-in-bits='384' visibility='default' filepath='src/memory_region_map.cc' line='177' column='1' id='type-id-261'>
          <data-member access='public'>
            <var-decl name='rep' type-id='type-id-262' visibility='default' filepath='src/memory_region_map.cc' line='178' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='align_it' type-id='type-id-56' visibility='default' filepath='src/memory_region_map.cc' line='179' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='client_count_' type-id='type-id-1' mangled-name='_ZN15MemoryRegionMap13client_count_E' visibility='default' filepath='src/memory_region_map.h' line='292' column='1' elf-symbol-id='_ZN15MemoryRegionMap13client_count_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='max_stack_depth_' type-id='type-id-1' mangled-name='_ZN15MemoryRegionMap16max_stack_depth_E' visibility='default' filepath='src/memory_region_map.h' line='295' column='1' elf-symbol-id='_ZN15MemoryRegionMap16max_stack_depth_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='arena_' type-id='type-id-75' mangled-name='_ZN15MemoryRegionMap6arena_E' visibility='default' filepath='src/memory_region_map.h' line='298' column='1' elf-symbol-id='_ZN15MemoryRegionMap6arena_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='regions_' type-id='type-id-263' mangled-name='_ZN15MemoryRegionMap8regions_E' visibility='default' filepath='src/memory_region_map.h' line='306' column='1' elf-symbol-id='_ZN15MemoryRegionMap8regions_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='lock_' type-id='type-id-250' mangled-name='_ZN15MemoryRegionMap5lock_E' visibility='default' filepath='src/memory_region_map.h' line='309' column='1' elf-symbol-id='_ZN15MemoryRegionMap5lock_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='owner_lock_' type-id='type-id-250' mangled-name='_ZN15MemoryRegionMap11owner_lock_E' visibility='default' filepath='src/memory_region_map.h' line='311' column='1' elf-symbol-id='_ZN15MemoryRegionMap11owner_lock_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='recursion_count_' type-id='type-id-1' mangled-name='_ZN15MemoryRegionMap16recursion_count_E' visibility='default' filepath='src/memory_region_map.h' line='314' column='1' elf-symbol-id='_ZN15MemoryRegionMap16recursion_count_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='lock_owner_tid_' type-id='type-id-264' mangled-name='_ZN15MemoryRegionMap15lock_owner_tid_E' visibility='default' filepath='src/memory_region_map.h' line='316' column='1' elf-symbol-id='_ZN15MemoryRegionMap15lock_owner_tid_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='map_size_' type-id='type-id-87' mangled-name='_ZN15MemoryRegionMap9map_size_E' visibility='default' filepath='src/memory_region_map.h' line='319' column='1' elf-symbol-id='_ZN15MemoryRegionMap9map_size_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='unmap_size_' type-id='type-id-87' mangled-name='_ZN15MemoryRegionMap11unmap_size_E' visibility='default' filepath='src/memory_region_map.h' line='321' column='1' elf-symbol-id='_ZN15MemoryRegionMap11unmap_size_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='bucket_table_' type-id='type-id-265' mangled-name='_ZN15MemoryRegionMap13bucket_table_E' visibility='default' filepath='src/memory_region_map.h' line='324' column='1' elf-symbol-id='_ZN15MemoryRegionMap13bucket_table_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='num_buckets_' type-id='type-id-1' mangled-name='_ZN15MemoryRegionMap12num_buckets_E' visibility='default' filepath='src/memory_region_map.h' line='325' column='1' elf-symbol-id='_ZN15MemoryRegionMap12num_buckets_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='saved_buckets_count_' type-id='type-id-1' mangled-name='_ZN15MemoryRegionMap20saved_buckets_count_E' visibility='default' filepath='src/memory_region_map.h' line='337' column='1' elf-symbol-id='_ZN15MemoryRegionMap20saved_buckets_count_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='saved_buckets_' type-id='type-id-266' mangled-name='_ZN15MemoryRegionMap14saved_buckets_E' visibility='default' filepath='src/memory_region_map.h' line='343' column='1' elf-symbol-id='_ZN15MemoryRegionMap14saved_buckets_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='saved_buckets_keys_' type-id='type-id-267' mangled-name='_ZN15MemoryRegionMap19saved_buckets_keys_E' visibility='default' filepath='src/memory_region_map.h' line='345' column='1' elf-symbol-id='_ZN15MemoryRegionMap19saved_buckets_keys_E'/>
      </data-member>
      <member-function access='private' static='yes'>
        <function-decl name='HandleSavedRegionsLocked' mangled-name='_ZN15MemoryRegionMap24HandleSavedRegionsLockedEPFvRKNS_6RegionEE' filepath='src/memory_region_map.cc' line='487' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap24HandleSavedRegionsLockedEPFvRKNS_6RegionEE'>
          <parameter type-id='type-id-268' name='insert_func' filepath='src/memory_region_map.cc' line='488' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='Unlock' mangled-name='_ZN15MemoryRegionMap6UnlockEv' filepath='src/memory_region_map.cc' line='316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap6UnlockEv'>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='LockIsHeld' mangled-name='_ZN15MemoryRegionMap10LockIsHeldEv' filepath='src/memory_region_map.cc' line='328' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap10LockIsHeldEv'>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='LogAllLocked' mangled-name='_ZN15MemoryRegionMap12LogAllLockedEv' filepath='src/memory_region_map.cc' line='815' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap12LogAllLockedEv'>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DoInsertRegionLocked' mangled-name='_ZN15MemoryRegionMap20DoInsertRegionLockedERKNS_6RegionE' filepath='src/memory_region_map.cc' line='443' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap20DoInsertRegionLockedERKNS_6RegionE'>
          <parameter type-id='type-id-269' name='region' filepath='src/memory_region_map.cc' line='443' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='EndRegionLocked' mangled-name='_ZN15MemoryRegionMap15EndRegionLockedEv' filepath='src/memory_region_map.cc' line='437' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap15EndRegionLockedEv'>
          <return type-id='type-id-257'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='BeginRegionLocked' mangled-name='_ZN15MemoryRegionMap17BeginRegionLockedEv' filepath='src/memory_region_map.cc' line='431' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap17BeginRegionLockedEv'>
          <return type-id='type-id-257'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DoFindRegionLocked' mangled-name='_ZN15MemoryRegionMap18DoFindRegionLockedEm' filepath='src/memory_region_map.cc' line='334' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap18DoFindRegionLockedEm'>
          <parameter type-id='type-id-203' name='addr' filepath='src/memory_region_map.cc' line='334' column='1'/>
          <return type-id='type-id-270'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IsRecordingLocked' mangled-name='_ZN15MemoryRegionMap17IsRecordingLockedEv' filepath='src/memory_region_map.cc' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap17IsRecordingLockedEv'>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='Lock' mangled-name='_ZN15MemoryRegionMap4LockEv' filepath='src/memory_region_map.cc' line='294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap4LockEv'>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='FindAndMarkStackRegion' mangled-name='_ZN15MemoryRegionMap22FindAndMarkStackRegionEmPNS_6RegionE' filepath='src/memory_region_map.cc' line='358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap22FindAndMarkStackRegionEmPNS_6RegionE'>
          <parameter type-id='type-id-203' name='stack_top' filepath='src/memory_region_map.cc' line='358' column='1'/>
          <parameter type-id='type-id-271' name='result' filepath='src/memory_region_map.cc' line='359' column='1'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='FindRegion' mangled-name='_ZN15MemoryRegionMap10FindRegionEmPNS_6RegionE' filepath='src/memory_region_map.cc' line='350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap10FindRegionEmPNS_6RegionE'>
          <parameter type-id='type-id-203' name='addr' filepath='src/memory_region_map.cc' line='350' column='1'/>
          <parameter type-id='type-id-271' name='result' filepath='src/memory_region_map.cc' line='350' column='1'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='Shutdown' mangled-name='_ZN15MemoryRegionMap8ShutdownEv' filepath='src/memory_region_map.cc' line='239' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap8ShutdownEv'>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='Init' mangled-name='_ZN15MemoryRegionMap4InitEib' filepath='src/memory_region_map.cc' line='194' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap4InitEib'>
          <parameter type-id='type-id-1' name='max_stack_depth' filepath='src/memory_region_map.cc' line='194' column='1'/>
          <parameter type-id='type-id-59' name='use_buckets' filepath='src/memory_region_map.cc' line='194' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='RestoreSavedBucketsLocked' mangled-name='_ZN15MemoryRegionMap25RestoreSavedBucketsLockedEv' filepath='src/memory_region_map.cc' line='499' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap25RestoreSavedBucketsLockedEv'>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='GetBucket' mangled-name='_ZN15MemoryRegionMap9GetBucketEiPKPKv' filepath='src/memory_region_map.cc' line='375' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap9GetBucketEiPKPKv'>
          <parameter type-id='type-id-1' name='depth' filepath='src/memory_region_map.cc' line='375' column='1'/>
          <parameter type-id='type-id-213' name='key' filepath='src/memory_region_map.cc' line='376' column='1'/>
          <return type-id='type-id-272'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='RecordRegionRemovalInBucket' mangled-name='_ZN15MemoryRegionMap27RecordRegionRemovalInBucketEiPKPKvm' filepath='src/memory_region_map.cc' line='752' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap27RecordRegionRemovalInBucketEiPKPKvm'>
          <parameter type-id='type-id-1' name='depth' filepath='src/memory_region_map.cc' line='752' column='1'/>
          <parameter type-id='type-id-213' name='stack' filepath='src/memory_region_map.cc' line='753' column='1'/>
          <parameter type-id='type-id-61' name='size' filepath='src/memory_region_map.cc' line='754' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='InsertRegionLocked' mangled-name='_ZN15MemoryRegionMap18InsertRegionLockedERKNS_6RegionE' filepath='src/memory_region_map.cc' line='537' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap18InsertRegionLockedERKNS_6RegionE'>
          <parameter type-id='type-id-269' name='region' filepath='src/memory_region_map.cc' line='537' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='RecordRegionAddition' mangled-name='_ZN15MemoryRegionMap20RecordRegionAdditionEPKvm' filepath='src/memory_region_map.cc' line='580' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap20RecordRegionAdditionEPKvm'>
          <parameter type-id='type-id-56' name='start' filepath='src/memory_region_map.cc' line='580' column='1'/>
          <parameter type-id='type-id-61' name='size' filepath='src/memory_region_map.cc' line='580' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='MmapHook' mangled-name='_ZN15MemoryRegionMap8MmapHookEPKvS1_miiil' filepath='src/memory_region_map.cc' line='762' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap8MmapHookEPKvS1_miiil'>
          <parameter type-id='type-id-56' name='result' filepath='src/memory_region_map.cc' line='762' column='1'/>
          <parameter type-id='type-id-56' name='start' filepath='src/memory_region_map.cc' line='763' column='1'/>
          <parameter type-id='type-id-61' name='size' filepath='src/memory_region_map.cc' line='763' column='1'/>
          <parameter type-id='type-id-1' name='prot' filepath='src/memory_region_map.cc' line='764' column='1'/>
          <parameter type-id='type-id-1' name='flags' filepath='src/memory_region_map.cc' line='764' column='1'/>
          <parameter type-id='type-id-1' name='fd' filepath='src/memory_region_map.cc' line='765' column='1'/>
          <parameter type-id='type-id-273' name='offset' filepath='src/memory_region_map.cc' line='765' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='RecordRegionRemoval' mangled-name='_ZN15MemoryRegionMap19RecordRegionRemovalEPKvm' filepath='src/memory_region_map.cc' line='634' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap19RecordRegionRemovalEPKvm'>
          <parameter type-id='type-id-56' name='start' filepath='src/memory_region_map.cc' line='634' column='1'/>
          <parameter type-id='type-id-61' name='size' filepath='src/memory_region_map.cc' line='634' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='MunmapHook' mangled-name='_ZN15MemoryRegionMap10MunmapHookEPKvm' filepath='src/memory_region_map.cc' line='778' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap10MunmapHookEPKvm'>
          <parameter type-id='type-id-56' name='ptr' filepath='src/memory_region_map.cc' line='778' column='1'/>
          <parameter type-id='type-id-61' name='size' filepath='src/memory_region_map.cc' line='778' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='SbrkHook' mangled-name='_ZN15MemoryRegionMap8SbrkHookEPKvl' filepath='src/memory_region_map.cc' line='800' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap8SbrkHookEPKvl'>
          <parameter type-id='type-id-56' name='result' filepath='src/memory_region_map.cc' line='800' column='1'/>
          <parameter type-id='type-id-274' name='increment' filepath='src/memory_region_map.cc' line='800' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='MremapHook' mangled-name='_ZN15MemoryRegionMap10MremapHookEPKvS1_mmiS1_' filepath='src/memory_region_map.cc' line='785' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap10MremapHookEPKvS1_mmiS1_'>
          <parameter type-id='type-id-56' name='result' filepath='src/memory_region_map.cc' line='785' column='1'/>
          <parameter type-id='type-id-56' name='old_addr' filepath='src/memory_region_map.cc' line='786' column='1'/>
          <parameter type-id='type-id-61' name='old_size' filepath='src/memory_region_map.cc' line='786' column='1'/>
          <parameter type-id='type-id-61' name='new_size' filepath='src/memory_region_map.cc' line='787' column='1'/>
          <parameter type-id='type-id-1' name='flags' filepath='src/memory_region_map.cc' line='787' column='1'/>
          <parameter type-id='type-id-56' name='new_addr' filepath='src/memory_region_map.cc' line='788' column='1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-275'/>
    <class-decl name='STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-276'/>
    <class-decl name='STL_Allocator&lt;long unsigned int, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-277'/>
    <class-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;long unsigned int&gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-278'/>
    <class-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt; &gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-279'/>
    <class-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;const long unsigned int, long unsigned int&gt; &gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-280'/>
    <class-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt; &gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-281'/>
    <class-decl name='STL_Allocator&lt;std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-282'/>
    <class-decl name='STL_Allocator&lt;std::pair&lt;const long unsigned int, long unsigned int&gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-283'/>
    <class-decl name='STL_Allocator&lt;std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-284'/>
    <class-decl name='STL_Allocator&lt;void*, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-285'/>
    <enum-decl name='ObjectPlacement' filepath='src/heap-checker.cc' line='345' column='1' id='type-id-286'>
      <underlying-type type-id='type-id-81'/>
      <enumerator name='MUST_BE_ON_HEAP' value='0'/>
      <enumerator name='IGNORED_ON_HEAP' value='1'/>
      <enumerator name='MAYBE_LIVE' value='2'/>
      <enumerator name='IN_GLOBAL_DATA' value='3'/>
      <enumerator name='THREAD_DATA' value='4'/>
      <enumerator name='THREAD_REGISTERS' value='5'/>
    </enum-decl>
    <array-type-def dimensions='1' type-id='type-id-61' size-in-bits='256' id='type-id-287'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-21' id='type-id-288'/>
    </array-type-def>
    <class-decl name='AllocObject' size-in-bits='192' is-struct='yes' visibility='default' filepath='src/heap-checker.cc' line='356' column='1' id='type-id-289'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ptr' type-id='type-id-56' visibility='default' filepath='src/heap-checker.cc' line='357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-203' visibility='default' filepath='src/heap-checker.cc' line='358' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='place' type-id='type-id-286' visibility='default' filepath='src/heap-checker.cc' line='359' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='HeapProfileBucket' size-in-bits='448' is-struct='yes' visibility='default' filepath='src/heap-profile-stats.h' line='68' column='1' id='type-id-216'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-212'/>
      <data-member access='public' static='yes'>
        <var-decl name='kMaxStackDepth' type-id='type-id-128' visibility='default' filepath='src/heap-profile-stats.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='hash' type-id='type-id-203' visibility='default' filepath='src/heap-profile-stats.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='depth' type-id='type-id-1' visibility='default' filepath='src/heap-profile-stats.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='stack' type-id='type-id-243' visibility='default' filepath='src/heap-profile-stats.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='next' type-id='type-id-272' visibility='default' filepath='src/heap-profile-stats.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='HeapProfileStats' size-in-bits='192' is-struct='yes' visibility='default' filepath='src/heap-profile-stats.h' line='54' column='1' id='type-id-212'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='allocs' type-id='type-id-69' visibility='default' filepath='src/heap-profile-stats.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='frees' type-id='type-id-69' visibility='default' filepath='src/heap-profile-stats.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='alloc_size' type-id='type-id-87' visibility='default' filepath='src/heap-profile-stats.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='free_size' type-id='type-id-87' visibility='default' filepath='src/heap-profile-stats.h' line='64' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='AtomicWord' type-id='type-id-290' filepath='src/base/atomicops.h' line='129' column='1' id='type-id-165'/>
    <typedef-decl name='DisabledRangeMap' type-id='type-id-291' filepath='src/heap-checker.cc' line='411' column='1' id='type-id-292'/>
    <typedef-decl name='GlobalRegionCallerRangeMap' type-id='type-id-293' filepath='src/heap-checker.cc' line='432' column='1' id='type-id-294'/>
    <typedef-decl name='LibraryLiveObjectsStacks' type-id='type-id-295' filepath='src/heap-checker.cc' line='397' column='1' id='type-id-296'/>
    <typedef-decl name='LiveObjectsStack' type-id='type-id-297' filepath='src/heap-checker.cc' line='384' column='1' id='type-id-298'/>
    <typedef-decl name='MallocHook_DeleteHook' type-id='type-id-181' filepath='./src/gperftools/malloc_hook_c.h' line='76' column='1' id='type-id-299'/>
    <typedef-decl name='MallocHook_MmapHook' type-id='type-id-300' filepath='./src/gperftools/malloc_hook_c.h' line='99' column='1' id='type-id-301'/>
    <typedef-decl name='MallocHook_NewHook' type-id='type-id-302' filepath='./src/gperftools/malloc_hook_c.h' line='70' column='1' id='type-id-303'/>
    <typedef-decl name='MallocHook_SbrkHook' type-id='type-id-304' filepath='./src/gperftools/malloc_hook_c.h' line='144' column='1' id='type-id-305'/>
    <typedef-decl name='RawFD' type-id='type-id-1' filepath='./src/base/logging.h' line='251' column='1' id='type-id-71'/>
    <typedef-decl name='StackTopSet' type-id='type-id-306' filepath='src/heap-checker.cc' line='422' column='1' id='type-id-307'/>
    <typedef-decl name='__intptr_t' type-id='type-id-148' filepath='/usr/include/bits/types.h' line='189' column='1' id='type-id-308'/>
    <typedef-decl name='intptr_t' type-id='type-id-308' filepath='/usr/include/unistd.h' line='268' column='1' id='type-id-290'/>
    <typedef-decl name='off_t' type-id='type-id-141' filepath='/usr/include/sys/types.h' line='87' column='1' id='type-id-273'/>
    <array-type-def dimensions='1' type-id='type-id-56' id='type-id-255'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='type-id-21' id='type-id-309'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' id='type-id-183'/>
    <reference-type-def kind='lvalue' type-id='type-id-289' size-in-bits='64' id='type-id-310'/>
    <pointer-type-def type-id='type-id-289' size-in-bits='64' id='type-id-311'/>
    <qualified-type-def type-id='type-id-311' const='yes' id='type-id-312'/>
    <reference-type-def kind='lvalue' type-id='type-id-312' size-in-bits='64' id='type-id-313'/>
    <reference-type-def kind='lvalue' type-id='type-id-311' size-in-bits='64' id='type-id-314'/>
    <pointer-type-def type-id='type-id-292' size-in-bits='64' id='type-id-315'/>
    <pointer-type-def type-id='type-id-315' size-in-bits='64' id='type-id-316'/>
    <pointer-type-def type-id='type-id-294' size-in-bits='64' id='type-id-317'/>
    <pointer-type-def type-id='type-id-317' size-in-bits='64' id='type-id-318'/>
    <pointer-type-def type-id='type-id-185' size-in-bits='64' id='type-id-190'/>
    <qualified-type-def type-id='type-id-190' const='yes' id='type-id-319'/>
    <pointer-type-def type-id='type-id-191' size-in-bits='64' id='type-id-194'/>
    <qualified-type-def type-id='type-id-194' const='yes' id='type-id-320'/>
    <pointer-type-def type-id='type-id-195' size-in-bits='64' id='type-id-206'/>
    <qualified-type-def type-id='type-id-206' const='yes' id='type-id-321'/>
    <pointer-type-def type-id='type-id-196' size-in-bits='64' id='type-id-197'/>
    <qualified-type-def type-id='type-id-197' const='yes' id='type-id-322'/>
    <reference-type-def kind='lvalue' type-id='type-id-202' size-in-bits='64' id='type-id-323'/>
    <pointer-type-def type-id='type-id-216' size-in-bits='64' id='type-id-272'/>
    <pointer-type-def type-id='type-id-208' size-in-bits='64' id='type-id-238'/>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' id='type-id-324'/>
    <pointer-type-def type-id='type-id-209' size-in-bits='64' id='type-id-246'/>
    <pointer-type-def type-id='type-id-214' size-in-bits='64' id='type-id-247'/>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-227'/>
    <pointer-type-def type-id='type-id-215' size-in-bits='64' id='type-id-223'/>
    <pointer-type-def type-id='type-id-223' size-in-bits='64' id='type-id-235'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='64' id='type-id-236'/>
    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-242'/>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-325'/>
    <pointer-type-def type-id='type-id-219' size-in-bits='64' id='type-id-220'/>
    <pointer-type-def type-id='type-id-221' size-in-bits='64' id='type-id-210'/>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-228'/>
    <pointer-type-def type-id='type-id-296' size-in-bits='64' id='type-id-326'/>
    <pointer-type-def type-id='type-id-326' size-in-bits='64' id='type-id-327'/>
    <pointer-type-def type-id='type-id-298' size-in-bits='64' id='type-id-328'/>
    <pointer-type-def type-id='type-id-328' size-in-bits='64' id='type-id-329'/>
    <pointer-type-def type-id='type-id-249' size-in-bits='64' id='type-id-75'/>
    <pointer-type-def type-id='type-id-252' size-in-bits='64' id='type-id-330'/>
    <qualified-type-def type-id='type-id-330' const='yes' id='type-id-331'/>
    <pointer-type-def type-id='type-id-254' size-in-bits='64' id='type-id-271'/>
    <reference-type-def kind='lvalue' type-id='type-id-275' size-in-bits='64' id='type-id-332'/>
    <pointer-type-def type-id='type-id-275' size-in-bits='64' id='type-id-333'/>
    <qualified-type-def type-id='type-id-333' const='yes' id='type-id-334'/>
    <pointer-type-def type-id='type-id-276' size-in-bits='64' id='type-id-335'/>
    <qualified-type-def type-id='type-id-335' const='yes' id='type-id-336'/>
    <pointer-type-def type-id='type-id-277' size-in-bits='64' id='type-id-337'/>
    <qualified-type-def type-id='type-id-337' const='yes' id='type-id-338'/>
    <reference-type-def kind='lvalue' type-id='type-id-278' size-in-bits='64' id='type-id-339'/>
    <pointer-type-def type-id='type-id-278' size-in-bits='64' id='type-id-340'/>
    <qualified-type-def type-id='type-id-340' const='yes' id='type-id-341'/>
    <reference-type-def kind='lvalue' type-id='type-id-279' size-in-bits='64' id='type-id-342'/>
    <pointer-type-def type-id='type-id-279' size-in-bits='64' id='type-id-343'/>
    <qualified-type-def type-id='type-id-343' const='yes' id='type-id-344'/>
    <reference-type-def kind='lvalue' type-id='type-id-280' size-in-bits='64' id='type-id-345'/>
    <pointer-type-def type-id='type-id-280' size-in-bits='64' id='type-id-346'/>
    <qualified-type-def type-id='type-id-346' const='yes' id='type-id-347'/>
    <reference-type-def kind='lvalue' type-id='type-id-281' size-in-bits='64' id='type-id-348'/>
    <pointer-type-def type-id='type-id-281' size-in-bits='64' id='type-id-349'/>
    <qualified-type-def type-id='type-id-349' const='yes' id='type-id-350'/>
    <pointer-type-def type-id='type-id-282' size-in-bits='64' id='type-id-351'/>
    <qualified-type-def type-id='type-id-351' const='yes' id='type-id-352'/>
    <pointer-type-def type-id='type-id-283' size-in-bits='64' id='type-id-353'/>
    <qualified-type-def type-id='type-id-353' const='yes' id='type-id-354'/>
    <pointer-type-def type-id='type-id-284' size-in-bits='64' id='type-id-355'/>
    <qualified-type-def type-id='type-id-355' const='yes' id='type-id-356'/>
    <reference-type-def kind='lvalue' type-id='type-id-285' size-in-bits='64' id='type-id-357'/>
    <pointer-type-def type-id='type-id-285' size-in-bits='64' id='type-id-358'/>
    <qualified-type-def type-id='type-id-358' const='yes' id='type-id-359'/>
    <pointer-type-def type-id='type-id-307' size-in-bits='64' id='type-id-360'/>
    <pointer-type-def type-id='type-id-360' size-in-bits='64' id='type-id-361'/>
    <reference-type-def kind='lvalue' type-id='type-id-362' size-in-bits='64' id='type-id-363'/>
    <pointer-type-def type-id='type-id-362' size-in-bits='64' id='type-id-364'/>
    <qualified-type-def type-id='type-id-364' const='yes' id='type-id-365'/>
    <reference-type-def kind='lvalue' type-id='type-id-366' size-in-bits='64' id='type-id-367'/>
    <pointer-type-def type-id='type-id-366' size-in-bits='64' id='type-id-368'/>
    <qualified-type-def type-id='type-id-368' const='yes' id='type-id-369'/>
    <reference-type-def kind='lvalue' type-id='type-id-370' size-in-bits='64' id='type-id-371'/>
    <pointer-type-def type-id='type-id-370' size-in-bits='64' id='type-id-372'/>
    <qualified-type-def type-id='type-id-372' const='yes' id='type-id-373'/>
    <reference-type-def kind='lvalue' type-id='type-id-374' size-in-bits='64' id='type-id-375'/>
    <pointer-type-def type-id='type-id-374' size-in-bits='64' id='type-id-376'/>
    <qualified-type-def type-id='type-id-376' const='yes' id='type-id-377'/>
    <qualified-type-def type-id='type-id-378' const='yes' id='type-id-379'/>
    <pointer-type-def type-id='type-id-380' size-in-bits='64' id='type-id-381'/>
    <qualified-type-def type-id='type-id-381' const='yes' id='type-id-382'/>
    <pointer-type-def type-id='type-id-383' size-in-bits='64' id='type-id-384'/>
    <pointer-type-def type-id='type-id-385' size-in-bits='64' id='type-id-386'/>
    <qualified-type-def type-id='type-id-170' const='yes' id='type-id-387'/>
    <pointer-type-def type-id='type-id-387' size-in-bits='64' id='type-id-388'/>
    <qualified-type-def type-id='type-id-388' const='yes' id='type-id-389'/>
    <qualified-type-def type-id='type-id-289' const='yes' id='type-id-390'/>
    <reference-type-def kind='lvalue' type-id='type-id-390' size-in-bits='64' id='type-id-391'/>
    <pointer-type-def type-id='type-id-390' size-in-bits='64' id='type-id-392'/>
    <qualified-type-def type-id='type-id-392' const='yes' id='type-id-393'/>
    <reference-type-def kind='lvalue' type-id='type-id-393' size-in-bits='64' id='type-id-394'/>
    <qualified-type-def type-id='type-id-186' const='yes' id='type-id-189'/>
    <qualified-type-def type-id='type-id-195' const='yes' id='type-id-395'/>
    <reference-type-def kind='lvalue' type-id='type-id-395' size-in-bits='64' id='type-id-396'/>
    <pointer-type-def type-id='type-id-395' size-in-bits='64' id='type-id-207'/>
    <qualified-type-def type-id='type-id-207' const='yes' id='type-id-397'/>
    <qualified-type-def type-id='type-id-196' const='yes' id='type-id-398'/>
    <reference-type-def kind='lvalue' type-id='type-id-398' size-in-bits='64' id='type-id-399'/>
    <qualified-type-def type-id='type-id-202' const='yes' id='type-id-400'/>
    <reference-type-def kind='lvalue' type-id='type-id-400' size-in-bits='64' id='type-id-401'/>
    <qualified-type-def type-id='type-id-212' const='yes' id='type-id-402'/>
    <reference-type-def kind='lvalue' type-id='type-id-402' size-in-bits='64' id='type-id-403'/>
    <pointer-type-def type-id='type-id-402' size-in-bits='64' id='type-id-404'/>
    <qualified-type-def type-id='type-id-208' const='yes' id='type-id-405'/>
    <reference-type-def kind='lvalue' type-id='type-id-405' size-in-bits='64' id='type-id-406'/>
    <pointer-type-def type-id='type-id-405' size-in-bits='64' id='type-id-244'/>
    <qualified-type-def type-id='type-id-244' const='yes' id='type-id-407'/>
    <qualified-type-def type-id='type-id-211' const='yes' id='type-id-408'/>
    <reference-type-def kind='lvalue' type-id='type-id-408' size-in-bits='64' id='type-id-409'/>
    <qualified-type-def type-id='type-id-214' const='yes' id='type-id-410'/>
    <reference-type-def kind='lvalue' type-id='type-id-410' size-in-bits='64' id='type-id-411'/>
    <qualified-type-def type-id='type-id-184' const='yes' id='type-id-412'/>
    <reference-type-def kind='lvalue' type-id='type-id-412' size-in-bits='64' id='type-id-237'/>
    <pointer-type-def type-id='type-id-412' size-in-bits='64' id='type-id-413'/>
    <qualified-type-def type-id='type-id-413' const='yes' id='type-id-414'/>
    <qualified-type-def type-id='type-id-215' const='yes' id='type-id-415'/>
    <reference-type-def kind='lvalue' type-id='type-id-415' size-in-bits='64' id='type-id-239'/>
    <pointer-type-def type-id='type-id-415' size-in-bits='64' id='type-id-241'/>
    <qualified-type-def type-id='type-id-217' const='yes' id='type-id-416'/>
    <reference-type-def kind='lvalue' type-id='type-id-416' size-in-bits='64' id='type-id-417'/>
    <qualified-type-def type-id='type-id-218' const='yes' id='type-id-418'/>
    <reference-type-def kind='lvalue' type-id='type-id-418' size-in-bits='64' id='type-id-240'/>
    <qualified-type-def type-id='type-id-219' const='yes' id='type-id-419'/>
    <reference-type-def kind='lvalue' type-id='type-id-419' size-in-bits='64' id='type-id-420'/>
    <qualified-type-def type-id='type-id-221' const='yes' id='type-id-421'/>
    <reference-type-def kind='lvalue' type-id='type-id-421' size-in-bits='64' id='type-id-422'/>
    <pointer-type-def type-id='type-id-421' size-in-bits='64' id='type-id-423'/>
    <qualified-type-def type-id='type-id-423' const='yes' id='type-id-424'/>
    <qualified-type-def type-id='type-id-252' const='yes' id='type-id-425'/>
    <reference-type-def kind='lvalue' type-id='type-id-425' size-in-bits='64' id='type-id-426'/>
    <qualified-type-def type-id='type-id-254' const='yes' id='type-id-427'/>
    <reference-type-def kind='lvalue' type-id='type-id-427' size-in-bits='64' id='type-id-269'/>
    <pointer-type-def type-id='type-id-427' size-in-bits='64' id='type-id-270'/>
    <qualified-type-def type-id='type-id-270' const='yes' id='type-id-428'/>
    <qualified-type-def type-id='type-id-275' const='yes' id='type-id-429'/>
    <reference-type-def kind='lvalue' type-id='type-id-429' size-in-bits='64' id='type-id-430'/>
    <pointer-type-def type-id='type-id-429' size-in-bits='64' id='type-id-431'/>
    <qualified-type-def type-id='type-id-431' const='yes' id='type-id-432'/>
    <qualified-type-def type-id='type-id-276' const='yes' id='type-id-433'/>
    <reference-type-def kind='lvalue' type-id='type-id-433' size-in-bits='64' id='type-id-434'/>
    <pointer-type-def type-id='type-id-433' size-in-bits='64' id='type-id-435'/>
    <qualified-type-def type-id='type-id-435' const='yes' id='type-id-436'/>
    <qualified-type-def type-id='type-id-277' const='yes' id='type-id-437'/>
    <reference-type-def kind='lvalue' type-id='type-id-437' size-in-bits='64' id='type-id-438'/>
    <pointer-type-def type-id='type-id-437' size-in-bits='64' id='type-id-439'/>
    <qualified-type-def type-id='type-id-278' const='yes' id='type-id-440'/>
    <reference-type-def kind='lvalue' type-id='type-id-440' size-in-bits='64' id='type-id-441'/>
    <pointer-type-def type-id='type-id-440' size-in-bits='64' id='type-id-442'/>
    <qualified-type-def type-id='type-id-279' const='yes' id='type-id-443'/>
    <reference-type-def kind='lvalue' type-id='type-id-443' size-in-bits='64' id='type-id-444'/>
    <pointer-type-def type-id='type-id-443' size-in-bits='64' id='type-id-445'/>
    <qualified-type-def type-id='type-id-280' const='yes' id='type-id-446'/>
    <reference-type-def kind='lvalue' type-id='type-id-446' size-in-bits='64' id='type-id-447'/>
    <pointer-type-def type-id='type-id-446' size-in-bits='64' id='type-id-448'/>
    <qualified-type-def type-id='type-id-281' const='yes' id='type-id-449'/>
    <reference-type-def kind='lvalue' type-id='type-id-449' size-in-bits='64' id='type-id-450'/>
    <pointer-type-def type-id='type-id-449' size-in-bits='64' id='type-id-451'/>
    <qualified-type-def type-id='type-id-282' const='yes' id='type-id-452'/>
    <reference-type-def kind='lvalue' type-id='type-id-452' size-in-bits='64' id='type-id-453'/>
    <pointer-type-def type-id='type-id-452' size-in-bits='64' id='type-id-454'/>
    <qualified-type-def type-id='type-id-283' const='yes' id='type-id-455'/>
    <reference-type-def kind='lvalue' type-id='type-id-455' size-in-bits='64' id='type-id-456'/>
    <pointer-type-def type-id='type-id-455' size-in-bits='64' id='type-id-457'/>
    <qualified-type-def type-id='type-id-284' const='yes' id='type-id-458'/>
    <reference-type-def kind='lvalue' type-id='type-id-458' size-in-bits='64' id='type-id-459'/>
    <pointer-type-def type-id='type-id-458' size-in-bits='64' id='type-id-460'/>
    <qualified-type-def type-id='type-id-285' const='yes' id='type-id-461'/>
    <reference-type-def kind='lvalue' type-id='type-id-461' size-in-bits='64' id='type-id-462'/>
    <pointer-type-def type-id='type-id-461' size-in-bits='64' id='type-id-463'/>
    <qualified-type-def type-id='type-id-463' const='yes' id='type-id-464'/>
    <qualified-type-def type-id='type-id-362' const='yes' id='type-id-465'/>
    <reference-type-def kind='lvalue' type-id='type-id-465' size-in-bits='64' id='type-id-466'/>
    <pointer-type-def type-id='type-id-465' size-in-bits='64' id='type-id-467'/>
    <qualified-type-def type-id='type-id-467' const='yes' id='type-id-468'/>
    <qualified-type-def type-id='type-id-366' const='yes' id='type-id-469'/>
    <reference-type-def kind='lvalue' type-id='type-id-469' size-in-bits='64' id='type-id-470'/>
    <pointer-type-def type-id='type-id-469' size-in-bits='64' id='type-id-471'/>
    <qualified-type-def type-id='type-id-471' const='yes' id='type-id-472'/>
    <qualified-type-def type-id='type-id-370' const='yes' id='type-id-473'/>
    <reference-type-def kind='lvalue' type-id='type-id-473' size-in-bits='64' id='type-id-474'/>
    <pointer-type-def type-id='type-id-473' size-in-bits='64' id='type-id-475'/>
    <qualified-type-def type-id='type-id-475' const='yes' id='type-id-476'/>
    <qualified-type-def type-id='type-id-374' const='yes' id='type-id-477'/>
    <reference-type-def kind='lvalue' type-id='type-id-477' size-in-bits='64' id='type-id-478'/>
    <pointer-type-def type-id='type-id-477' size-in-bits='64' id='type-id-479'/>
    <qualified-type-def type-id='type-id-479' const='yes' id='type-id-480'/>
    <qualified-type-def type-id='type-id-380' const='yes' id='type-id-481'/>
    <reference-type-def kind='lvalue' type-id='type-id-481' size-in-bits='64' id='type-id-482'/>
    <pointer-type-def type-id='type-id-481' size-in-bits='64' id='type-id-483'/>
    <qualified-type-def type-id='type-id-483' const='yes' id='type-id-484'/>
    <qualified-type-def type-id='type-id-383' const='yes' id='type-id-485'/>
    <pointer-type-def type-id='type-id-485' size-in-bits='64' id='type-id-486'/>
    <qualified-type-def type-id='type-id-486' const='yes' id='type-id-487'/>
    <qualified-type-def type-id='type-id-385' const='yes' id='type-id-488'/>
    <pointer-type-def type-id='type-id-488' size-in-bits='64' id='type-id-489'/>
    <qualified-type-def type-id='type-id-489' const='yes' id='type-id-490'/>
    <reference-type-def kind='lvalue' type-id='type-id-491' size-in-bits='64' id='type-id-492'/>
    <qualified-type-def type-id='type-id-60' const='yes' id='type-id-188'/>
    <reference-type-def kind='lvalue' type-id='type-id-188' size-in-bits='64' id='type-id-493'/>
    <reference-type-def kind='lvalue' type-id='type-id-98' size-in-bits='64' id='type-id-494'/>
    <qualified-type-def type-id='type-id-495' const='yes' id='type-id-496'/>
    <pointer-type-def type-id='type-id-496' size-in-bits='64' id='type-id-497'/>
    <qualified-type-def type-id='type-id-497' const='yes' id='type-id-498'/>
    <qualified-type-def type-id='type-id-499' const='yes' id='type-id-500'/>
    <reference-type-def kind='lvalue' type-id='type-id-500' size-in-bits='64' id='type-id-501'/>
    <pointer-type-def type-id='type-id-500' size-in-bits='64' id='type-id-502'/>
    <qualified-type-def type-id='type-id-502' const='yes' id='type-id-503'/>
    <qualified-type-def type-id='type-id-504' const='yes' id='type-id-505'/>
    <reference-type-def kind='lvalue' type-id='type-id-505' size-in-bits='64' id='type-id-506'/>
    <pointer-type-def type-id='type-id-505' size-in-bits='64' id='type-id-507'/>
    <qualified-type-def type-id='type-id-507' const='yes' id='type-id-508'/>
    <qualified-type-def type-id='type-id-509' const='yes' id='type-id-510'/>
    <reference-type-def kind='lvalue' type-id='type-id-510' size-in-bits='64' id='type-id-511'/>
    <pointer-type-def type-id='type-id-510' size-in-bits='64' id='type-id-512'/>
    <qualified-type-def type-id='type-id-512' const='yes' id='type-id-513'/>
    <qualified-type-def type-id='type-id-514' const='yes' id='type-id-515'/>
    <reference-type-def kind='lvalue' type-id='type-id-515' size-in-bits='64' id='type-id-516'/>
    <pointer-type-def type-id='type-id-515' size-in-bits='64' id='type-id-517'/>
    <qualified-type-def type-id='type-id-517' const='yes' id='type-id-518'/>
    <qualified-type-def type-id='type-id-258' const='yes' id='type-id-519'/>
    <reference-type-def kind='lvalue' type-id='type-id-519' size-in-bits='64' id='type-id-520'/>
    <pointer-type-def type-id='type-id-519' size-in-bits='64' id='type-id-521'/>
    <qualified-type-def type-id='type-id-521' const='yes' id='type-id-522'/>
    <qualified-type-def type-id='type-id-523' const='yes' id='type-id-524'/>
    <reference-type-def kind='lvalue' type-id='type-id-524' size-in-bits='64' id='type-id-525'/>
    <pointer-type-def type-id='type-id-524' size-in-bits='64' id='type-id-526'/>
    <qualified-type-def type-id='type-id-526' const='yes' id='type-id-527'/>
    <qualified-type-def type-id='type-id-528' const='yes' id='type-id-529'/>
    <reference-type-def kind='lvalue' type-id='type-id-529' size-in-bits='64' id='type-id-530'/>
    <pointer-type-def type-id='type-id-529' size-in-bits='64' id='type-id-531'/>
    <qualified-type-def type-id='type-id-531' const='yes' id='type-id-532'/>
    <qualified-type-def type-id='type-id-533' const='yes' id='type-id-534'/>
    <reference-type-def kind='lvalue' type-id='type-id-534' size-in-bits='64' id='type-id-535'/>
    <pointer-type-def type-id='type-id-534' size-in-bits='64' id='type-id-536'/>
    <qualified-type-def type-id='type-id-536' const='yes' id='type-id-537'/>
    <qualified-type-def type-id='type-id-538' const='yes' id='type-id-539'/>
    <reference-type-def kind='lvalue' type-id='type-id-539' size-in-bits='64' id='type-id-540'/>
    <pointer-type-def type-id='type-id-539' size-in-bits='64' id='type-id-541'/>
    <qualified-type-def type-id='type-id-542' const='yes' id='type-id-543'/>
    <reference-type-def kind='lvalue' type-id='type-id-543' size-in-bits='64' id='type-id-544'/>
    <qualified-type-def type-id='type-id-545' const='yes' id='type-id-546'/>
    <reference-type-def kind='lvalue' type-id='type-id-546' size-in-bits='64' id='type-id-547'/>
    <pointer-type-def type-id='type-id-546' size-in-bits='64' id='type-id-548'/>
    <qualified-type-def type-id='type-id-548' const='yes' id='type-id-549'/>
    <qualified-type-def type-id='type-id-550' const='yes' id='type-id-551'/>
    <reference-type-def kind='lvalue' type-id='type-id-551' size-in-bits='64' id='type-id-552'/>
    <pointer-type-def type-id='type-id-551' size-in-bits='64' id='type-id-553'/>
    <qualified-type-def type-id='type-id-553' const='yes' id='type-id-554'/>
    <qualified-type-def type-id='type-id-555' const='yes' id='type-id-556'/>
    <reference-type-def kind='lvalue' type-id='type-id-556' size-in-bits='64' id='type-id-557'/>
    <pointer-type-def type-id='type-id-556' size-in-bits='64' id='type-id-558'/>
    <qualified-type-def type-id='type-id-558' const='yes' id='type-id-559'/>
    <qualified-type-def type-id='type-id-560' const='yes' id='type-id-561'/>
    <reference-type-def kind='lvalue' type-id='type-id-561' size-in-bits='64' id='type-id-562'/>
    <pointer-type-def type-id='type-id-561' size-in-bits='64' id='type-id-563'/>
    <qualified-type-def type-id='type-id-563' const='yes' id='type-id-564'/>
    <qualified-type-def type-id='type-id-565' const='yes' id='type-id-566'/>
    <pointer-type-def type-id='type-id-566' size-in-bits='64' id='type-id-567'/>
    <qualified-type-def type-id='type-id-568' const='yes' id='type-id-569'/>
    <pointer-type-def type-id='type-id-569' size-in-bits='64' id='type-id-570'/>
    <qualified-type-def type-id='type-id-570' const='yes' id='type-id-571'/>
    <qualified-type-def type-id='type-id-572' const='yes' id='type-id-573'/>
    <pointer-type-def type-id='type-id-573' size-in-bits='64' id='type-id-574'/>
    <qualified-type-def type-id='type-id-574' const='yes' id='type-id-575'/>
    <qualified-type-def type-id='type-id-576' const='yes' id='type-id-577'/>
    <pointer-type-def type-id='type-id-577' size-in-bits='64' id='type-id-578'/>
    <qualified-type-def type-id='type-id-578' const='yes' id='type-id-579'/>
    <qualified-type-def type-id='type-id-580' const='yes' id='type-id-581'/>
    <pointer-type-def type-id='type-id-581' size-in-bits='64' id='type-id-582'/>
    <qualified-type-def type-id='type-id-582' const='yes' id='type-id-583'/>
    <qualified-type-def type-id='type-id-584' const='yes' id='type-id-585'/>
    <pointer-type-def type-id='type-id-585' size-in-bits='64' id='type-id-586'/>
    <qualified-type-def type-id='type-id-586' const='yes' id='type-id-587'/>
    <qualified-type-def type-id='type-id-588' const='yes' id='type-id-589'/>
    <pointer-type-def type-id='type-id-589' size-in-bits='64' id='type-id-590'/>
    <qualified-type-def type-id='type-id-590' const='yes' id='type-id-591'/>
    <qualified-type-def type-id='type-id-592' const='yes' id='type-id-593'/>
    <reference-type-def kind='lvalue' type-id='type-id-593' size-in-bits='64' id='type-id-594'/>
    <qualified-type-def type-id='type-id-595' const='yes' id='type-id-596'/>
    <reference-type-def kind='lvalue' type-id='type-id-596' size-in-bits='64' id='type-id-597'/>
    <pointer-type-def type-id='type-id-596' size-in-bits='64' id='type-id-598'/>
    <qualified-type-def type-id='type-id-598' const='yes' id='type-id-599'/>
    <qualified-type-def type-id='type-id-600' const='yes' id='type-id-601'/>
    <pointer-type-def type-id='type-id-601' size-in-bits='64' id='type-id-602'/>
    <qualified-type-def type-id='type-id-602' const='yes' id='type-id-603'/>
    <qualified-type-def type-id='type-id-604' const='yes' id='type-id-605'/>
    <qualified-type-def type-id='type-id-606' const='yes' id='type-id-607'/>
    <pointer-type-def type-id='type-id-607' size-in-bits='64' id='type-id-608'/>
    <qualified-type-def type-id='type-id-609' const='yes' id='type-id-610'/>
    <reference-type-def kind='lvalue' type-id='type-id-610' size-in-bits='64' id='type-id-611'/>
    <pointer-type-def type-id='type-id-610' size-in-bits='64' id='type-id-612'/>
    <qualified-type-def type-id='type-id-613' const='yes' id='type-id-614'/>
    <reference-type-def kind='lvalue' type-id='type-id-614' size-in-bits='64' id='type-id-615'/>
    <qualified-type-def type-id='type-id-616' const='yes' id='type-id-617'/>
    <reference-type-def kind='lvalue' type-id='type-id-617' size-in-bits='64' id='type-id-618'/>
    <pointer-type-def type-id='type-id-617' size-in-bits='64' id='type-id-619'/>
    <qualified-type-def type-id='type-id-619' const='yes' id='type-id-620'/>
    <qualified-type-def type-id='type-id-621' const='yes' id='type-id-622'/>
    <reference-type-def kind='lvalue' type-id='type-id-622' size-in-bits='64' id='type-id-623'/>
    <pointer-type-def type-id='type-id-622' size-in-bits='64' id='type-id-624'/>
    <qualified-type-def type-id='type-id-624' const='yes' id='type-id-625'/>
    <qualified-type-def type-id='type-id-291' const='yes' id='type-id-626'/>
    <reference-type-def kind='lvalue' type-id='type-id-626' size-in-bits='64' id='type-id-627'/>
    <pointer-type-def type-id='type-id-626' size-in-bits='64' id='type-id-628'/>
    <qualified-type-def type-id='type-id-293' const='yes' id='type-id-629'/>
    <reference-type-def kind='lvalue' type-id='type-id-629' size-in-bits='64' id='type-id-630'/>
    <pointer-type-def type-id='type-id-629' size-in-bits='64' id='type-id-631'/>
    <qualified-type-def type-id='type-id-295' const='yes' id='type-id-632'/>
    <reference-type-def kind='lvalue' type-id='type-id-632' size-in-bits='64' id='type-id-633'/>
    <pointer-type-def type-id='type-id-632' size-in-bits='64' id='type-id-634'/>
    <qualified-type-def type-id='type-id-634' const='yes' id='type-id-635'/>
    <qualified-type-def type-id='type-id-636' const='yes' id='type-id-637'/>
    <reference-type-def kind='lvalue' type-id='type-id-637' size-in-bits='64' id='type-id-638'/>
    <pointer-type-def type-id='type-id-637' size-in-bits='64' id='type-id-639'/>
    <qualified-type-def type-id='type-id-640' const='yes' id='type-id-641'/>
    <reference-type-def kind='lvalue' type-id='type-id-641' size-in-bits='64' id='type-id-642'/>
    <pointer-type-def type-id='type-id-641' size-in-bits='64' id='type-id-643'/>
    <qualified-type-def type-id='type-id-644' const='yes' id='type-id-645'/>
    <reference-type-def kind='lvalue' type-id='type-id-645' size-in-bits='64' id='type-id-646'/>
    <pointer-type-def type-id='type-id-645' size-in-bits='64' id='type-id-647'/>
    <qualified-type-def type-id='type-id-648' const='yes' id='type-id-649'/>
    <reference-type-def kind='lvalue' type-id='type-id-649' size-in-bits='64' id='type-id-650'/>
    <qualified-type-def type-id='type-id-651' const='yes' id='type-id-652'/>
    <reference-type-def kind='lvalue' type-id='type-id-652' size-in-bits='64' id='type-id-653'/>
    <qualified-type-def type-id='type-id-306' const='yes' id='type-id-654'/>
    <reference-type-def kind='lvalue' type-id='type-id-654' size-in-bits='64' id='type-id-655'/>
    <pointer-type-def type-id='type-id-654' size-in-bits='64' id='type-id-656'/>
    <qualified-type-def type-id='type-id-656' const='yes' id='type-id-657'/>
    <qualified-type-def type-id='type-id-297' const='yes' id='type-id-658'/>
    <reference-type-def kind='lvalue' type-id='type-id-658' size-in-bits='64' id='type-id-659'/>
    <pointer-type-def type-id='type-id-658' size-in-bits='64' id='type-id-660'/>
    <qualified-type-def type-id='type-id-660' const='yes' id='type-id-661'/>
    <qualified-type-def type-id='type-id-662' const='yes' id='type-id-663'/>
    <reference-type-def kind='lvalue' type-id='type-id-663' size-in-bits='64' id='type-id-664'/>
    <pointer-type-def type-id='type-id-663' size-in-bits='64' id='type-id-665'/>
    <qualified-type-def type-id='type-id-665' const='yes' id='type-id-666'/>
    <qualified-type-def type-id='type-id-667' const='yes' id='type-id-668'/>
    <reference-type-def kind='lvalue' type-id='type-id-668' size-in-bits='64' id='type-id-669'/>
    <pointer-type-def type-id='type-id-668' size-in-bits='64' id='type-id-670'/>
    <qualified-type-def type-id='type-id-670' const='yes' id='type-id-671'/>
    <qualified-type-def type-id='type-id-19' const='yes' id='type-id-179'/>
    <pointer-type-def type-id='type-id-672' size-in-bits='64' id='type-id-673'/>
    <pointer-type-def type-id='type-id-674' size-in-bits='64' id='type-id-675'/>
    <reference-type-def kind='lvalue' type-id='type-id-499' size-in-bits='64' id='type-id-676'/>
    <pointer-type-def type-id='type-id-499' size-in-bits='64' id='type-id-677'/>
    <qualified-type-def type-id='type-id-677' const='yes' id='type-id-678'/>
    <pointer-type-def type-id='type-id-679' size-in-bits='64' id='type-id-680'/>
    <qualified-type-def type-id='type-id-680' const='yes' id='type-id-681'/>
    <reference-type-def kind='lvalue' type-id='type-id-504' size-in-bits='64' id='type-id-682'/>
    <pointer-type-def type-id='type-id-504' size-in-bits='64' id='type-id-683'/>
    <qualified-type-def type-id='type-id-683' const='yes' id='type-id-684'/>
    <pointer-type-def type-id='type-id-685' size-in-bits='64' id='type-id-686'/>
    <qualified-type-def type-id='type-id-686' const='yes' id='type-id-687'/>
    <reference-type-def kind='lvalue' type-id='type-id-509' size-in-bits='64' id='type-id-688'/>
    <pointer-type-def type-id='type-id-509' size-in-bits='64' id='type-id-689'/>
    <qualified-type-def type-id='type-id-689' const='yes' id='type-id-690'/>
    <pointer-type-def type-id='type-id-691' size-in-bits='64' id='type-id-692'/>
    <qualified-type-def type-id='type-id-692' const='yes' id='type-id-693'/>
    <reference-type-def kind='lvalue' type-id='type-id-514' size-in-bits='64' id='type-id-694'/>
    <pointer-type-def type-id='type-id-514' size-in-bits='64' id='type-id-695'/>
    <qualified-type-def type-id='type-id-695' const='yes' id='type-id-696'/>
    <pointer-type-def type-id='type-id-697' size-in-bits='64' id='type-id-698'/>
    <qualified-type-def type-id='type-id-698' const='yes' id='type-id-699'/>
    <reference-type-def kind='lvalue' type-id='type-id-258' size-in-bits='64' id='type-id-700'/>
    <pointer-type-def type-id='type-id-258' size-in-bits='64' id='type-id-701'/>
    <qualified-type-def type-id='type-id-701' const='yes' id='type-id-702'/>
    <reference-type-def kind='lvalue' type-id='type-id-523' size-in-bits='64' id='type-id-703'/>
    <pointer-type-def type-id='type-id-523' size-in-bits='64' id='type-id-704'/>
    <qualified-type-def type-id='type-id-704' const='yes' id='type-id-705'/>
    <reference-type-def kind='lvalue' type-id='type-id-528' size-in-bits='64' id='type-id-706'/>
    <pointer-type-def type-id='type-id-528' size-in-bits='64' id='type-id-707'/>
    <qualified-type-def type-id='type-id-707' const='yes' id='type-id-708'/>
    <reference-type-def kind='lvalue' type-id='type-id-533' size-in-bits='64' id='type-id-709'/>
    <pointer-type-def type-id='type-id-533' size-in-bits='64' id='type-id-710'/>
    <qualified-type-def type-id='type-id-710' const='yes' id='type-id-711'/>
    <reference-type-def kind='lvalue' type-id='type-id-538' size-in-bits='64' id='type-id-712'/>
    <pointer-type-def type-id='type-id-538' size-in-bits='64' id='type-id-713'/>
    <qualified-type-def type-id='type-id-713' const='yes' id='type-id-714'/>
    <reference-type-def kind='lvalue' type-id='type-id-545' size-in-bits='64' id='type-id-715'/>
    <pointer-type-def type-id='type-id-545' size-in-bits='64' id='type-id-716'/>
    <qualified-type-def type-id='type-id-716' const='yes' id='type-id-717'/>
    <reference-type-def kind='lvalue' type-id='type-id-550' size-in-bits='64' id='type-id-718'/>
    <pointer-type-def type-id='type-id-550' size-in-bits='64' id='type-id-719'/>
    <qualified-type-def type-id='type-id-719' const='yes' id='type-id-720'/>
    <reference-type-def kind='lvalue' type-id='type-id-555' size-in-bits='64' id='type-id-721'/>
    <pointer-type-def type-id='type-id-555' size-in-bits='64' id='type-id-722'/>
    <qualified-type-def type-id='type-id-722' const='yes' id='type-id-723'/>
    <reference-type-def kind='lvalue' type-id='type-id-560' size-in-bits='64' id='type-id-724'/>
    <pointer-type-def type-id='type-id-560' size-in-bits='64' id='type-id-725'/>
    <qualified-type-def type-id='type-id-725' const='yes' id='type-id-726'/>
    <pointer-type-def type-id='type-id-565' size-in-bits='64' id='type-id-727'/>
    <reference-type-def kind='lvalue' type-id='type-id-727' size-in-bits='64' id='type-id-728'/>
    <pointer-type-def type-id='type-id-580' size-in-bits='64' id='type-id-729'/>
    <qualified-type-def type-id='type-id-729' const='yes' id='type-id-730'/>
    <pointer-type-def type-id='type-id-731' size-in-bits='64' id='type-id-732'/>
    <qualified-type-def type-id='type-id-732' const='yes' id='type-id-733'/>
    <pointer-type-def type-id='type-id-584' size-in-bits='64' id='type-id-734'/>
    <qualified-type-def type-id='type-id-734' const='yes' id='type-id-735'/>
    <pointer-type-def type-id='type-id-736' size-in-bits='64' id='type-id-737'/>
    <qualified-type-def type-id='type-id-737' const='yes' id='type-id-738'/>
    <pointer-type-def type-id='type-id-588' size-in-bits='64' id='type-id-739'/>
    <qualified-type-def type-id='type-id-739' const='yes' id='type-id-740'/>
    <pointer-type-def type-id='type-id-741' size-in-bits='64' id='type-id-742'/>
    <qualified-type-def type-id='type-id-742' const='yes' id='type-id-743'/>
    <qualified-type-def type-id='type-id-744' const='yes' id='type-id-745'/>
    <reference-type-def kind='lvalue' type-id='type-id-592' size-in-bits='64' id='type-id-746'/>
    <pointer-type-def type-id='type-id-592' size-in-bits='64' id='type-id-747'/>
    <qualified-type-def type-id='type-id-747' const='yes' id='type-id-748'/>
    <reference-type-def kind='lvalue' type-id='type-id-595' size-in-bits='64' id='type-id-749'/>
    <pointer-type-def type-id='type-id-595' size-in-bits='64' id='type-id-750'/>
    <qualified-type-def type-id='type-id-750' const='yes' id='type-id-751'/>
    <pointer-type-def type-id='type-id-752' size-in-bits='64' id='type-id-753'/>
    <qualified-type-def type-id='type-id-753' const='yes' id='type-id-754'/>
    <reference-type-def kind='lvalue' type-id='type-id-600' size-in-bits='64' id='type-id-755'/>
    <pointer-type-def type-id='type-id-600' size-in-bits='64' id='type-id-756'/>
    <qualified-type-def type-id='type-id-756' const='yes' id='type-id-757'/>
    <qualified-type-def type-id='type-id-758' const='yes' id='type-id-759'/>
    <qualified-type-def type-id='type-id-760' const='yes' id='type-id-761'/>
    <qualified-type-def type-id='type-id-762' const='yes' id='type-id-763'/>
    <reference-type-def kind='lvalue' type-id='type-id-609' size-in-bits='64' id='type-id-764'/>
    <pointer-type-def type-id='type-id-609' size-in-bits='64' id='type-id-765'/>
    <reference-type-def kind='lvalue' type-id='type-id-291' size-in-bits='64' id='type-id-766'/>
    <pointer-type-def type-id='type-id-291' size-in-bits='64' id='type-id-767'/>
    <qualified-type-def type-id='type-id-767' const='yes' id='type-id-768'/>
    <reference-type-def kind='lvalue' type-id='type-id-293' size-in-bits='64' id='type-id-769'/>
    <pointer-type-def type-id='type-id-293' size-in-bits='64' id='type-id-770'/>
    <qualified-type-def type-id='type-id-770' const='yes' id='type-id-771'/>
    <reference-type-def kind='lvalue' type-id='type-id-295' size-in-bits='64' id='type-id-772'/>
    <pointer-type-def type-id='type-id-295' size-in-bits='64' id='type-id-773'/>
    <qualified-type-def type-id='type-id-773' const='yes' id='type-id-774'/>
    <reference-type-def kind='lvalue' type-id='type-id-636' size-in-bits='64' id='type-id-775'/>
    <pointer-type-def type-id='type-id-636' size-in-bits='64' id='type-id-776'/>
    <qualified-type-def type-id='type-id-776' const='yes' id='type-id-777'/>
    <reference-type-def kind='lvalue' type-id='type-id-640' size-in-bits='64' id='type-id-778'/>
    <pointer-type-def type-id='type-id-640' size-in-bits='64' id='type-id-779'/>
    <qualified-type-def type-id='type-id-779' const='yes' id='type-id-780'/>
    <reference-type-def kind='lvalue' type-id='type-id-644' size-in-bits='64' id='type-id-781'/>
    <pointer-type-def type-id='type-id-644' size-in-bits='64' id='type-id-782'/>
    <qualified-type-def type-id='type-id-782' const='yes' id='type-id-783'/>
    <pointer-type-def type-id='type-id-648' size-in-bits='64' id='type-id-784'/>
    <qualified-type-def type-id='type-id-784' const='yes' id='type-id-785'/>
    <pointer-type-def type-id='type-id-651' size-in-bits='64' id='type-id-786'/>
    <qualified-type-def type-id='type-id-786' const='yes' id='type-id-787'/>
    <pointer-type-def type-id='type-id-788' size-in-bits='64' id='type-id-789'/>
    <qualified-type-def type-id='type-id-789' const='yes' id='type-id-790'/>
    <pointer-type-def type-id='type-id-791' size-in-bits='64' id='type-id-792'/>
    <qualified-type-def type-id='type-id-792' const='yes' id='type-id-793'/>
    <pointer-type-def type-id='type-id-794' size-in-bits='64' id='type-id-795'/>
    <qualified-type-def type-id='type-id-795' const='yes' id='type-id-796'/>
    <pointer-type-def type-id='type-id-797' size-in-bits='64' id='type-id-798'/>
    <qualified-type-def type-id='type-id-798' const='yes' id='type-id-799'/>
    <pointer-type-def type-id='type-id-800' size-in-bits='64' id='type-id-801'/>
    <qualified-type-def type-id='type-id-801' const='yes' id='type-id-802'/>
    <reference-type-def kind='lvalue' type-id='type-id-306' size-in-bits='64' id='type-id-803'/>
    <pointer-type-def type-id='type-id-306' size-in-bits='64' id='type-id-804'/>
    <qualified-type-def type-id='type-id-804' const='yes' id='type-id-805'/>
    <reference-type-def kind='lvalue' type-id='type-id-297' size-in-bits='64' id='type-id-806'/>
    <pointer-type-def type-id='type-id-297' size-in-bits='64' id='type-id-807'/>
    <qualified-type-def type-id='type-id-807' const='yes' id='type-id-808'/>
    <reference-type-def kind='lvalue' type-id='type-id-662' size-in-bits='64' id='type-id-809'/>
    <pointer-type-def type-id='type-id-662' size-in-bits='64' id='type-id-193'/>
    <qualified-type-def type-id='type-id-193' const='yes' id='type-id-810'/>
    <reference-type-def kind='lvalue' type-id='type-id-667' size-in-bits='64' id='type-id-811'/>
    <pointer-type-def type-id='type-id-667' size-in-bits='64' id='type-id-812'/>
    <qualified-type-def type-id='type-id-812' const='yes' id='type-id-813'/>
    <reference-type-def kind='lvalue' type-id='type-id-21' size-in-bits='64' id='type-id-814'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-815'/>
    <pointer-type-def type-id='type-id-816' size-in-bits='64' id='type-id-230'/>
    <qualified-type-def type-id='type-id-187' const='yes' id='type-id-817'/>
    <reference-type-def kind='lvalue' type-id='type-id-817' size-in-bits='64' id='type-id-818'/>
    <pointer-type-def type-id='type-id-817' size-in-bits='64' id='type-id-819'/>
    <reference-type-def kind='lvalue' type-id='type-id-187' size-in-bits='64' id='type-id-820'/>
    <pointer-type-def type-id='type-id-187' size-in-bits='64' id='type-id-821'/>
    <qualified-type-def type-id='type-id-821' const='yes' id='type-id-822'/>
    <reference-type-def kind='lvalue' type-id='type-id-822' size-in-bits='64' id='type-id-823'/>
    <pointer-type-def type-id='type-id-824' size-in-bits='64' id='type-id-825'/>
    <pointer-type-def type-id='type-id-826' size-in-bits='64' id='type-id-232'/>
    <pointer-type-def type-id='type-id-827' size-in-bits='64' id='type-id-304'/>
    <pointer-type-def type-id='type-id-304' size-in-bits='64' id='type-id-828'/>
    <pointer-type-def type-id='type-id-829' size-in-bits='64' id='type-id-300'/>
    <pointer-type-def type-id='type-id-300' size-in-bits='64' id='type-id-830'/>
    <reference-type-def kind='lvalue' type-id='type-id-831' size-in-bits='64' id='type-id-832'/>
    <pointer-type-def type-id='type-id-831' size-in-bits='64' id='type-id-213'/>
    <reference-type-def kind='lvalue' type-id='type-id-56' size-in-bits='64' id='type-id-833'/>
    <qualified-type-def type-id='type-id-243' const='yes' id='type-id-834'/>
    <reference-type-def kind='lvalue' type-id='type-id-834' size-in-bits='64' id='type-id-835'/>
    <pointer-type-def type-id='type-id-171' size-in-bits='64' id='type-id-836'/>
    <pointer-type-def type-id='type-id-836' size-in-bits='64' id='type-id-177'/>
    <pointer-type-def type-id='type-id-173' size-in-bits='64' id='type-id-178'/>
    <pointer-type-def type-id='type-id-175' size-in-bits='64' id='type-id-182'/>
    <qualified-type-def type-id='type-id-837' const='yes' id='type-id-838'/>
    <pointer-type-def type-id='type-id-838' size-in-bits='64' id='type-id-839'/>
    <qualified-type-def type-id='type-id-840' const='yes' id='type-id-841'/>
    <reference-type-def kind='lvalue' type-id='type-id-841' size-in-bits='64' id='type-id-842'/>
    <pointer-type-def type-id='type-id-841' size-in-bits='64' id='type-id-843'/>
    <qualified-type-def type-id='type-id-844' const='yes' id='type-id-845'/>
    <reference-type-def kind='lvalue' type-id='type-id-845' size-in-bits='64' id='type-id-846'/>
    <pointer-type-def type-id='type-id-845' size-in-bits='64' id='type-id-847'/>
    <qualified-type-def type-id='type-id-848' const='yes' id='type-id-849'/>
    <reference-type-def kind='lvalue' type-id='type-id-849' size-in-bits='64' id='type-id-850'/>
    <pointer-type-def type-id='type-id-849' size-in-bits='64' id='type-id-851'/>
    <qualified-type-def type-id='type-id-852' const='yes' id='type-id-853'/>
    <reference-type-def kind='lvalue' type-id='type-id-853' size-in-bits='64' id='type-id-854'/>
    <pointer-type-def type-id='type-id-853' size-in-bits='64' id='type-id-855'/>
    <namespace-decl name='std'>
      <class-decl name='_Rb_tree&lt;long unsigned int, long unsigned int, std::_Identity&lt;long unsigned int&gt;, std::less&lt;long unsigned int&gt;, STL_Allocator&lt;long unsigned int, HeapLeakChecker::Allocator&gt; &gt;' size-in-bits='384' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='323' column='1' id='type-id-499'>
        <member-type access='protected'>
          <class-decl name='_Rb_tree_impl&lt;std::less&lt;long unsigned int&gt;, false&gt;' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='427' column='1' id='type-id-679'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-278'/>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_key_compare' type-id='type-id-616' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='428' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='_M_header' type-id='type-id-565' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='429' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='320'>
              <var-decl name='_M_node_count' type-id='type-id-61' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='430' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='_M_impl' type-id='type-id-679' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='453' column='1'/>
        </data-member>
        <member-function access='private'>
          <function-decl name='_M_erase' mangled-name='_ZNSt8_Rb_treeImmSt9_IdentityImESt4lessImE13STL_AllocatorImN15HeapLeakChecker9AllocatorEEE8_M_eraseEPSt13_Rb_tree_nodeImE' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='964' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt8_Rb_treeImmSt9_IdentityImESt4lessImE13STL_AllocatorImN15HeapLeakChecker9AllocatorEEE8_M_eraseEPSt13_Rb_tree_nodeImE'>
            <parameter type-id='type-id-677' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-856' name='__x' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='965' column='1'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='_M_insert_' mangled-name='_ZNSt8_Rb_treeImmSt9_IdentityImESt4lessImE13STL_AllocatorImN15HeapLeakChecker9AllocatorEEE10_M_insert_EPKSt18_Rb_tree_node_baseSB_RKm' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='874' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt8_Rb_treeImmSt9_IdentityImESt4lessImE13STL_AllocatorImN15HeapLeakChecker9AllocatorEEE10_M_insert_EPKSt18_Rb_tree_node_baseSB_RKm'>
            <parameter type-id='type-id-677' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-567' name='__x' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='875' column='1'/>
            <parameter type-id='type-id-567' name='__p' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='875' column='1'/>
            <parameter type-id='type-id-857' name='__v' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='875' column='1'/>
            <return type-id='type-id-545'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='_Rb_tree&lt;long unsigned int, std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt;, std::_Select1st&lt;std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt; &gt;, std::less&lt;long unsigned int&gt;, STL_Allocator&lt;std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt;, HeapLeakChecker::Allocator&gt; &gt;' size-in-bits='384' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='323' column='1' id='type-id-504'>
        <member-type access='protected'>
          <class-decl name='_Rb_tree_impl&lt;std::less&lt;long unsigned int&gt;, false&gt;' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='427' column='1' id='type-id-685'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-279'/>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_key_compare' type-id='type-id-616' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='428' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='_M_header' type-id='type-id-565' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='429' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='320'>
              <var-decl name='_M_node_count' type-id='type-id-61' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='430' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='_M_impl' type-id='type-id-685' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='453' column='1'/>
        </data-member>
        <member-function access='private'>
          <function-decl name='_M_erase' mangled-name='_ZNSt8_Rb_treeImSt4pairIKmN15HeapLeakChecker10RangeValueEESt10_Select1stIS4_ESt4lessImE13STL_AllocatorIS4_NS2_9AllocatorEEE8_M_eraseEPSt13_Rb_tree_nodeIS4_E' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='964' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt8_Rb_treeImSt4pairIKmN15HeapLeakChecker10RangeValueEESt10_Select1stIS4_ESt4lessImE13STL_AllocatorIS4_NS2_9AllocatorEEE8_M_eraseEPSt13_Rb_tree_nodeIS4_E'>
            <parameter type-id='type-id-683' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-858' name='__x' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='965' column='1'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='_M_insert_' mangled-name='_ZNSt8_Rb_treeImSt4pairIKmN15HeapLeakChecker10RangeValueEESt10_Select1stIS4_ESt4lessImE13STL_AllocatorIS4_NS2_9AllocatorEEE10_M_insert_EPKSt18_Rb_tree_node_baseSF_RKS4_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='874' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt8_Rb_treeImSt4pairIKmN15HeapLeakChecker10RangeValueEESt10_Select1stIS4_ESt4lessImE13STL_AllocatorIS4_NS2_9AllocatorEEE10_M_insert_EPKSt18_Rb_tree_node_baseSF_RKS4_'>
            <parameter type-id='type-id-683' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-567' name='__x' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='875' column='1'/>
            <parameter type-id='type-id-567' name='__p' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='875' column='1'/>
            <parameter type-id='type-id-638' name='__v' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='875' column='1'/>
            <return type-id='type-id-550'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='_Rb_tree&lt;long unsigned int, std::pair&lt;const long unsigned int, long unsigned int&gt;, std::_Select1st&lt;std::pair&lt;const long unsigned int, long unsigned int&gt; &gt;, std::less&lt;long unsigned int&gt;, STL_Allocator&lt;std::pair&lt;const long unsigned int, long unsigned int&gt;, HeapLeakChecker::Allocator&gt; &gt;' size-in-bits='384' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='323' column='1' id='type-id-509'>
        <member-type access='protected'>
          <class-decl name='_Rb_tree_impl&lt;std::less&lt;long unsigned int&gt;, false&gt;' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='427' column='1' id='type-id-691'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-280'/>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_key_compare' type-id='type-id-616' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='428' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='_M_header' type-id='type-id-565' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='429' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='320'>
              <var-decl name='_M_node_count' type-id='type-id-61' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='430' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='_M_impl' type-id='type-id-691' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='453' column='1'/>
        </data-member>
        <member-function access='private'>
          <function-decl name='_M_erase' mangled-name='_ZNSt8_Rb_treeImSt4pairIKmmESt10_Select1stIS2_ESt4lessImE13STL_AllocatorIS2_N15HeapLeakChecker9AllocatorEEE8_M_eraseEPSt13_Rb_tree_nodeIS2_E' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='964' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt8_Rb_treeImSt4pairIKmmESt10_Select1stIS2_ESt4lessImE13STL_AllocatorIS2_N15HeapLeakChecker9AllocatorEEE8_M_eraseEPSt13_Rb_tree_nodeIS2_E'>
            <parameter type-id='type-id-689' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-859' name='__x' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='965' column='1'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='_M_insert_' mangled-name='_ZNSt8_Rb_treeImSt4pairIKmmESt10_Select1stIS2_ESt4lessImE13STL_AllocatorIS2_N15HeapLeakChecker9AllocatorEEE10_M_insert_EPKSt18_Rb_tree_node_baseSE_RKS2_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='874' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt8_Rb_treeImSt4pairIKmmESt10_Select1stIS2_ESt4lessImE13STL_AllocatorIS2_N15HeapLeakChecker9AllocatorEEE10_M_insert_EPKSt18_Rb_tree_node_baseSE_RKS2_'>
            <parameter type-id='type-id-689' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-567' name='__x' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='875' column='1'/>
            <parameter type-id='type-id-567' name='__p' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='875' column='1'/>
            <parameter type-id='type-id-642' name='__v' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='875' column='1'/>
            <return type-id='type-id-555'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='_Rb_tree&lt;std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt;, std::_Select1st&lt;std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt; &gt;, std::less&lt;std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt; &gt;, STL_Allocator&lt;std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt;, HeapLeakChecker::Allocator&gt; &gt;' size-in-bits='384' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='323' column='1' id='type-id-514'>
        <member-type access='protected'>
          <class-decl name='_Rb_tree_impl&lt;std::less&lt;std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt; &gt;, false&gt;' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='427' column='1' id='type-id-697'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-281'/>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_key_compare' type-id='type-id-621' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='428' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='_M_header' type-id='type-id-565' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='429' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='320'>
              <var-decl name='_M_node_count' type-id='type-id-61' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='430' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='_M_impl' type-id='type-id-697' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='453' column='1'/>
        </data-member>
        <member-function access='private'>
          <function-decl name='_M_erase' mangled-name='_ZNSt8_Rb_treeISbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEESt4pairIKS6_St6vectorI11AllocObjectS2_ISA_S4_EEESt10_Select1stISD_ESt4lessIS6_ES2_ISD_S4_EE8_M_eraseEPSt13_Rb_tree_nodeISD_E' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='964' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt8_Rb_treeISbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEESt4pairIKS6_St6vectorI11AllocObjectS2_ISA_S4_EEESt10_Select1stISD_ESt4lessIS6_ES2_ISD_S4_EE8_M_eraseEPSt13_Rb_tree_nodeISD_E'>
            <parameter type-id='type-id-695' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-860' name='__x' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='965' column='1'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='_M_insert_' mangled-name='_ZNSt8_Rb_treeISbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEESt4pairIKS6_St6vectorI11AllocObjectS2_ISA_S4_EEESt10_Select1stISD_ESt4lessIS6_ES2_ISD_S4_EE10_M_insert_EPKSt18_Rb_tree_node_baseSM_RKSD_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='874' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt8_Rb_treeISbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEESt4pairIKS6_St6vectorI11AllocObjectS2_ISA_S4_EEESt10_Select1stISD_ESt4lessIS6_ES2_ISD_S4_EE10_M_insert_EPKSt18_Rb_tree_node_baseSM_RKSD_'>
            <parameter type-id='type-id-695' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-567' name='__x' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='875' column='1'/>
            <parameter type-id='type-id-567' name='__p' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='875' column='1'/>
            <parameter type-id='type-id-646' name='__v' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='875' column='1'/>
            <return type-id='type-id-560'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='_M_insert_unique' mangled-name='_ZNSt8_Rb_treeISbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEESt4pairIKS6_St6vectorI11AllocObjectS2_ISA_S4_EEESt10_Select1stISD_ESt4lessIS6_ES2_ISD_S4_EE16_M_insert_uniqueERKSD_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='1161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt8_Rb_treeISbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEESt4pairIKS6_St6vectorI11AllocObjectS2_ISA_S4_EEESt10_Select1stISD_ESt4lessIS6_ES2_ISD_S4_EE16_M_insert_uniqueERKSD_'>
            <parameter type-id='type-id-695' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-646' name='__v' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='1162' column='1'/>
            <return type-id='type-id-800'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='_M_insert_unique_' mangled-name='_ZNSt8_Rb_treeISbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEESt4pairIKS6_St6vectorI11AllocObjectS2_ISA_S4_EEESt10_Select1stISD_ESt4lessIS6_ES2_ISD_S4_EE17_M_insert_unique_ESt23_Rb_tree_const_iteratorISD_ERKSD_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='1206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt8_Rb_treeISbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEESt4pairIKS6_St6vectorI11AllocObjectS2_ISA_S4_EEESt10_Select1stISD_ESt4lessIS6_ES2_ISD_S4_EE17_M_insert_unique_ESt23_Rb_tree_const_iteratorISD_ERKSD_'>
            <parameter type-id='type-id-695' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-538' name='__position' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='1207' column='1'/>
            <parameter type-id='type-id-646' name='__v' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='1207' column='1'/>
            <return type-id='type-id-560'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='allocator&lt;void (*)()&gt;' size-in-bits='8' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/allocator.h' line='87' column='1' id='type-id-592'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-380'/>
      </class-decl>
      <class-decl name='basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;' size-in-bits='64' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='105' column='1' id='type-id-595'>
        <member-type access='private'>
          <class-decl name='_Alloc_hider' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='258' column='1' id='type-id-752'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-276'/>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_p' type-id='type-id-99' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='262' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='_Rep' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='148' column='1' id='type-id-600'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-861'/>
            <data-member access='public' static='yes'>
              <var-decl name='_S_max_size' type-id='type-id-98' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='51' column='1'/>
            </data-member>
            <data-member access='public' static='yes'>
              <var-decl name='_S_terminal' type-id='type-id-862' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep11_S_terminalE' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='56' column='1' elf-symbol-id='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep11_S_terminalE'/>
            </data-member>
            <data-member access='public' static='yes'>
              <var-decl name='_S_empty_rep_storage' type-id='type-id-287' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep20_S_empty_rep_storageE' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='68' column='1' elf-symbol-id='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep20_S_empty_rep_storageE'/>
            </data-member>
            <member-function access='public'>
              <function-decl name='_M_destroy' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep10_M_destroyERKS4_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='445' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep10_M_destroyERKS4_'>
                <parameter type-id='type-id-756' name='this' is-artificial='yes'/>
                <parameter type-id='type-id-434' name='__a' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='446' column='1'/>
                <return type-id='type-id-58'/>
              </function-decl>
            </member-function>
            <member-function access='public' static='yes'>
              <function-decl name='_S_create' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep9_S_createEmmRKS4_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='546' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep9_S_createEmmRKS4_'>
                <parameter type-id='type-id-61' name='__capacity' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='547' column='1'/>
                <parameter type-id='type-id-61' name='__old_capacity' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='547' column='1'/>
                <parameter type-id='type-id-434' name='__alloc' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='548' column='1'/>
                <return type-id='type-id-756'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='_Rep_base' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-861'/>
        </member-type>
        <data-member access='private' static='yes'>
          <var-decl name='npos' type-id='type-id-98' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='270' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_dataplus' type-id='type-id-752' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='274' column='1'/>
        </data-member>
        <member-function access='private' destructor='yes'>
          <function-decl name='~basic_string' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEED1Ev' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='502' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEED1Ev'>
            <parameter type-id='type-id-750' name='this' is-artificial='yes'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='basic_string' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEEC1ERKS5_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEEC1ERKS5_'>
            <parameter type-id='type-id-750' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-597' name='__str' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='171' column='1'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='basic_string' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEEC2EPKcRKS4_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='213' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEEC2EPKcRKS4_'>
            <parameter type-id='type-id-750' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-60' name='__s' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='214' column='1'/>
            <parameter type-id='type-id-434' name='__a' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='214' column='1'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='map&lt;long unsigned int, HeapLeakChecker::RangeValue, std::less&lt;long unsigned int&gt;, STL_Allocator&lt;std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt;, HeapLeakChecker::Allocator&gt; &gt;' size-in-bits='384' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_map.h' line='87' column='1' id='type-id-291'>
        <member-type access='private'>
          <class-decl name='value_compare' visibility='default' is-declaration-only='yes' id='type-id-863'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_t' type-id='type-id-504' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_map.h' line='128' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='map&lt;long unsigned int, long unsigned int, std::less&lt;long unsigned int&gt;, STL_Allocator&lt;std::pair&lt;const long unsigned int, long unsigned int&gt;, HeapLeakChecker::Allocator&gt; &gt;' size-in-bits='384' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_map.h' line='87' column='1' id='type-id-293'>
        <member-type access='private'>
          <class-decl name='value_compare' visibility='default' is-declaration-only='yes' id='type-id-864'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_t' type-id='type-id-509' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_map.h' line='128' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='map&lt;std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt;, std::less&lt;std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt; &gt;, STL_Allocator&lt;std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt;, HeapLeakChecker::Allocator&gt; &gt;' size-in-bits='384' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_map.h' line='87' column='1' id='type-id-295'>
        <member-type access='private'>
          <class-decl name='value_compare' visibility='default' is-declaration-only='yes' id='type-id-865'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_t' type-id='type-id-514' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_map.h' line='128' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='set&lt;long unsigned int, std::less&lt;long unsigned int&gt;, STL_Allocator&lt;long unsigned int, HeapLeakChecker::Allocator&gt; &gt;' size-in-bits='384' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_set.h' line='88' column='1' id='type-id-306'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_t' type-id='type-id-499' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_set.h' line='112' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt;' size-in-bits='192' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_vector.h' line='171' column='1' id='type-id-297'>
        <base-class access='protected' layout-offset-in-bits='0' type-id='type-id-580'/>
        <member-function access='protected'>
          <function-decl name='_M_insert_aux' mangled-name='_ZNSt6vectorI11AllocObject13STL_AllocatorIS0_N15HeapLeakChecker9AllocatorEEE13_M_insert_auxEN9__gnu_cxx17__normal_iteratorIPS0_S5_EERKS0_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/vector.tcc' line='295' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt6vectorI11AllocObject13STL_AllocatorIS0_N15HeapLeakChecker9AllocatorEEE13_M_insert_auxEN9__gnu_cxx17__normal_iteratorIPS0_S5_EERKS0_'>
            <parameter type-id='type-id-807' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-362' name='__position' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/vector.tcc' line='296' column='1'/>
            <parameter type-id='type-id-391' name='__x' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/vector.tcc' line='296' column='1'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='vector&lt;void (*)(), std::allocator&lt;void (*)()&gt; &gt;' size-in-bits='192' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_vector.h' line='171' column='1' id='type-id-662'>
        <base-class access='protected' layout-offset-in-bits='0' type-id='type-id-584'/>
        <member-function access='protected'>
          <function-decl name='_M_insert_aux' mangled-name='_ZNSt6vectorIPFvvESaIS1_EE13_M_insert_auxEN9__gnu_cxx17__normal_iteratorIPS1_S3_EERKS1_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/vector.tcc' line='295' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt6vectorIPFvvESaIS1_EE13_M_insert_auxEN9__gnu_cxx17__normal_iteratorIPS1_S3_EERKS1_'>
            <parameter type-id='type-id-193' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-370' name='__position' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/vector.tcc' line='296' column='1'/>
            <parameter type-id='type-id-818' name='__x' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/vector.tcc' line='296' column='1'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='vector&lt;void*, STL_Allocator&lt;void*, HeapLeakChecker::Allocator&gt; &gt;' size-in-bits='192' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_vector.h' line='171' column='1' id='type-id-667'>
        <base-class access='protected' layout-offset-in-bits='0' type-id='type-id-588'/>
        <member-function access='protected'>
          <function-decl name='_M_insert_aux' mangled-name='_ZNSt6vectorIPv13STL_AllocatorIS0_N15HeapLeakChecker9AllocatorEEE13_M_insert_auxEN9__gnu_cxx17__normal_iteratorIPS0_S5_EERKS0_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/vector.tcc' line='295' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt6vectorIPv13STL_AllocatorIS0_N15HeapLeakChecker9AllocatorEEE13_M_insert_auxEN9__gnu_cxx17__normal_iteratorIPS0_S5_EERKS0_'>
            <parameter type-id='type-id-812' name='this' is-artificial='yes'/>
            <parameter type-id='type-id-374' name='__position' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/vector.tcc' line='296' column='1'/>
            <parameter type-id='type-id-832' name='__x' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/vector.tcc' line='296' column='1'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
      </class-decl>
      <enum-decl name='_Rb_tree_color' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='85' column='1' id='type-id-866'>
        <underlying-type type-id='type-id-81'/>
        <enumerator name='_S_red' value='0'/>
        <enumerator name='_S_black' value='1'/>
      </enum-decl>
      <class-decl name='_Destroy_aux&lt;true&gt;' is-struct='yes' visibility='default' id='type-id-867'/>
      <class-decl name='_Identity&lt;long unsigned int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='469' column='1' id='type-id-495'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-868'/>
      </class-decl>
      <class-decl name='_Rb_tree_const_iterator&lt;MemoryRegionMap::Region&gt;' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='224' column='1' id='type-id-258'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='_M_node' type-id='type-id-869' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='294' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='_Rb_tree_const_iterator&lt;long unsigned int&gt;' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='224' column='1' id='type-id-523'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='_M_node' type-id='type-id-869' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='294' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='_Rb_tree_const_iterator&lt;std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt; &gt;' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='224' column='1' id='type-id-528'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='_M_node' type-id='type-id-869' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='294' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='_Rb_tree_const_iterator&lt;std::pair&lt;const long unsigned int, long unsigned int&gt; &gt;' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='224' column='1' id='type-id-533'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='_M_node' type-id='type-id-869' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='294' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='_Rb_tree_const_iterator&lt;std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt; &gt;' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='224' column='1' id='type-id-538'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='_M_node' type-id='type-id-869' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='294' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='_Rb_tree_iterator&lt;long unsigned int&gt;' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='154' column='1' id='type-id-545'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='_M_node' type-id='type-id-870' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='219' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='_Rb_tree_iterator&lt;std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt; &gt;' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='154' column='1' id='type-id-550'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='_M_node' type-id='type-id-870' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='219' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='_Rb_tree_iterator&lt;std::pair&lt;const long unsigned int, long unsigned int&gt; &gt;' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='154' column='1' id='type-id-555'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='_M_node' type-id='type-id-870' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='219' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='_Rb_tree_iterator&lt;std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt; &gt;' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='154' column='1' id='type-id-560'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='_M_node' type-id='type-id-870' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='219' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='_Rb_tree_node_base' size-in-bits='256' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='88' column='1' id='type-id-565'>
        <member-type access='public'>
          <typedef-decl name='_Base_ptr' type-id='type-id-727' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='89' column='1' id='type-id-870'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='_Const_Base_ptr' type-id='type-id-567' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='90' column='1' id='type-id-869'/>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='_M_color' type-id='type-id-866' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='92' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='_M_parent' type-id='type-id-870' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='93' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='_M_left' type-id='type-id-870' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='94' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='_M_right' type-id='type-id-870' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='95' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='_Select1st&lt;std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='482' column='1' id='type-id-568'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-871'/>
      </class-decl>
      <class-decl name='_Select1st&lt;std::pair&lt;const long unsigned int, long unsigned int&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='482' column='1' id='type-id-572'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-872'/>
      </class-decl>
      <class-decl name='_Select1st&lt;std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='482' column='1' id='type-id-576'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-873'/>
      </class-decl>
      <class-decl name='_Vector_base&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt;' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_vector.h' line='70' column='1' id='type-id-580'>
        <member-type access='public'>
          <class-decl name='_Vector_impl' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_vector.h' line='75' column='1' id='type-id-731'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-275'/>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_start' type-id='type-id-311' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_vector.h' line='76' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='_M_finish' type-id='type-id-311' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_vector.h' line='77' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='_M_end_of_storage' type-id='type-id-311' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_vector.h' line='78' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='_M_impl' type-id='type-id-731' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_vector.h' line='136' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='_Vector_base&lt;void (*)(), std::allocator&lt;void (*)()&gt; &gt;' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_vector.h' line='70' column='1' id='type-id-584'>
        <member-type access='public'>
          <class-decl name='_Vector_impl' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_vector.h' line='75' column='1' id='type-id-736'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-592'/>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_start' type-id='type-id-821' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_vector.h' line='76' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='_M_finish' type-id='type-id-821' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_vector.h' line='77' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='_M_end_of_storage' type-id='type-id-821' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_vector.h' line='78' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='_M_impl' type-id='type-id-736' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_vector.h' line='136' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='_Vector_base&lt;void*, STL_Allocator&lt;void*, HeapLeakChecker::Allocator&gt; &gt;' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_vector.h' line='70' column='1' id='type-id-588'>
        <member-type access='public'>
          <class-decl name='_Vector_impl' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_vector.h' line='75' column='1' id='type-id-741'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-285'/>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_start' type-id='type-id-243' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_vector.h' line='76' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='_M_finish' type-id='type-id-243' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_vector.h' line='77' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='_M_end_of_storage' type-id='type-id-243' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_vector.h' line='78' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='_M_impl' type-id='type-id-741' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_vector.h' line='136' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__alloc_swap&lt;STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt;, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/allocator.h' line='148' column='1' id='type-id-874'/>
      <class-decl name='__copy_move&lt;false, false, std::random_access_iterator_tag&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='335' column='1' id='type-id-875'/>
      <class-decl name='__copy_move&lt;false, true, std::random_access_iterator_tag&gt;' is-struct='yes' visibility='default' id='type-id-876'/>
      <class-decl name='__copy_move_backward&lt;false, false, std::random_access_iterator_tag&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='539' column='1' id='type-id-877'/>
      <class-decl name='__copy_move_backward&lt;false, true, std::random_access_iterator_tag&gt;' is-struct='yes' visibility='default' id='type-id-878'/>
      <class-decl name='__false_type' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/cpp_type_traits.h' line='79' column='1' id='type-id-879'/>
      <class-decl name='__miter_base&lt;AllocObject*, false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='285' column='1' id='type-id-880'/>
      <class-decl name='__miter_base&lt;__gnu_cxx::__normal_iterator&lt;AllocObject*, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt;, false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='285' column='1' id='type-id-881'/>
      <class-decl name='__miter_base&lt;void (**)(), false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='285' column='1' id='type-id-882'/>
      <class-decl name='__miter_base&lt;void**, false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='285' column='1' id='type-id-883'/>
      <class-decl name='__niter_base&lt;AllocObject*, false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='267' column='1' id='type-id-884'/>
      <class-decl name='__niter_base&lt;__gnu_cxx::__normal_iterator&lt;AllocObject*, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt;, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='267' column='1' id='type-id-885'/>
      <class-decl name='__niter_base&lt;void (**)(), false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='267' column='1' id='type-id-886'/>
      <class-decl name='__niter_base&lt;void**, false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='267' column='1' id='type-id-887'/>
      <class-decl name='__uninitialized_copy&lt;true&gt;' is-struct='yes' visibility='default' id='type-id-888'/>
      <class-decl name='basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;' is-struct='yes' visibility='default' id='type-id-889'/>
      <class-decl name='bidirectional_iterator_tag' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_iterator_base_types.h' line='86' column='1' id='type-id-890'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-891'/>
      </class-decl>
      <class-decl name='binary_function&lt;long unsigned int, long unsigned int, bool&gt;' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='113' column='1' id='type-id-892'/>
      <class-decl name='binary_function&lt;std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, bool&gt;' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='113' column='1' id='type-id-893'/>
      <class-decl name='char_traits&lt;char&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/char_traits.h' line='238' column='1' id='type-id-894'>
        <member-type access='public'>
          <typedef-decl name='char_type' type-id='type-id-70' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/char_traits.h' line='239' column='1' id='type-id-609'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='int_type' type-id='type-id-1' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/char_traits.h' line='240' column='1' id='type-id-613'/>
        </member-type>
      </class-decl>
      <class-decl name='forward_iterator_tag' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_iterator_base_types.h' line='83' column='1' id='type-id-891'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-895'/>
      </class-decl>
      <class-decl name='input_iterator_tag' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_iterator_base_types.h' line='79' column='1' id='type-id-895'/>
      <class-decl name='less&lt;long unsigned int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='227' column='1' id='type-id-616'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-892'/>
      </class-decl>
      <class-decl name='less&lt;std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='227' column='1' id='type-id-621'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-893'/>
      </class-decl>
      <class-decl name='pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt;' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='68' column='1' id='type-id-636'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='first' type-id='type-id-672' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='72' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='second' type-id='type-id-202' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='73' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='pair&lt;const long unsigned int, long unsigned int&gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='68' column='1' id='type-id-640'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='first' type-id='type-id-672' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='72' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='second' type-id='type-id-21' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='73' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt;' size-in-bits='256' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='68' column='1' id='type-id-644'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='first' type-id='type-id-596' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='72' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='second' type-id='type-id-297' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_pair.h' line='73' column='1'/>
        </data-member>
      </class-decl>
